{
  "id": 2502,
  "name": "Monthly Spotify Track Archiving and Playlist Classification",
  "description": "Monthly Spotify Track Archiving and Playlist Classification\n\nThis n8n workflow allows you to automatically archive your monthly Spotify liked tracks in a Google Sheet, along with playlist details and descriptions. Based on this data, Claude 3.5 is used to classify each track into multiple playlists and add them in bulk.\n\nWho is this template for?\nThis workflow template is perfect for Spotify users who want to systematically archive their listening history and organize their tracks into custom playlists.\n\nWhat problem does this workflow solve?\nIt automates the monthly process of tracking, storing, and categorizing Spotify tracks into relevant playlists, helping users maintain well-organized music collections and keep a historical record of their listening habits.\n\nWorkflow Overview\nTrigger Options**: Can be initiated manually or on a set schedule.\nSpotify Playlists Retrieval**: Fetches the current playlists and filters them by owner.\nTrack Details Collection**: Retrieves information such as track ID and popularity from the user’s library.\nAudio Features Fetching**: Uses Spotify's API to get audio features for each track.\nData Merging**: Combines track information with their audio features.\nDuplicate Checking**: Filters out tracks that have already been logged in Google Sheets.\nData Logging**: Archives new tracks into a Google Sheet.\nAI Classification**: Uses an AI model to classify tracks into suitable playlists.\nPlaylist Updates**: Adds classified tracks to the corresponding playlists.\n\nSetup Instructions\nCredentials Setup:  \n   Make sure you have valid Spotify OAuth2 and Google Sheets access credentials.\nTrigger Configuration:  \n   Choose between manual or scheduled triggers to start the workflow.\nGoogle Sheets Preparation:  \n   Set up a Google Sheet with the necessary structure for logging track details.\nSpotify Playlists Setup:  \n   Have a diverse range of playlists and exhaustive description (see example) ready to accommodate different music genres and moods.\n\nCustomization Options\nAdjust Playlist Conditions**:  \n   Modify the AI model’s classification criteria to align with your personal music preferences.\nEnhance Track Analysis**:  \n   Incorporate additional audio features or external data sources for more refined track categorization.\nPersonalize Data Logging**:  \n   Customize which track attributes to log in Google Sheets based on your archival preferences.\nConfigure Scheduling**:  \n   Set a preferred schedule for periodic track archiving, e.g., monthly or weekly.\n\nCost Estimate \nFor 300 tracks, the token usage amounts to approximately 60,000 tokens (58,000 for input and 2,000 for completion), costing around 20 cents with Claude 3.5 Sonnet (as of October 2024).\n\nPlaylists' Description Examples\n\n\n| Playlist Name           | Playlist Description                                                                                                                                             |\n|-------------------------|------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Classique               | Indulge in the timeless beauty of classical music with this refined playlist. From baroque to romantic periods, this collection showcases renowned compositions.   |\n| Poi                     | Find your flow with this dynamic playlist tailored for poi, staff, and ball juggling. Featuring rhythmic tracks that complement your movements.                   |\n| Pro Sound               | Boost your productivity and focus with this carefully selected mix of concentration-enhancing music. Ideal for work or study sessions.                           |\n| ChillySleep             | Drift off to dreamland with this soothing playlist of sleep-inducing tracks. Gentle melodies and ambient sounds create a peaceful atmosphere for restful sleep.  |\n| To Sing                 | Warm up your vocal cords and sing your heart out with karaoke-friendly tracks. Featuring popular songs, perfect for solo performances or group sing-alongs.      |\n| 1990s                   | Relive the diverse musical landscape of the 90s with this eclectic mix. From grunge to pop, hip-hop to electronic, this playlist showcases defining genres.       |\n| 1980s                   | Take a nostalgic trip back to the era of big hair and neon with this 80s playlist. Packed with iconic hits and forgotten gems, capturing the energy of the decade.|\n| Groove Up               | Elevate your mood and energy with this upbeat playlist. Featuring a mix of feel-good tracks across various genres to lift your spirits and get you moving.       |\n| Reggae & Dub            | Relax and unwind with the laid-back vibes of reggae and dub. This playlist combines classic reggae tunes with deep, spacious dub tracks for a chilled-out vibe.   |\n| Psytrance               | Embark on a mind-bending journey with this collection of psychedelic trance tracks. Ideal for late-night dance sessions or intense focus.                        |\n| Cumbia                  | Sway to the infectious rhythms of Cumbia with this lively playlist. Blending traditional Latin American sounds with modern interpretations for a danceable mix.  |\n| Funky Groove            | Get your body moving with this collection of funk and disco tracks. Featuring irresistible basslines and catchy rhythms, perfect for dance parties.              |\n| French Chanson          | Experience the romance and charm of France with this mix of classic and modern French songs, capturing the essence of French musical culture.                    |\n| Workout Motivation      | Push your limits and power through your exercise routine with this high-energy playlist. From warm-up to cool-down, these tracks will keep you motivated.        |\n| Cinematic Instrumentals | Immerse yourself in a world of atmospheric sounds with this collection of cinematic instrumental tracks, perfect for focus, relaxation, or contemplation.        |\n",
  "totalViews": 1078,
  "source": "official",
  "user": {
    "id": 91857,
    "name": "Arnaud MARIE",
    "username": "arnaud-marie",
    "bio": "I love n8n. \n\nHere's my soul purpose: \nTo better learn and transcend myself to better help others achieve their true potential.",
    "verified": false,
    "links": "[\"https://www.linkedin.com/in/the-growth-juggler/\"]",
    "avatar": "https://gravatar.com/avatar/06fdba2b484ebbdbd6447611a6831f8e7b8902cec593eb5429cbd432cce1d2db?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes",
    "Miscellaneous",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Spotify",
      "type": "n8n-nodes-base.spotify",
      "categories": [
        "Miscellaneous"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "Basic LLM Chain",
      "type": "@n8n/n8n-nodes-langchain.chainLlm",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Anthropic Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatAnthropic",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Structured Output Parser",
      "type": "@n8n/n8n-nodes-langchain.outputParserStructured",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Output Parsers"
        ]
      }
    }
  ],
  "nodeCount": 7,
  "createdAt": "2024-10-27T17:36:47.297Z",
  "path": "official/template_2502/workflow.json"
}