{
  "id": 2506,
  "name": "Import workflows and map their credentials using a Multi-Form",
  "description": "Purpose\n\nThis workflow allows you to import any workflow from a file or another n8n instance and map the credentials easily.\n\nHow it works\n\nA multi-form setup guides you through the entire process\nAt the beginning you have two options:\n    Upload a workflow file (JSON)\n    Copy workflow from a remote n8n instance\nIf you choose the second option, you get to choose one of your predefined (in the Settings node) remote instances first, then it retrieves a list of all the workflows using the n8n API which you then can choose a workflow from.\nNow both initial options come together - the workflow file is being processed\nIn parallel all credentials of the current instance are being retrieved using the Execute Command node\nThe next form page enables a mapping of all the credentials used in the workflow. The matching happens between the names (because one workflow can contain different credentials of the same type) of the original credentials and the ones available on the current instance. Every option then shows all available credentials of the same type. In addition the user has always the choice to create a new credential on the fly.\nFor every option which was set to create a new credential, an empty credential is being created on the current instance using the n8n API. An emoji is being appended to the name, which indicates that it needs to be populated.\nFinally the workflow gets updated with the new credential ID’s and created on the current instance using the n8n API. Then the user gets a message, if the process has succeeded or not.\n\nSetup\n\nSelect your credentials in the nodes which require those\nConfigure your remote instance(s) in the Settings node. (You can skip this step, if you only want to use the File Upload feature)\n    Every instance is defined as object with the keys name, apiKey and baseUrl. Those instances are then wrapped inside an array. You can find an example described within a note on the workflow canvas.\n\nHow to use\n\nGrab the (production) URL of the Form from the first node\nOpen the URL and follow the instructions given in the multi-form\n\nDisclaimer\n\nSecurity: Beware, that all credentials are being decrypted and processed within the workflow. Also the API keys to other n8n instances are stored within the workflow.\nThis solution is primarily meant for transferring data between testing environments. For production use consider the n8n enterprise edition which provides a reliable way to deploy workflows between different environments without the need of manual credential mapping.",
  "totalViews": 1849,
  "source": "official",
  "user": {
    "id": 91699,
    "name": "Mario",
    "username": "octionic",
    "bio": "Workflow Optimization Expert | Software Architect. Use my link to book an initial consultation for custom built workflows using n8n.",
    "verified": true,
    "links": "[\"https://octionic.com\"]",
    "avatar": "https://gravatar.com/avatar/48bf351cec848d87566d8cc78c9a783ec4807408366648de04cfe955d7a5ba21?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-10-29T19:05:29.604Z",
  "path": "official/template_2506/workflow.json"
}