{
  "id": 2857,
  "name": "Pattern for Multiple Triggers Combined to Continue Workflow",
  "description": "Overview\n\nThis template describes a possible approach to handle a pseudo-callback/trigger from an independent, external process (initiated from a workflow) and combine the received input with the workflow execution that is already in progress.  This requires the external system to pass through some context information (resumeUrl), but allows the \"primary\" workflow execution to continue with BOTH its own (previous-node) context, AND the input received in the \"secondary\" trigger/process.\n\nPrimary Workflow Trigger/Execution\nThe workflow path from the primary trigger initiates some external, independent process and provides \"context\" which includes the value of $execution.resumeUrl. This execution then reaches a Wait node configured with Resume - On Webhook Call  and stops until a call to resumeUrl is received.\n\nExternal, Independent Process\nThe external, independent process could be anything like a Telegram conversation, or a web-service as long as:\nit results in a single execution of the Secondary Workflow Trigger, and\nit can pass through the value of resumeUrl associated with the Primary Workflow Execution\n\nSecondary Workflow Trigger/Execution\nThe secondary workflow execution can start with any kind of trigger as long as part of the input can include the resumeUrl.  To combine / rejoin the primary workflow execution, this execution passes along whatever it receives from its trigger input to the resume-webhook endpoint on the Wait node.\n\nNotes\nIMPORTANT: The workflow ids in the Set nodes marked **Update Me have embedded references to the workflow IDs in the original system.  They will need to be CHANGED to make this demo work.\nNote: The Resume Other Workflow Execution node in the template uses the $env.WEBHOOK_URL configuration to convert to an internal \"localhost\" call in a Docker environment.  This can be done differently.\nALERT:** This pattern is NOT suitable for a workflow that handles multiple items because the first workflow execution will only be waiting for one callback.\nThe second workflow (not the second trigger in the first workflow) is just to demonstrate how the Independent, External Process needs to work.\n",
  "totalViews": 863,
  "source": "official",
  "user": {
    "id": 91880,
    "name": "Hubschrauber",
    "username": "hubschrauber",
    "bio": "Software developer specializing in \"back-end plumbing\" to connect and sync data between large corporate systems, enabling application distribution/migration, scaling, and containerization.  Using n8n for various orchestration tasks both at home and \"on the job.\"",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/937647d994a5af6961d76103821d84448e970d74e6d0d303e8a76b56fd1da695?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    }
  ],
  "nodeCount": 1,
  "createdAt": "2025-02-07T01:14:59.594Z",
  "path": "official/template_2857/workflow.json"
}