{
  "id": 2123,
  "name": "Simple Google indexing Workflow in N8N",
  "description": "What it does\nThe workflow is a simple yet efficient way to automate the process of indexing your website on Google using the Google Indexing API.\n\nHow it works\n\nIt works by extracting information from your sitemap, converting it into a JSON file, and looping through each URL to submit it for indexing. \n\n\nHere's a brief rundown of the workflow:\n\nThe workflow can be triggered manually via the \"Execute Workflow\" button or scheduled to run at a specific time using the \"Schedule Trigger\" node.\n\nThe sitemap of your website is fetched using the \"sitemap_set\" node with a HTTP Request to the sitemap URL. \n\nThis XML sitemap is then converted into a JSON file using the \"sitemap_convert\" node.\n\nThe \"sitemap_parse\" node splits the JSON file into individual URLs.\n\nThe \"url_set\" node then prepares each URL to be sent to the Google Indexing API.\n\nA loop is created using the \"loop\" node to process each URL individually and make a POST request to Google Indexing API indicating that the URL has been updated.\n\nIf the POST request is successful and the URL has been updated, the workflow waits for 2 seconds before moving to the next URL.\n\nIn case the daily limit for the Google Indexing API is reached (200/day by default), an error message is triggered using the \"Stop and Error\" node.\nBefore you use the workflow\nActivate the indexing API\nCreate an account with Google Cloud Platform &gt; Console and then create a new project\nSearch for the Indexing API in the Library\nActivate the API\n\nCreate a Service Account and get credentials\nOpen the Service accounts page. If prompted, select a project.\nClick add Create Service Account, enter a name and description for the service account. You can use the default service account ID, or choose a different, unique one. \nWhen done click Create.\nOn the Grant users access to this service account screen, scroll down to the Create key section. Click add Create key.\nIn the side panel that appears, select the JSON format\nClick Create. Your new public/private key pair is generated and downloaded to your machine.\nOpen the file and copy the private key.\nAdd the credentials in the url_index node\n\nAdd the user as owner of the site\nBeware, for each site you need to add the user as a owner like this:\n\nSet your sitemap\n\nOpen the sitemap_set node and add the url to your sitemap.\n\nNow you should be able to ensure that Google is always up-to-date with the latest content on your website, improving your website's visibility and SEO rankings, have fun!",
  "totalViews": 4776,
  "source": "official",
  "user": {
    "id": 91477,
    "name": "Joachim Brindeau",
    "username": "joachimbrindeau",
    "bio": "",
    "verified": false,
    "links": "[\"https://intellectual-property.org\"]",
    "avatar": "https://gravatar.com/avatar/174b62612bac1c4785b1fae6e60956cdd087547f050c6fdd183b9a14c39e31a2?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    }
  ],
  "nodeCount": 1,
  "createdAt": "2024-02-23T08:10:35.720Z",
  "path": "official/template_2123/workflow.json"
}