{
  "id": 2136,
  "name": "Verify & enrich form leads with Hunter and Clearbit then add them to Pipedrive",
  "description": "Use case\nWhen collecting leads via an online form, you often need to manually add those new leads into your Pipedrive CRM. This not only takes a lot of time but is also error-prone. This workflow automates this tedious work for you.\nWhat this workflow does\nThe workflow is triggered each time a form is submitted in n8n.\nIt validates the email address using Hunter.io.\nIf the email is valid, the workflow checks for an existing person with that email in Pipedrive.\nIf no existing person is found, it utilizes Clearbit to enrich the person's information.\nIt then verifies if the person's organization already exists in Pipedrive, creating a new organization if necessary.\nThe workflow then registers the person in Pipedrive.\nLastly, it creates a lead in Pipedrive using information from the person and organization.\nSetup\nThis workflow is very quick to set up.\nAdd your Hunter.io, Clearbit and Pipedrive credentials \nClick the test workflow button\nActivate the workflow and use the form trigger production URL to collect your leads in a smart way \nHow to adjust it to your needs\nExchange the n8n form trigger with your form of choice (Typeform, Google Forms, SurveyMonkey...)\nAdd a filter criteria to only add new leads if they match certain requirements\nRemove the email check with Hunter.io if you don't own this tool and expect new form submission to have a correct email anyways\nAdd ways to handle invalid emails or existing Persons",
  "totalViews": 946,
  "source": "official",
  "user": {
    "id": 91250,
    "name": "Niklas Hatje",
    "username": "nik8n",
    "bio": "Product Manager at n8n - Responsible for the creator program",
    "verified": true,
    "links": "[\"https://www.linkedin.com/in/niklashatje/\"]",
    "avatar": "https://gravatar.com/avatar/e16a4426e166713c34626bdde856b1cd15bb6787481a7ead9b74318f19e6259d?r=pg&d=retro&size=200"
  },
  "categories": [
    "Sales"
  ],
  "nodes": [
    {
      "name": "Pipedrive",
      "type": "n8n-nodes-base.pipedrive",
      "categories": [
        "Sales"
      ],
      "subcategories": {}
    },
    {
      "name": "Hunter",
      "type": "n8n-nodes-base.hunter",
      "categories": [
        "Sales"
      ],
      "subcategories": {}
    },
    {
      "name": "Clearbit",
      "type": "n8n-nodes-base.clearbit",
      "categories": [
        "Sales"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 3,
  "createdAt": "2024-02-28T11:11:05.616Z",
  "path": "official/template_2136/workflow.json"
}