{
  "id": 2537,
  "name": "Simple Social: Instagram Single Image Post with Facebook API",
  "description": "Simple Social: Instagram Single Image Post with Facebook API\n\nWho is this workflow for?\nThis workflow is designed for businesses, social media managers, content creators, and developers who need to automate the process of posting single images to Instagram using the Facebook API. It is ideal for anyone looking to streamline their social media posting process, saving time and ensuring consistent content delivery.\n\nUse Case / Problem Solved\nManually posting images and captions on Instagram can be time-consuming, especially for businesses and content creators managing multiple accounts. This workflow automates the process from image preparation to publishing, reducing manual effort and increasing efficiency.\n\nWhat this workflow does\nTrigger Initialization: The workflow starts with a manual trigger that can be adapted to other triggers (e.g., HTTP webhook or schedule).\nSet Parameters: The workflow includes a node that sets essential parameters, such as the image URL, Instagram business account ID, and caption.\nPrepare Instagram Media: A node prepares the media for upload using the Facebook API, sending the image and caption for pre-publication processing.\nCheck Media Upload Status: The workflow verifies if the media preparation is complete.\nConditional Check: If the media preparation is successful, the workflow proceeds to publish; otherwise, it triggers an error-handling path.\nPublish Media: The media is published on Instagram if the conditions are met.\nPost-Publish Check: The workflow checks the status after publication.\nConditional Check for Publication: If the publication status is \"PUBLISHED,\" it triggers a success path; otherwise, it triggers a failure handling.\nEmail Notifications: The workflow sends email notifications to indicate successful or unsuccessful outcomes.\n\nSetup \n\nHere is a quick video in italian language with sub eng(https://youtu.be/obWJFJvg_6g)\n\nAdd API Credentials: Ensure that valid Facebook API credentials are added and configured for use.\nPermissions Required: Ensure your app has the necessary permissions (ads_management, business_management, instagram_basic, instagram_content_publish, pages_read_engagement). App review may be required for external user access.\nNode Configuration: Customize the Set Instagram Parameters node to specify the image URL, caption, and Instagram business account ID.\nTrigger Adaptation: Adapt the initial trigger if needed to fit your workflow's requirements (e.g., schedule, webhook).\n\nHow to customize this workflow\nChange the Image URL and Caption**: Modify the Set Instagram Parameters node to change the image and caption.\nTrigger Customization**: Replace the manual trigger with other triggers like a webhook to automate posting based on external events.\nNotifications**: Adjust the email nodes to send customized messages or trigger other workflows based on the outcome.\n\nLimitations\nImage Format**: Only JPEG images are supported. Extended JPEG formats such as MPO and JPS are not compatible.\nUnsupported Tags**: Shopping tags, branded content tags, and filters are not supported.\nInstagram TV**: Publishing to Instagram TV is not supported.\nRate Limit**: Instagram accounts are limited to 50 API-published posts within a rolling 24-hour period. Carousels count as a single post. Check usage with GET /{ig-user-id}/content_publishing_limit.\n\nExample Usage\nImagine managing a business account that needs consistent posts. You can schedule this workflow or trigger it manually to automatically post images with captions at the right time, ensuring that your audience stays engaged without manual posting efforts.",
  "totalViews": 16137,
  "source": "official",
  "user": {
    "id": 92107,
    "name": "Edoardo Guzzi",
    "username": "mredodos",
    "bio": "Automation expert with 10+ years in programming, AI, Chrome extensions, and mobile apps. Specializing in PHP, JS, and Python, I design custom n8n workflows to streamline processes and boost productivity. Explore my templates or contact me for tailored solutions.",
    "verified": false,
    "links": "[\"https://www.youtube.com/@edoardododoguzzi\"]",
    "avatar": "https://gravatar.com/avatar/a21b05da374078b706406431d629d2020336978b83edffe55ae4c36a8f77cd0c?r=pg&d=retro&size=200"
  },
  "categories": [
    "Communication",
    "HITL",
    "Core Nodes",
    "Development"
  ],
  "nodes": [
    {
      "name": "Send Email",
      "type": "n8n-nodes-base.emailSend",
      "categories": [
        "Communication",
        "HITL",
        "Core Nodes"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "Facebook Graph API",
      "type": "n8n-nodes-base.facebookGraphApi",
      "categories": [
        "Development"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-11-12T12:13:49.467Z",
  "path": "official/template_2537/workflow.json"
}