{
  "id": 3513,
  "name": "🥇 Token Estim8r -Sub Workflow to track AI Model Token Usage and cost with JinaAI",
  "description": "\nSave Your Tokens from Evil King Browser\n&gt; Image Generated with ideoGener8r \nn8n workflow template\n🔍 Estimate token usage and AI model cost from any workflow in n8n\n\n🙋‍♂️ Who is this for?\nThis workflow is ideal for AI engineers, automation specialists, and business analysts who use OpenAI, Anthropic, or other token-based large language models (LLMs) in their n8n workflows and want to track their usage and accuratley estimate associated costs.\n\nWhether you're prototyping workflows or deploying in production, this tool gives you insight into how many tokens you're using and what that translates to in actual dollars.\n\n😌 What problem is this workflow solving?\nn8n users running AI-based workflows often struggle to track how many tokens were used per execution and how much those tokens cost. Without visibility into usage, it’s easy to lose track of API spending.\n\nThis workflow solves that problem by:\nLogging token counts and costs to Google Sheets\nSupporting prompt and completion token counts\nProviding live pricing (optional, via Jina AI API)\n\n⚙️ What this workflow does\nThis template allows you to analyze the token usage and cost of any workflow in n8n. It uses an Execute Workflow node to call the Token Estim8r utility, which:\nEstimates prompt and completion tokens\nRetrieves model pricing (either statically or live via Jina API)\nCalculates the total cost\nLogs the data to a connected Google Sheet with timestamp and model info\n\n🛠️ Setup Instructions\nCreate Google Sheet: Copy and paste the CSV template below into a .csv file and upload to Google Sheets:\n\n        timestamp, Total Tokens, Prompt Tokens, Completion Tokens, Models Used, Tools Used, Total Cost, Json Array\n    \nSet up pricing (optional): In the Get AI Pricing node, add your Jina API Auth Header if you want live pricing.\n\nSelect the correct Google Sheet: Ensure your workflow is pointing to the imported sheet.\n\nAttach to your target workflow: Add an Execute Workflow node to the end of your target workflow.\n\nPoint to this Token Estim8r: Choose this template as the executed workflow and send {{ $execution.id }} as the input.\n\nRun and view results: Trigger the target workflow and see your token usage and cost data populate in the sheet.\n\n🔧 How to customize this workflow to your needs\nChange the logging destination**: Instead of Google Sheets, connect to Airtable, Notion, or a database.\nSupport multiple models**: Extend the price-mapping logic to cover your own model providers.\nAdd Slack alerts**: Send a notification if a workflow exceeds a token or cost threshold.\nAggregate costs**: Create a weekly summary workflow that totals cost by workflow or model.\n\n&gt; This utility workflow works across all n8n deployment types and uses only built-in nodes.",
  "totalViews": 417,
  "source": "official",
  "user": {
    "id": 92159,
    "name": "RealSimple Solutions",
    "username": "joeperes",
    "bio": "",
    "verified": true,
    "links": "[\"https://joeperes.com\"]",
    "avatar": "https://gravatar.com/avatar/4ad55fbdcc7808056aa180c02d52e3e373d4b894df7fa986e2dfd6c7eb127bfc?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2025-04-10T16:19:30.845Z",
  "path": "official/template_3513/workflow.json"
}