{
  "id": 2587,
  "name": "Sync Entra User to Zammad User",
  "description": "This workflow facilitates seamless synchronization between Entra (Microsoft Azure AD) and Zammad. It automates the following processes:\n\nFetch Entra Group Members: Retrieves users from a designated Entra group. These users are candidates for synchronization.\nCreate Universal User Object: Extracts key user information, such as email, phone, and name, and formats it for Zammad compatibility.\nSynchronize with Zammad:\n   Identifies users in Zammad who need updates based on Entra data.\n   Adds new users from Entra to Zammad.\n   Deactivates users in Zammad if they are no longer in the Entra group.\n\nKey Features\n\nDynamic Matching**: Compares users from Entra with existing Zammad users based on email and updates records accordingly.\nEfficient Management**: Automatically creates, updates, or deactivates Zammad users based on their status in Entra.\nCustom Fields**: Supports custom field mapping, ensuring enriched user profiles in Zammad.\n\nSetup Instructions\n\nMicrosoft Entra Integration:\n   Ensure proper API permissions for accessing Entra groups and members.\n   Configure Microsoft OAuth2 credentials in n8n.\n\nZammad Integration:\n   Set up Zammad API credentials with appropriate access rights.\n   Customize the workflow to include additional fields or map existing fields as needed.\n\nRun Workflow:\n   Trigger the workflow manually or set up an automation schedule (e.g., daily sync).\n   Review created/updated/deactivated users in Zammad.\n\nUse Cases\n\nIT Administration**: Keep your support system in sync with the organization’s Entra data.\nUser Onboarding**: Automatically onboard new hires into Zammad based on Entra groups.\nAccess Management**: Ensure accurate and up-to-date user records in Zammad.\n\nPrerequisites\n\nAccess to an Entra (Azure AD) environment with group data.\nA Zammad instance with API credentials for user management.\nA custom field in Zammad User Object (entra_key) of type String.\n\n\n\nA custom field in Zammad User Object (entra_object_type) of type `Single selection field with two key value pairs\n  user = User\n  contact = Contact`\n\n\n\n\nThis workflow is fully customizable and can be adapted to your organization’s specific needs. Save time and reduce manual errors by automating your user sync process with this template!\n\nIf you have found an error or have any suggestions, please report them here on Github.",
  "totalViews": 476,
  "source": "official",
  "user": {
    "id": 92074,
    "name": "Sirhexalot",
    "username": "sirhexalot",
    "bio": "Open source enthusiast and Zammad user with a passion for sharing knowledge and building simple, effective automation solutions with n8n.",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/c83a308119f1aadd64ec0d79a2c26eac616d6ffa916ab89db0e1aa324466be43?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Communication"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Zammad",
      "type": "n8n-nodes-base.zammad",
      "categories": [
        "Communication"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-11-29T09:59:23.069Z",
  "path": "official/template_2587/workflow.json"
}