{
  "id": 2117,
  "name": "Auto-assign deals in Hubspot to fitting sales reps based on geo and company size",
  "description": "Use case\nTo guarantee an effective sales process deals must be distributed between sales reps in the best way. Normally, this involves manually assigning new deals that have come in. This workflow automates it for you!\nWhat this workflow does\nThis workflow runs once a day and checks for unassigned deals in your Hubspot CRM. Once it finds one, it enriches the deal with information about the assigned contact and their company. It then checks the region of the assigned company before looking at the company's employee size. Based on this, it assigns the deal to the right sales rep within your company.\nRequirements\nNew deals in Hubspot need to be unassigned in the beginning\nNew deals have to have an attached contact that has an attached company in Hubspot\nThe company needs to have values for region and employee count in Hubspot\nSetup\nThe setup is quite straight forward and will probably take a few minutes only.\nAdd your Hubspot credentials\nCustomize your criterias for assigning deals in the Assign by Region and the following Assign nodes\nMake sure deals are assigned to the right salesrep in the Hubspot nodes at the end\nActivate the workflow\nCustomizing this to your needs\nAdjust the trigger interval to your needs. Currently, it defaults to once a day\nAdjust your region settings by adding/updating/removing options in the respective node\nAdjust your employee size settings by adding/updating/removing options in the respective node\nIdeas to enhance this flow\nWrap each region's assigned criteria into different sub-workflows for easier maintainability. This will not consume additional execution counts.\nAdd more logic on what happens once a deal does not match any criteria you've set",
  "totalViews": 1075,
  "source": "official",
  "user": {
    "id": 91250,
    "name": "Niklas Hatje",
    "username": "nik8n",
    "bio": "Product Manager at n8n - Responsible for the creator program",
    "verified": true,
    "links": "[\"https://www.linkedin.com/in/niklashatje/\"]",
    "avatar": "https://gravatar.com/avatar/e16a4426e166713c34626bdde856b1cd15bb6787481a7ead9b74318f19e6259d?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Sales"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "HubSpot",
      "type": "n8n-nodes-base.hubspot",
      "categories": [
        "Sales"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-02-22T12:24:37.161Z",
  "path": "official/template_2117/workflow.json"
}