{
  "id": 3449,
  "name": "Manage Calendar Events with Slack Using OpenAI-Powered Outlook Assistant",
  "description": "This n8n template demonstrates how easy it is to build an Outlook Calendar Assistant powered by an AI agent equipped with Tools.\n\nFor teams using Outlook Calendar and Slack who need easier calendar management, this workflow can be a great first step to introducing powerful AI tools into your daily activities.\n\nHow it works\nA Slack Trigger node is configured to catch \"bot mentions\" events in a designated channel.\nThe message is parsed using the Edit fields node to extract only the required attributes of the event.\nAn AI Agent equipped with Outlook Calendar Tools enables question and answer capability for the organisation's shared calendars and events.\nThe AI agent's response is sent back to Slack as a reply to the user's query.\n\nHow to use\nThe workflow is triggered via @mention-ing the bot followed by the query. eg. \"@bot how many meetings does Paul have to attend to this week?\"\nTo start listening to real mentions, you must activate the workflow and set it to production mode. You must use the production webhook URL for the event subscription.\n\nSome sample queries to try\n\"What's included in the product team's sprint demo this week?\"\n\"Who's booked room 7 for this Thursday?\"\n\"When is Jim & Nik's sales meeting with Microsoft?\"\n\nRequirements\nSlack for Chat and Trigger.\n  To get connected to Slack, see the official n8n docs for Slack Credentials.\nOutlook for Agent Tools\n  To get connected to Outlook, see the official n8n docs for Outlook Credentials.\n\nCustomising this workflow\nNot using Slack? This template can be modified to work with Teams but requires a little more configuration.\nAgents can have any number of tools but an overloaded agent is prone to confusion! If this happens, try splitting into multiple agents serving separate needs.",
  "totalViews": 675,
  "source": "official",
  "user": {
    "id": 91804,
    "name": "Jimleuk",
    "username": "jimleuk",
    "bio": "Freelance consultant based in the UK specialising in AI-powered automations. I work with select clients tackling their most challenging projects. For business enquiries, send me an email at hello@jimle.uk\n\nLinkedIn: https://www.linkedin.com/in/jimleuk/\nX/Twitter: https://x.com/jimle_uk",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/4ab99e51473df76838beeaac908747f7928c625f869794815cabe34016967d51?r=pg&d=retro&size=200"
  },
  "categories": [
    "Communication",
    "HITL",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Slack",
      "type": "n8n-nodes-base.slack",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Simple Memory",
      "type": "@n8n/n8n-nodes-langchain.memoryBufferWindow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Memory"
        ],
        "Memory": [
          "For beginners"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-04-06T18:35:30.751Z",
  "path": "official/template_3449/workflow.json"
}