{
  "id": 3649,
  "name": "Automate WhatsApp tests and rank results with PostgreSQL (Module \"Quiz\")",
  "description": "Who is this for?\n\nThis workflow is designed for educators, HR teams, or anyone who needs to create and distribute quizzes or tests via WhatsApp and automatically store and analyze responses in a PostgreSQL database.\n\nWhat problem is this workflow solving?\n\nManaging tests or quizzes manually across platforms can be time-consuming and error-prone. This workflow automates the entire process — from test creation to distribution and result collection — providing an efficient way to manage assessments at scale.\n\nWhat this workflow does\n\nAdds test content (including questions and answers) to a PostgreSQL database.\nAllows users to take the test directly via WhatsApp.\nDisplays a final ranking to test takers upon completion.\n\nSetup\n\n1. Create tables in PostgreSQL\nOpen the SQL script provided in the workflow.\nReplace n8n with your actual database schema name.\nRun the script to set up the required tables.\n\n2. Add required credentials\nWhatsApp**: Set up OAuth and connect your WhatsApp account.\nPostgreSQL**: Add your Postgres DB credentials to n8n.\n\nHow to customize this workflow to your needs\n\nUpdate the test questions and answers directly in the database.\nModify the bot flow to suit your test structure or messaging preferences.\nExtend the ranking logic based on specific grading criteria or scoring rules.",
  "totalViews": 123,
  "source": "official",
  "user": {
    "id": 93883,
    "name": "Andrew",
    "username": "boanse",
    "bio": "Analyst-Developer",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/61d84d897d0411ddab1209f44480478b3e19bc319b0a3b69dd0419d51b2fbdd3?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Data & Storage",
    "Communication",
    "HITL"
  ],
  "nodes": [
    {
      "name": "Postgres",
      "type": "n8n-nodes-base.postgres",
      "categories": [
        "Development",
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "WhatsApp Business Cloud",
      "type": "n8n-nodes-base.whatsApp",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2025-04-21T20:00:01.680Z",
  "path": "official/template_3649/workflow.json"
}