{
  "id": 3544,
  "name": "Generate SEO Keywords with AI: Topic to Keyword List in Seconds",
  "description": "Who is this template for?\nThis AI Keyword Generator workflow template is designed for marketers, SEO specialists, and content creators who need to quickly generate high-quality keyword lists for their content strategy. Instead of spending hours researching keywords manually, this AI-powered tool delivers targeted keyword suggestions based on your specific criteria.\n\nWhat problem does this workflow solve?\nKeyword research is a time-consuming but essential part of SEO and content marketing. Many professionals struggle with:\nFinding relevant keywords that match specific search intents\nBalancing between short-tail and long-tail keywords\nGenerating comprehensive keyword lists that cover different aspects of a topic\nConsistently identifying high-potential keywords for content creation\n\nWhat this workflow does\nThis n8n workflow leverages AI to automatically generate a customized list of 15-20 high-potential keywords based on three simple inputs:\nTopic** - The main subject area you want keywords for\nSearch Intent** - Choose between Navigational, Informational, Commercial, or Transactional\nKeyword Type** - Select Short-Tail or Long-Tail keywords\n\nThe workflow processes your input through an AI language model that follows SEO best practices to generate relevant keywords. It then formats the results and delivers them directly to your email inbox, ready for use in your SEO strategy.\n\nSetup\nSetting up this workflow is straightforward:\n\nAdd your credentials for the AI language model in the \"Select your Chat Model\" node\n   Click on the node and connect your Groq account (and choose any LLM you want, like: OpenAI, Claude AI or Llama)  or replace with another LLM provider\n   \nConfigure email delivery in the \"Send Result\" node\n   Update the \"sendTo\" parameter with your email address\n   Add your Gmail credentials or replace with your preferred email service\n\nTest your workflow by clicking the \"Test Workflow\" button\n   Use the form to enter your topic, search intent, and keyword type\n   Check your email for the generated keyword report\n\nActivate the workflow once testing is complete\n\nHow to customize this workflow\nThe template is highly adaptable to fit your specific needs:\n\nReplace the email node** with a database or spreadsheet node to store keywords\nModify the AI prompts** in the \"AI Keyword Agent\" to adjust the keyword generation strategy\nAdd additional filtering nodes** to further refine keywords based on custom criteria\nIntegrate with other SEO tools** to analyze competition or search volume for generated keywords\n\nThis workflow serves as a powerful starting point for automating your keyword research process, saving you valuable time while delivering consistent, high-quality results.",
  "totalViews": 2107,
  "source": "official",
  "user": {
    "id": 92718,
    "name": "Gegenfeld",
    "username": "gegenfeld",
    "bio": "We at Gegenfeld are an EdTech platform dedicated to delivering high-quality on-demand courses and interactive training sessions for professional development at all skill levels. With our commitment to \"Accelerate your future,\" we empower professionals to enhance their expertise through engaging, industry-focused learning experiences. On n8n, we share some of the workflows used in our interactive training to provide deeper insights and practical applications.",
    "verified": true,
    "links": "[\"https://gegenfeld.com\"]",
    "avatar": "https://gravatar.com/avatar/c8a1c789de3e9122a421139cc2d7dc9ab404dfb76ac84a17fa487e8f607ae9ab?r=pg&d=retro&size=200"
  },
  "categories": [
    "Communication",
    "HITL",
    "Development",
    "Core Nodes",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Gmail",
      "type": "n8n-nodes-base.gmail",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Groq Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatGroq",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-04-13T19:33:34.486Z",
  "path": "official/template_3544/workflow.json"
}