{
  "id": 3134,
  "name": "Create a Daily Digest from Gmail, RSS, and Todoist",
  "description": "Create a Daily Digest of Todoist, Gmail, and RSS and Send via Gmail\n\nOverview\nThis workflow is designed to automatically generate a daily digest by aggregating information from your Gmail, RSS feeds, and Todoist. The digest summarizes your latest emails, top news headlines, and pending tasks, then sends a beautifully formatted email directly to your inbox. With daily digest automation, you start your day with a concise summary of key information, helping you stay organized and informed.\n\nUse Case Scenario\nImagine starting your morning with an email that provides a quick snapshot of your day's most important emails, trending news, and task list. Whether you're a busy professional, entrepreneur, or team leader, this workflow takes the hassle out of manually checking multiple platforms. Instead, you receive a curated summary that enables you to prioritize your day effectively. This workflow is ideal for professionals who want to streamline their morning routine and ensure they never miss a critical update.\n\nWho This Is For\nBusy Professionals:** Stay on top of your emails, news, and tasks without juggling multiple apps.\nEntrepreneurs:** Get a daily overview of important business updates and personal tasks.\nTeam Leaders:** Manage team tasks and communications efficiently with an automated digest.\nProductivity Enthusiasts:** Embrace automation to enhance your daily workflow and task management.\n\nWorkflow Details\nDaily Trigger:** The workflow is set to run automatically every day using a Cron node configured to trigger at your desired time. This ensures your digest is delivered consistently each morning.\nGmail Integration:** Retrieves your latest emails using the Gmail node, then compiles them into the digest.\nRSS Integration:** Pulls in top news headlines from your chosen RSS feed, ensuring you get the most up-to-date information.\nTodoist Integration:** Fetches your pending tasks from Todoist to help you manage your to-do list effectively.\nMerge & Code Nodes:** Combines the data from the different sources and uses a Code node to format the information into a well-structured HTML email. Inline CSS is used to style the digest for a clean, professional look.\nEmail Summary:** The final digest, with dynamic subject lines and detailed content sections, is sent via Gmail, providing you with a comprehensive daily update.\nNote:\nMake sure to change your email address in the To section of the final Gmail node to send out the daily digest.\n\nReplace: youremail@email.com with your own email address.\n\nKeywords\ndaily digest automation, email summary, RSS integration, task management, Gmail automation, Todoist workflow, Cron trigger\n\nBy implementing this workflow, you harness the power of automation to simplify your morning routine, boost productivity, and ensure you are always up-to-date with your most important information. Enjoy a seamless, automated start to your day and take your productivity to the next level!",
  "totalViews": 2203,
  "source": "official",
  "user": {
    "id": 93003,
    "name": "AI Incarnation",
    "username": "ai-incarnation",
    "bio": "AI Incarnation is a visionary automation expert dedicated to revolutionizing the way businesses and individuals streamline their workflows. With a passion for harnessing the power of artificial intelligence and cutting-edge automation, we specialize in creating intelligent, user-friendly solutions using n8n. Our mission is to simplify complex processes and unlock new opportunities for productivity and innovation—one node at a time.\n\nLet's build the future together!",
    "verified": false,
    "links": "[\"https://www.youtube.com/@AI-Incarnation\"]",
    "avatar": "https://gravatar.com/avatar/a6064a7ae05e982d351e0309d9b8c9c692b6ecd2befa8db0ba56e214c3b9ecff?r=pg&d=retro&size=200"
  },
  "categories": [
    "Productivity",
    "Communication",
    "HITL",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Todoist",
      "type": "n8n-nodes-base.todoist",
      "categories": [
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "Gmail",
      "type": "n8n-nodes-base.gmail",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2025-03-11T16:17:39.486Z",
  "path": "official/template_3134/workflow.json"
}