{
  "id": 2406,
  "name": "Telegram User Registration Workflow",
  "description": "Telegram User Registration module\nOffers an efficient way to manage new and returning users in your Telegram bot workflow. It checks user data against a Google Sheets database, saving essential user information and ensuring personalized interactions.\n\nKey Features:\nUser Lookup: Searches for users in a Google Sheets database based on their unique Telegram ID.\nNew User Handling: Automatically registers new users, capturing details such as first name, last name, username, and language code.\nReturning User Recognition: Detects when an existing user returns and updates their status.\nData Storage: Safely stores user information in a structured format, with fields for status and date of registration.\nPersonalized Greetings: Delivers customized welcome messages for both new and returning users, promoting engagement.\n\nSetup Instructions:\nCopy this Telegram User Registration Workflow\nFollow the instructions inside:\n\n- Use Google Sheet template\n- Set up your credentials\n- Use example data to test workflow\nCustomization: Adjust the status and messages for users based on your bot's needs.\n\nConnecting to the bot Workflow:\nCopy my Telegram bot starter template\nCopy Workflow ID of your Telegram User Registration Workflow \nFind the Register module in Telegram bot starter template and paste your Workflow ID\nNow the user's data is entered into the Register Workflow. \n\n\n\nThis module provides a scalable foundation for managing user registration, whether your bot is for meal planning, customer support, or other interactive services.\n\nMy easy to set up Telegram bot modules:\n🏁 Telegram bot starter template\n📝 Telegram callback menu (soon)\n\nPlease reach out to Victor if you need further assistance with you n8n workflows and automations!",
  "totalViews": 1218,
  "source": "official",
  "user": {
    "id": 91921,
    "name": "Victor Gold",
    "username": "victorlucky",
    "bio": "Automation & AI expert with over 7 years of experience in the digital & tech industry. Founder digital design, web & mobile development studio INSAIM.DESIGN.\nFocusing on startups & tech companies and helping to streamline their processes with AI and automation. ",
    "verified": true,
    "links": "[\"https://insaim.design\"]",
    "avatar": "https://gravatar.com/avatar/7c720e593df475d503c491d8a0a4275ccbda08832e9d4c48c98c4f373052014e?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Communication",
    "HITL"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "Telegram",
      "type": "n8n-nodes-base.telegram",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-09-09T20:58:34.758Z",
  "path": "official/template_2406/workflow.json"
}