{
  "id": 3627,
  "name": "Generate Graphic Wallpaper with Midjourney, GPT-4o-mini and Canvas APIs",
  "description": "Who is the template for?\nThis workflow is specifically designed for content creators and social media professionals, enabling Instagram and X (Twitter) influencers to produce highly artistic visual posts, empowering marketing teams to quickly generate event promotional graphics, assisting blog authors in creating featured images and illustrations, and helping knowledge-based creators transform key insights into easily shareable card visuals.\n\nSet up Instructions\nFill in your API  key from PiAPI.\nFill in Basic Params Node following the sticky note guidelines.\nSet up a design template in Canvas Switchboard. \nMake a simple template in Switchboard.\n\nClick Crul and get the API code to fill in JSON of Design in Canvas. \n\nClick Test Workflow and get a url result.\n\nUse Case\nHere we will provide some setting examples to help users find a proper way to use this workflow. User could change these settings based on specific purposes.\n\nBasic Params Setting: \ntheme: Hope\nscenario: Don't know about the future, confused and feel lost with tech-development. \nstyle: Cinematic Grandeur, Sci-Tech Aesthetic, 3D style\nexample: 1. March. Because of your faith, it will happen. 2. Something in me will save me. 3. To everyone carrying a heavy heart in silence. You are going to be okay. 4. Tomorrow will be better.\nimage prompt: A cinematic sci-fi metropolis where Deep Neural Nets control a hyper-connected society. Holographic interfaces glow in the air as robotic agents move among humans, symbolizing Industry 4.0. The scene contrasts organic human emotion with cold machine precision, rendered in a hyper-realistic 3D style with futuristic lighting. Epic wide shots showcase the grandeur of this civilization’s industrial evolution.\n\nOutput Image:\n\nMore Example Results for Reference\n",
  "totalViews": 1111,
  "source": "official",
  "user": {
    "id": 93303,
    "name": "PiAPI",
    "username": "piapi",
    "bio": "",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/4e47cc9f6664191e5fd06db7f9bafc58d224c50104b09e70e20e18a5e94721b7?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2025-04-21T09:05:42.375Z",
  "path": "official/template_3627/workflow.json"
}