{
  "id": 1785,
  "name": "Track investments using Baserow and n8n",
  "description": "This workflow uses a number of technologies to track the value of ETFs, stocks and other exchange-traded products:\n\nBaserow: To keep track of our investments\nn8n’s Cron node: To trigger the workflow compiling our daily morning briefing\nWebscraping: The HTTP Request & HTML Extract nodes to fetch up-to-date prices from the relevant stock exchange and structure this infromation\nJavascript: We’ll use the Function node to build a custom HTML body with all the relevant information\nSendgrid: The Email Service Provider in this workflow to send out our email\n\nThanks to n8n, the steps in this workflow can easily be changed. Not a Sendgrid user? Simply remove the Sendgrid node and add a Gmail node instead. The stock exchange has a REST API? Just throw away the HTML Extract node.\n\nHere’s how it works:\n\nData Source\n\nIn this scenario, our data source is Baserow. In our table, we’ll track all information needed to identify each investment product:\n\n\n\nWe have two text type columns (Name and ISIN) as well as two number type columns (Count and Purchase Price).\n\nWorkflow\n\nNodes\n\n1. Cron\n\nThe Cron node will trigger our workflow to run each work day in the morning hours.\n\n2. Baserow\n\nThe Baserow node will fetch our investments from the database table shown above.\n\n3. HTTP Request\n\nUsing the HTTP Request node we can fetch live data from the stock exchange of our choice based on the ISIN. This example uses Tradegate, which is used by many German fintechs. The basic approach should also work for other exchanges, as long as they provide the required data to the public.\n\n4. HTML Extract\n\nSince our HTTP Request node fetches full websites, we’re using the HTML Extract node to extract the information we’re looking for from each website. If an exchange other than Tradegate is used, the selectors used in this node will most likely need to be updated.\n\n5. + 6. Set\n\nThe Set nodes helps with setting the exact columns we’ll use in our table. In this case we’re first formatting the results from our exchange, then calculate the changes based on the purchase price.\n\n7. Function\n\nHere were using a bit of Javascript magic to build an HTML email. This is where any changes to the email content would have to be made.\n\n8. Sendgrid\n\nFinally we send out the email built in the previous step. This is where you can configure sender and recipients.\n\nResult\n\nThe basic email generated by this workflow will look like so:\n\n",
  "totalViews": 4596,
  "source": "official",
  "user": {
    "id": 21240,
    "name": "Tom",
    "username": "mutedjam",
    "bio": "",
    "verified": true,
    "links": "[\"https://github.com/that-one-tom/\"]",
    "avatar": "https://gravatar.com/avatar/7a3710173e907baffaf7ed7ebffc37955c9cdeadb8612200225a34a2e056aa17?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Marketing",
    "Communication",
    "Data & Storage"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "SendGrid",
      "type": "n8n-nodes-base.sendGrid",
      "categories": [
        "Marketing",
        "Communication"
      ],
      "subcategories": {}
    },
    {
      "name": "Baserow",
      "type": "n8n-nodes-base.baserow",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 3,
  "createdAt": "2022-09-08T10:42:09.443Z",
  "path": "official/template_1785/workflow.json"
}