{
  "id": 3460,
  "name": "🎨 AI Design Team - Generate and Review AI Images with Ideogram and OpenAI",
  "description": "🎨 AI Graphic Design Team - Generate and Review AI Images with Ideogram and OpenAI\n\nDescription\n\nWho is this for?\nThis workflow is perfect for graphic designers, creative agencies, marketing teams, or freelancers who regularly use AI-generated images in their projects. It's specifically beneficial for teams that want to automate the generation, review, and management of AI-created graphics efficiently.\n\nWhat problem does this workflow solve?\nDesign teams often face time-consuming manual reviews and inconsistent quality checks for AI-generated images. This workflow addresses these challenges by automating image generation and introducing a systematic, AI-driven vetting process. This ensures only high-quality, relevant images reach your team's assets, saving valuable time and enhancing workflow efficiency.\n\nWhat this workflow does\nAI Image Generation:** Integrates Ideogram via HTTP Request to automatically create AI-generated images based on creative briefs.\nAutomated Image Review:** Uses OpenAI to automatically evaluate and approve images, ensuring they meet your predefined quality standards.\nEfficient Asset Management:** Automatically creates structured Google Drive folders and compiles key metadata (including creation dates, prompts, and image links) into a CSV file and Google Sheet.\nImmediate Email Notifications:** Delivers a setup confirmation and provides easy access to Google Drive folders and assets via automated email notifications.\nFinal Approved Images:** Outputs vetted, ready-to-use images for your creative projects, removing the burden of manual reviews.\n\nSetup\nInitial Email Configuration\n   Update your email details in both the \"Setup Gmail\" node and the \"Gmail\" notification node.\n   Run the initial setup workflow to automatically create the Google Drive folders \"Graphic_Design_Team\" and \"Image_Generations,\" and upload your CSV file (n8n-Graphic_Design_Team.csv).\n\nReview Email & Set Up Google Sheets\n   Check your inbox for an automated email containing folder IDs and direct links.\n   Create and set up a Google Sheet by importing the provided CSV data from your email.\n\nUpdate Workflow Nodes\n   Select your newly created Google Sheet in both Google Sheets nodes.\n   Update your Creative Brief node with the Google Drive folder IDs provided in the email.\n\nRun Workflow for AI Image Generation & Review\n   Execute the workflow. Your generated images will be automatically vetted, organized, and ready for creative use.\n\nHow to Customize This Workflow\nTailor Image Generation Prompts:** Adjust prompts and settings in the Ideogram HTTP Request node to better fit your project's creative requirements.\nSet Quality Standards:** Modify the criteria used by the OpenAI node to reflect your specific standards and preferences for image approval.\nCustomize Asset Organization:** Adapt Google Drive folder structures, CSV headers, or Google Sheets integrations to match your team's organizational preferences.\n\nDependencies & Requirements\nNodes Used:**\n  HTTP Request (Ideogram API integration)\n  OpenAI (Image review and quality assessment)\n  Gmail (Automated notifications)\n  Google Drive (File and asset management)\n  Google Sheets (Metadata organization)\n\nCredentials:**\n  Ensure Gmail, Google Drive, Google Sheets, and OpenAI credentials are properly configured in your n8n account. No custom or community nodes are needed.\n\nFinal Outcome\nUpon completion, your workflow efficiently provides vetted, high-quality AI-generated images, organized in Google Drive and accessible via easy-to-use metadata in Google Sheets, drastically reducing manual intervention and accelerating your creative processes.\n\n",
  "totalViews": 7764,
  "source": "official",
  "user": {
    "id": 92159,
    "name": "RealSimple Solutions",
    "username": "joeperes",
    "bio": "",
    "verified": true,
    "links": "[\"https://joeperes.com\"]",
    "avatar": "https://gravatar.com/avatar/4ad55fbdcc7808056aa180c02d52e3e373d4b894df7fa986e2dfd6c7eb127bfc?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes",
    "Communication",
    "HITL",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Gmail",
      "type": "n8n-nodes-base.gmail",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "Basic LLM Chain",
      "type": "@n8n/n8n-nodes-langchain.chainLlm",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Structured Output Parser",
      "type": "@n8n/n8n-nodes-langchain.outputParserStructured",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Output Parsers"
        ]
      }
    }
  ],
  "nodeCount": 7,
  "createdAt": "2025-04-07T17:05:15.082Z",
  "path": "official/template_3460/workflow.json"
}