{
  "id": 2970,
  "name": "AI-Powered Financial Chart Analyzer | OpenRouter, MarketStack, macOS Shortcuts",
  "description": "The AI-Powered Financial Chart Analyzer is a cutting-edge automation tool that streamlines financial analysis using n8n workflows, AI agents, and MacOS Shortcuts. It enables users to capture, process, and analyze candlestick charts for both stocks and cryptocurrencies. By integrating powerful tools like ChatGPT-4o-mini (via OpenRouter), MarketStack, and SerpAPI, this automation provides real-time market insights, technical analysis, and AI-driven stock trend predictions.\n\nWorkflow\n\nThe Webhook node will receive image data from a macOS shortcut in Base64 format.  \nThe Convert to File node will convert the Base64 image into a binary file.  \nThe AI Agent node will process the binary image. It utilizes OpenRouter, Windows buffer memory, MarketStack, and the SerpAPI tool.  \nRemember to use a model capable of processing images; otherwise, the workflow will throw an error.  \nWe use the MarketStack tool to fetch the latest stock data; however, it is rarely used.  \nSerpAPI is used for market research, such as news and insights about stocks.  \nFinally, the Markdown node converts Markdown to HTML.  \nThe response is then sent to the Webhook.\n\nUse Case\n\nTraders & Investors: Quickly analyze candlestick charts and identify trading opportunities.\n\nFinancial Analysts: Automate chart interpretation and data aggregation for in-depth reports.\n\nAI & Automation Enthusiasts: Experiment with AI-driven financial workflows using n8n.\n\nBusiness Owners: Gain real-time stock insights to make informed investment decisions.\n\nSetup Instructions\n\nInstall MacOS Shortcut\n\nDownload the MacOS Shortcut provided with this product and double-click on it to install.\nIf you don’t have the Shortcuts app (parent app) installed, first download it from the App Store, then follow Step 1.\n\nSet Up Workflow\n\nImport the n8n workflow provided with this product.\n\nSet Up Credentials\n\n🔹Webhook Authentication\n\nCreate an API key (you can use a key generation tool or simply use a custom string).\nAdd the API key to your n8n Webhook and MacOS Shortcut.\nIf you prefer not to use authentication, remove it from both the n8n Webhook and the MacOS Shortcut.\n\n🔹OpenRouter API Setup\n\nGet a free API key from OpenRouter and add it to your workflow.\nFree API keys have usage limits.\nOpenRouter provides multiple models—ensure that the selected model supports image processing.\n\n🔹MarketStack API Setup\n\nGet a free API key from MarketStack and use it in your workflow.\nFree API keys have usage limits.\n\n🔹SerpAPI Setup\nGet a free API key from SerpAPI and use it in your workflow.\nFree API keys have usage limits.\n\nDisclaimer\n\nThis tool is designed for educational and informational purposes only. The AI-generated insights should not be considered as financial advice. Users should conduct their own research before making investment decisions. AgentsOps is not responsible for any financial losses incurred from using this automation.\n",
  "totalViews": 1407,
  "source": "official",
  "user": {
    "id": 92457,
    "name": "Udit Rawat",
    "username": "ailistmaster",
    "bio": "Hi, I’m Udit, an Acquia-certified developer with a strong background in web development and creating enterprise solutions. Recently, I’ve transitioned into AI and ML, I hold DIAT Professional AI Certification. I specialize in building AI-driven automation to streamline workflows, improve efficiency, and solve complex problems. With expertise in AI/ML tools and years of experience in Acquia and Drupal, I’m passionate about leveraging tech to drive innovation and create smarter solutions.",
    "verified": true,
    "links": "[\"https://x.com/AilistMaster\"]",
    "avatar": "https://gravatar.com/avatar/6e96ede8d526c20ff6df15da46bbafb0fbe8862f1e12faa6de21514bb3c641e8?r=pg&d=retro&size=200"
  },
  "categories": [
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Simple Memory",
      "type": "@n8n/n8n-nodes-langchain.memoryBufferWindow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Memory"
        ],
        "Memory": [
          "For beginners"
        ]
      }
    },
    {
      "name": "Calculator",
      "type": "@n8n/n8n-nodes-langchain.toolCalculator",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Tools"
        ],
        "Tools": [
          "Other Tools"
        ]
      }
    },
    {
      "name": "SerpApi (Google Search)",
      "type": "@n8n/n8n-nodes-langchain.toolSerpApi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Tools"
        ],
        "Tools": [
          "Other Tools"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-02-22T05:00:03.682Z",
  "path": "official/template_2970/workflow.json"
}