{
  "id": 3620,
  "name": "Translate SRT Files with Google Translate",
  "description": "This workflow is designed to translate SRT subtitle files from one language to another using Google Translate.\n\nThe workflow follows these main steps:\n\nAccept an SRT file upload and target language selection\nExtract and parse the SRT file content\nSplit the content into translatable segments\nTranslate each segment using Google Translate\nReassemble the translated content into a proper SRT format\nReturn the translated file to the user\n\nYou'll need a Google Console Cloud account to access the Translate API.\n\nWho is this for?\n\nThis workflow is designed for content creators, video editors, translators, and anyone who needs to translate subtitle files (.srt) from one language to another. It's particularly useful for those working with international content, educational materials, or preparing videos for global audiences.\n\nWhat problem does this workflow solve?\n\nTranslating subtitle files manually is time-consuming and error-prone. Professional translation services can be expensive, especially for multiple videos or long content. This workflow automates the translation process while maintaining the proper SRT format including timestamps and subtitle numbering.\n\nSetup\n\nSet up Google Translate credentials:\n-- Create a Google Cloud project and enable the Google Translate API\n-- Create OAuth credentials and configure them in the Google Translate node\nCustomize language options:\n-- The default workflow includes English (EN) and Japanese (JP) options\n-- Add more language options by editing the dropdown field in the \"Receive SRT File to Translate\" node\n-- Use standard language codes that Google Translate supports\nAdd more languages:\n-- Edit the form trigger node to include additional language options in the dropdown",
  "totalViews": 191,
  "source": "official",
  "user": {
    "id": 92948,
    "name": "DanielV",
    "username": "danielv",
    "bio": "",
    "verified": false,
    "links": "[]",
    "avatar": "https://gravatar.com/avatar/66b82a759b4bc4d0a3bd63381484264094b4a30e9db515aa196f87eb1356f4d2?r=pg&d=retro&size=200"
  },
  "categories": [
    "Utility",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Google Translate",
      "type": "n8n-nodes-base.googleTranslate",
      "categories": [
        "Utility"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2025-04-20T10:09:18.893Z",
  "path": "official/template_3620/workflow.json"
}