{
  "id": 3596,
  "name": "Daily AI News Translation & Summary with GPT-4 and Telegram Delivery",
  "description": "📝 What this workflow does\n\nEvery morning at 8 a.m., this workflow fetches the latest AI-related articles from both GNews and NewsAPI. It merges up to 40 new articles daily, selects the 15 most relevant ones on AI technology and applications, and uses GPT-4.1 to generate concise summaries in accurate Traditional Chinese (while preserving essential English technical terms). Each summary also includes the article link for easy referral. The compiled digest is then posted to your designated Telegram account or group.\n\n👥 Who is this for?\n\nAI enthusiasts, professionals, and anyone interested in artificial intelligence news\nIndividuals and teams wanting a concise daily digest of AI developments in Traditional Chinese\nTelegram users who prefer automated information delivery\n\n🎯 What problem does this workflow solve?\n\nWith the rapid evolution of AI technology, it can be overwhelming to keep up with new developments. This workflow addresses information overload by automatically collecting, summarizing, and translating the most important AI news each morning — all delivered conveniently to your chosen Telegram channel or group.\n\n⚙️ Setup\n\n🔑 Add NewsAPI and GNews API Keys\n    Register for accounts on NewsAPI.org and GNews to obtain your API keys.\n    Input your NewsAPI key directly into the Fetch NewsAPI articles node.\n    Input your GNews API key into the Fetch GNews articles node.\n🤖 Set up your Telegram Bot\n    Create a Telegram Bot via BotFather and copy the generated Bot Token.\n    In n8n, create Telegram Bot credentials using this token.\n    In the Send summary to Telegram node, enter the chat ID of your target user, group, or channel to receive the messages.\n🧠 Configure OpenAI Credentials\n    In n8n, create a new credential using your OpenAI API key.\n    Assign this credential to the GPT-4.1 Model node (or equivalent OpenAI/AI nodes).\n\nAfter completing these steps, your workflow is fully configured to fetch, summarize, and deliver daily AI news to your selected Telegram chat automatically.\n\n🛠️ How to customize this workflow\n\n🔍 Change the topic:** Update the keywords in the NewsAPI and GNews nodes for other subjects (e.g., \"blockchain\", \"quantum computing\").\n⏰ Adjust delivery time:** Modify the scheduled trigger to your preferred hour.\n✍️ Tweak summary style or language:** Refine the prompt in the AI summarizer node for different tones or translate into other languages as needed.\n\n📦 Dependencies\n\nNewsAPI account\nGNews account\nTelegram Bot\nOpenAI API access (for GPT-4.1) or compatible AI model for Langchain agent",
  "totalViews": 2767,
  "source": "official",
  "user": {
    "id": 93857,
    "name": "SamirLiu",
    "username": "samir",
    "bio": "Seasoned Data Engineer with over 8 years of experience in digital marketing analytics and workflow automation. Expert in leveraging tools like n8n, Python, and SQL to streamline data integration and optimize operational efficiency. Passionate about enhancing productivity through innovative automation strategies.",
    "verified": true,
    "links": "[\"https://www.smiliu.xyz\"]",
    "avatar": "https://gravatar.com/avatar/7ac2e42b7a5ccea3716e53d75401b1bbd41ef6dcf21323b6415088e3585d188d?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Communication",
    "HITL",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Telegram",
      "type": "n8n-nodes-base.telegram",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-04-18T07:05:41.418Z",
  "path": "official/template_3596/workflow.json"
}