{
  "id": 3584,
  "name": "Create AI-Powered YouTube Shorts with OpenAI, ElevenLabs, 0CodeKit!",
  "description": "YouTube Shorts Automation with AI-Powered Video Generation\n\nOverview\n\nThis workflow automates the creation of engaging YouTube Shorts by leveraging AI tools to generate scripts, audio, images, and videos, then compiles them into a final video ready for upload. It uses OpenAI for script and image prompt generation, ElevenLabs for text-to-speech, Replicate for image and video generation, Cloudinary for audio storage, and Creatomate for final video rendering. The workflow segments the script into 6-second clips, creates corresponding visuals, and combines them with audio, adding smooth transitions for a polished result.\n\nWhy is this workflow useful?\n\nCreating YouTube Shorts manually is time-consuming, requiring scriptwriting, voiceovers, and video editing. This workflow automates the entire process, enabling creators to produce high-quality, engaging Shorts in minutes. It’s ideal for content creators, marketers, or businesses looking to maintain a consistent social media presence with minimal effort.\n\nWho is this workflow for?\n\nContent Creators**: YouTubers or TikTok creators aiming to produce viral Shorts quickly.\nDigital Marketers**: Businesses promoting products or services through short-form video content.\nHobbyists**: Individuals experimenting with AI-driven video production without advanced editing skills.\n\nWhat will you need to use this workflow?\n\nn8n Account**: Free or paid, hosted on n8n Cloud or self-hosted.\nOpenAI API Key**: For generating scripts and image prompts (GPT-4o-mini model).\nElevenLabs API Key**: For text-to-speech conversion.\nReplicate API Key**: For generating images and videos.\nCloudinary Account**: For storing audio files.\nCreatomate API Key**: For rendering the final video.\nBasic JSON Knowledge**: To understand and tweak the workflow output if needed.\n\nHow does this workflow work?\n\nTrigger: The workflow starts manually via the \"Test Workflow\" button.\nScript Generation: OpenAI (GPT-4o-mini) generates a script with an intro (40-70 chars), base (280-350 chars), and CTA (55 chars), plus a title and description with hashtags.\nText-to-Speech: ElevenLabs converts the script into an MP3 audio file with timestamps.\nAudio Upload: The audio is uploaded to Cloudinary for storage.\nScript Segmentation: A Python script segments the audio into 6-second clips, creating transcription chunks.\nImage Prompt Generation: OpenAI generates a visual prompt for each segment in the style of CNSTLL, ensuring simple, animatable visuals.\nImage Generation: Replicate creates a 9:16 image for each segment based on the prompt.\nVideo Generation: Replicate’s Minimax model generates 5-second video clips from the images.\nVideo Compilation: Creatomate combines the video clips with the audio, adding fade transitions and a final black shape for a smooth close.\nFinal Output: The rendered video is retrieved from Creatomate, ready for YouTube Shorts.\n\nSetup instructions\n\nImport the Workflow: Copy the provided JSON into n8n and import it as a new workflow.\nAdd Credentials:\n   Configure OpenAI API credentials for the \"Ideator\" and \"Image Prompter\" nodes.\n   Set up ElevenLabs API key in the \"Script Generator\" node.\n   Add Replicate API key for the \"Request Image,\" \"Request Video,\" and \"Get Video\" nodes.\n   Configure Cloudinary credentials for the \"Upload to Cloudinary\" node.\n   Set Creatomate API key for the \"Editor\" and \"Get Final Video\" nodes.\nTest the Workflow:\n   Click \"Test Workflow\" to run it manually.\n   Replace &lt;user-query&gt; in the \"Ideator\" node with your video topic (e.g., \"Fitness tips for beginners\").\nVerify Outputs: Check each node’s output, ensuring audio, images, and videos are generated correctly.\nCustomize (Optional):\n   Adjust segment duration in the \"HTTP Request\" node’s Python code (default: 6 seconds).\n   Modify fade duration or video resolution in the \"Create Editor JSON\" node.\nSave and Activate: Save the workflow and activate it for regular use.\n\nTips for getting the most out of this workflow\n\nOptimize Prompts**: Use specific, concise queries in the \"Ideator\" node for better script quality (e.g., \"Minimalist home decor ideas\").\nCheck API Limits**: Ensure your API accounts (OpenAI, ElevenLabs, Replicate, Creatomate) have sufficient credits.\nExperiment with Styles**: Tweak the CNSTLL style in the \"Image Prompter\" node for unique visuals, but keep prompts simple to avoid AI generation errors.\nMonitor Rendering Time**: Video rendering in Creatomate may take up to 70 seconds; adjust the \"Rendering\" node’s wait time if needed.\nAdd Hashtags**: Enhance the generated description with trending hashtags like #YouTubeShorts, #AI, or niche-specific tags.\n\nTroubleshooting\n\nError in Script Generation**: Verify your OpenAI API key and ensure the query is clear.\nAudio Issues**: Check ElevenLabs API key and confirm the script length fits within API limits.\nImage/Video Failures**: Ensure Replicate API key is valid and prompts are simple (avoid complex scenes or humans).\nRendering Errors**: Confirm Creatomate API key and check JSON structure in the \"Create Editor JSON\" node.\nContact Support**: Reach out to n8n Community Forum or respective API providers for persistent issues.\n\nBuilt with\n\nn8n Nodes**: Manual Trigger, OpenAI, HTTP Request, Set, Split Out, Aggregate, Merge, Wait.\nExternal Services**: OpenAI (GPT-4o-mini), ElevenLabs (Multilingual v2), Replicate (Flux-Cinestill, Minimax Video-01), Cloudinary, Creatomate.\nCustom Code**: Python for audio segmentation and JSON rendering.\n\nExample output\n\nFor a query like \"Morning routine hacks\":\n\nScript**:\n  Intro: \"Struggling to start your day right?\"\n  Base: \"Try these 3 morning hacks: 5-min meditation to clear your mind, a quick stretch routine to boost energy, and a cold shower to stay alert. Set your day up for success!\"\n  CTA: \"Save this and try it tomorrow!\"\nTitle**: \"3 Morning Hacks You NEED to Try!\"\nDescription**: \"Kickstart your day with these easy hacks! 🧘‍♀️🚿 #MorningRoutine #Productivity #YouTubeShorts\"\nVideo**: A 15-second Short with three 5-second clips (meditation scene, stretching POV, cold shower close-up), synced with audio and fade transitions.\n\n",
  "totalViews": 323,
  "source": "official",
  "user": {
    "id": 93858,
    "name": "dada",
    "username": "lin",
    "bio": "",
    "verified": false,
    "links": "[]",
    "avatar": "https://gravatar.com/avatar/ef578491ea9e922bd2c121d31977272622c5a70574a32ac62d6eb79db153332b?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "OpenAI",
      "type": "@n8n/n8n-nodes-langchain.openAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Miscellaneous",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2025-04-17T11:00:05.102Z",
  "path": "official/template_3584/workflow.json"
}