{
  "id": 2477,
  "name": "Mark outdated workflow nodes on canvas and send a summary with Gmail (add-on)",
  "description": "This is an add-on for the template Check if workflows contain build-in nodes that are not of the latest version\n\nPurpose\n\nThis workflow highlights outdated nodes within all workflows of a single n8n instance and places an updated preconfigured node right next to it, so it can be swapped easily.\n\nHow it works\n\nThe parent workflow checks the entire n8n instance for outdated nodes within all workflows and passes a list of those alongside some metadata to this workflow\nThis workflow then processes that data and updates the affected workflows\nOutdated nodes are renamed by prepending an emoji (default: ⚠️) - this is also used for future checks to prevent from double-processing\nThe latest version of each outdated node is added to the workflow canvas (not wired up) behind the old one, slightly shifted in position\nAn Email is sent with a list of modified workflows\n\nIn the settings it is possible to define:\n\nwhich symbol/emoji should be prepended to outdated notes\nwhether to include only major node updates or all of them\nwhether to add the new nodes to the canvas or not\n\nSetup\n\nClone this template to your n8n instance\nUpdate the Settings node by setting at least the base URL of your n8n instance\nSet a recipient in the Gmail node\nClone the parent template to your n8n instance and configure it as described in it’s description\nAdd an “Execute Workflow” node to the end of the parent workflow and configure it, so it calls this workflow\n\nHow to use\n\nExecute the parent workflow and check your Email Inbox.\n\nAll linked workflows should contain one or more updated nodes with an emoji prepended to their names.\n\nDisclaimer\n\nBeware, that major updates can cause migrations of nodes to fail, since their structure can differ. So always compare the old nodes with the newly created, if all parameters still meet the requirements.\n\nBe careful when executing this workflow on a production environment, since it directly modifies your workflows. It is advisable to run this on your testing environment and migrate successfully tested workflows to your production environment using git or manually.",
  "totalViews": 1834,
  "source": "official",
  "user": {
    "id": 91699,
    "name": "Mario",
    "username": "octionic",
    "bio": "Workflow Optimization Expert | Software Architect. Use my link to book an initial consultation for custom built workflows using n8n.",
    "verified": true,
    "links": "[\"https://octionic.com\"]",
    "avatar": "https://gravatar.com/avatar/48bf351cec848d87566d8cc78c9a783ec4807408366648de04cfe955d7a5ba21?r=pg&d=retro&size=200"
  },
  "categories": [
    "Communication",
    "HITL",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Gmail",
      "type": "n8n-nodes-base.gmail",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-10-21T13:24:50.985Z",
  "path": "official/template_2477/workflow.json"
}