{
  "id": 1968,
  "name": "Import multiple CSV to Google Sheets",
  "description": "This workflow imports multiple CSV files and appends or updates them to a Google Sheets document.\n\nHere's a step-by-step breakdown:\nWhen clicked \"Execute Workflow\", the process starts.\nThe \"Read Binary Files\" node reads all the '.csv' files from the specified directory.\nThe files are then split into batches (one file in a batch) by the \"Split In Batches\" node.\nFor each file, the \"Read CSV\" node reads the data from the CSV file.\nThe \"Assign source file name\" node assigns the source file name to the data.\nThe data is then processed by the \"Remove duplicates\" node. This removes any duplicate entries based on the 'user_name' field.\nThe \"Keep only subscribers\" node filters the data to keep only those entries where the 'subscribed' field is set to 'TRUE'.\nThe data is then sorted by the 'date_subscribed' field using the \"Sort by date\" node.\nFinally, the processed data is appended or updated to a specified Google Sheets document using the \"Upload to spreadsheet\" node. It checks for the 'user_name' field, if the data corresponding to that 'user_name' already exists, it updates the data, otherwise appends the new data.",
  "totalViews": 4587,
  "source": "official",
  "user": {
    "id": 39668,
    "name": "n8n Team",
    "username": "n8n-team",
    "bio": "Meet the official n8n team. We specialize in building workflows that transform intricate tasks into seamless operations.",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/b3d1a47322f05a8be3d2e7bad6a80c29161bd58b91e4762cbb3ac25e5d0db5a8?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 1,
  "createdAt": "2023-10-30T13:41:05.744Z",
  "path": "official/template_1968/workflow.json"
}