{
  "id": 3765,
  "name": "Resume Screening & Behavioral Interviews with Gemini, Elevenlabs, & Notion ATS",
  "description": "Description\nCandidate Engagement | Resume Screening | AI Voice Interviews | Applicant Insights\n\nThis intelligent n8n workflow automates the process of extracting and scoring resumes received through a company career page, populating a Notion database with AI insights where the recruiter or hiring manager can automatically invite the applicant to an instant interview with an Elevenlabs AI voice agent.  After the agent conducts the behavior-based interview, the workflow scores the overall interview against customizable evaluation criteria and updates the Notion database with AI insights about the applicant.\n\nAI Powered Resume Screening & Voice AI that interviews like a Recruiter!\n\nAI Insights in Notion dashboard\n\nWho is this for?\n\nHR teams, recruiters, and talent acquisition professionals\n\nThis workflow is ideal for HR teams, recruiters, and talent acquisition professionals looking for a foundational, extensible framework to automate early stage recruiting. Whether you're exploring AI for the first time or scaling automation across your hiring process, this template provides a base for screening, interviewing, and tracking candidates—powered entirely by n8n, Elevenlabs, Notion, and LLM integrations.  Be sure to consult State and Country regulations with respect to AI Compliance, AI Bias Audits, AI Risk Assessment, and disclosure requirements.\n\nWhat problem is this workflow solving?\n\nManually screening resumes and conducting initial interviews slows down hiring. This template automates:\n\nResume assessment against job description.\n\nScheduling first and second round interviews.\n\nFirst-round AI-led behavioral interviews with AI scoring assessment.\n\nCentralized tracking of AI assessments in Notion.\n\nWhat this does\n\nThis customizable tool, configured to manage 3 requisitions in parallel, automates the application process, resume screen, and first round behavioral interviews. \n\nPre-screen Applicants with AI\n\nImmediately screens and scores applicant’s resume  against the job description.  The AI Agent generates a score and an AI assessment, adding both to the applicant's profile in Notion.  Notion automatically notifies hiring manager when a resume receives a score of 8 or higher.\n\nVoice AI that Interviews like a Recruiter\n\nAI Voice agent adapts probing questions based on applicant’s response and intelligently dives deeper into skill and experience to assess answers against a scoring rubric for each question.  \n\nAI Applicant Insights in Notion\n\nGet detailed post-interview AI analysis, including interview recordings and question-by-question scoring breakdowns to help identify who you should advance to the next stage in the process.  \n\nAI insight provided in Notion ATS dashboard with drag and drop to advance top candidates to the next interview stage.\n\nHow it works\nLink to Notion Template\nNotion Career Page:\n\nNotion Career Page published to web, can be integrated with your preferred job board posting system.\n\nNotion Job Posting:\n\nGateway for applicants to apply to active requisitions with ‘Click to Apply’ button.\n\nApplication Form:\n\nN8N webform embedded into Notion job posting captures applicant information and routes for AI processing.\n\nAI Agent evaluates resume against job description\n\nAI Agent evaluates resume against the job description, stored in Notion, and scores the applicant on a scale of 1 to 10, providing rationale for score.\n\nCreates ATS record in Notion with assessment and score\n\nWorkflow creates the applicant record in the Notion ATS where Recruiters and Hiring Managers see applicants in a filtered view, sorted by AI generated resume score.  Users can automatically advance applicants to the next step in process (AI Conversation interview) with drag and drop functionality. \n\nInvites applicant to an Instant AI Interview\n\nDragging the applicant to AI Interview step in the Notion ATS dashboard triggers Notion automation that sends the applicant an email with a link to the Elevenlabs Conversation AI Agent.  The AI Conversation Agent is provided with instructions on how to conduct the behavior-based interview, including probing questions, for the specific role.\n\nAI Conversation Agent Behavior Based Interview\n\nThe email link resolves to an ElevenLabs AI Conversation agent that has been instructed to interview applicants using pre-defined interview questions, scoring rubric, job description, and company profile.  The Elevenlabs agent assesses the applicant on a scale of 1 to 5 for each interview question and provides an overall assessment of the interview based on established evaluation criteria.\n\n\nClick to hear AI Voice Agent in action\n\n\nExample:\nRole: IT Support Analyst\nMark:  Elevenlabs AI Agent instructed to interview applicants for specific role\nGemini: Google AI coached to answer questions as an IT Support Analyst being interviewed\n\nUpdates Notion record with Interview Assessment and Score\n\nAll results—including the conversation transcript, interview scores, and rationale for assessment are automatically added back to the applicant’s profile in Notion where the Hiring Manager can validate the AI assessment by skimming through the embedded audio file.\n\nAI Interview Overall Score: 1 to 5 based on response to all questions and probes.\n\n\nAI Agent confirms that it was able to evaluate the interview using the assigned rubric.\n\nAI Interview Criteria Score: Success/Failure based on response to individual interview questions.\n\nInvites applicant to second interview with Hiring Manager\n\nDragging the applicant to the ‘Hiring Manager Interview’ step in the Notion ATS dashboard triggers a Notion automation that sends an email with a link to the Hiring Manager’s calendar scheduling solution. \n\nConfiguration and Set Up\nAccounts & API Keys\nYou wil need accounts and credentials for:\n\nn8n (hosted or self-hosted) \nElevenlabs (for AI Conversation Agent) \nGemini (for LLM model access)\nGoogle Drive (to back up applicant data)\nCalendly (to automate interview scheduling)\nGmail (to automate interview scheduling)\n\nData / Documents to implement\n\nJob Descriptions for each role\nInterview questions for each role\nEvaluation criteria for each interview question\n\nNotion Set Up\n\nCustomize your Notion Career Page\nLink to Free Notion Template that enables workflow:\n\nUpdate Notion job description database\n-update job description(s) for each role\n-add interview questions to the job description database page in Notion\n-add evaluation criteria to the job description database page in Notion\n-edit each ‘Click to Apply’ button in the job description template so it resolves to the corresponding N8N 'Application Form' webform production URL (detail provided below)\n\nNotion Applicant Tracker\n\nIn the Applicant Tracker database, update position titles, tab headings, in the custom database view (Notion) so it reflects the title of the position you are posting.  Edit the filter for each tab so it matches the position title.\n\nNotion Email Automation\n\nUpdate Notion automation templates used to invite applicants to the AI Interview and Hiring Manager interview. Note: Trigger email automation by dragging applicant profile to the next Applicant Comm Status in the Applicant Tracker.\n\nAI Interview invite template: revise position title to reflect the title of the role you are posting; include the link to your Conversation AI Agent for that role in the email body. Note: each unique role will use an Elevenlabs AI conversation agent designed for that role.\n\nHiring Manager Interview invite template: revise position title to reflect the title of the role you are posting; include the link to your Calendly page or similar solution provider to automate interview scheduling.\n\nN8N Configuration\n\nWorkflow 1\n\nApplication Forms (3 Nodes - one for each job)\n\nUpdate the N8N form title and description to match the job description you configured in Notion.  \nConfirm Job Code in Applicant Form node matches Job Code in Notion for that position.\nEdit the Form Response to customize the message you want displayed after applicant clicks submit. \n\nUpload CV - Google Drive\n\nAuthenticate your Google Drive account and select the folder that will be used to store resumes\n\nGet Job Description - Notion\n\nAuthenticate your Notion account and select your Career Page from the list of databases that contain your job descriptions. \n\nApplicant Data Backup - Google Sheet \n\nCreate a Google Sheet where you will track applicant data for AI Compliance reporting requirements.  Open the node in n8n and use the field names in the node as Google Sheet column headings.\n\nWorkflow 2\n\nElevenlabs Web Hook (Node 1)\n\nEdit the Web Hook POST node and copy your production URL that is displayed in the Node. This URL is entered into the Elevenlabs AI Conversation Agent post-call webhook described below.\n\nAI Agent\n\nAuthenticate your LLM model (Gemini in this example) and add your Notion database as a tool to pull the evaluation_criteria hosted in Notion for the specific role.\n\nExtract Audio\n\nCreate an Elevenlabs API key for your conversation agent and enter that key as a json header for the Extract Audio node\n\nUpload Audio to Drive - Google Drive\n\nAuthenticate your Google Drive account and select the folder that will be used to store the audio file.\n\nElevenlabs Configuration\n\nCreate an Elevenlabs account\n\nCreate Conversation AI Agent\n\nAdd First Message and Systems Prompt:\n\nDesign your ‘First Message’ and ‘Systems Prompt’ that guides the AI agent conducting the interview.\nTool Tip: provide instruction that limits the number of probes per interview question.\n\nKnowledge Base: \nUpload your role specific interview questions and job description, using the same text that is stored in your Notion Career page for the role.  You can also add a document about your company and instruct the Elevenlabs agent to answer questions about culture, strategy, and company growth. \n\nAnalysis: Evaluation Criteria:\nAdd your evaluation criteria, less than 2000 characters, for each interview question / competency.\n\nAnalysis: Data Collection:\nAdd the following elements, using the exact character string represented below.\n\nphone_number_AI_screen\n\"capture applicant's phone number provided at the start of the conversation and share this as a string, integers only.\"\n\nfull_name\n\"capture applicant's full name provided at the start of the conversation.\"\n\nAdvanced: Max Duration\nSet the max duration for interview in seconds.  The AI Agent will timeout at the max duration.   \n\nConversation AI Widget:\nCustomize your AI Conversation Agent landing page, including the position tile and company name.\n\nAI Conversation Agent URL:\nCopy the AI Conversation Agent URL and add it to your Notion email template triggered by the AI Interview email automation. Use a custom AI Agent URL for each distinct job description.\n\nEnable your Elevenlabs Post-Call Webhook for your Conversation Agent: \n\nLog into your Elevenlabs account and go to Conversational AI Settings and click on Post-Call Web Hook.  This is where you enter the production URL from the N8N Web Hook node (Workflow 2).  This sends the AI Voice Agent output to your n8n workflow which feeds back to your Notion dashboard.",
  "totalViews": 902,
  "source": "official",
  "user": {
    "id": 94013,
    "name": "Brian Coyle",
    "username": "brianpcoyle",
    "bio": "",
    "verified": false,
    "links": "[]",
    "avatar": "https://gravatar.com/avatar/9050f360f6cf1c8857cd4d0d0d5849c33004a299468a1b580ab7e71837c83c45?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Notion",
      "type": "n8n-nodes-base.notion",
      "categories": [
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Summarization Chain",
      "type": "@n8n/n8n-nodes-langchain.chainSummarization",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Basic LLM Chain",
      "type": "@n8n/n8n-nodes-langchain.chainLlm",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Structured Output Parser",
      "type": "@n8n/n8n-nodes-langchain.outputParserStructured",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Output Parsers"
        ]
      }
    },
    {
      "name": "Google Gemini Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatGoogleGemini",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Information Extractor",
      "type": "@n8n/n8n-nodes-langchain.informationExtractor",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 10,
  "createdAt": "2025-04-28T01:15:22.832Z",
  "path": "official/template_3765/workflow.json"
}