{
  "id": 786,
  "name": "Analyze feedback and send a message on Mattermost",
  "description": "This workflow analyzes the sentiments of the feedback provided by users and sends them to a Mattermost channel.\n\n\n\nTypeform Trigger node: Whenever a user submits a response to the Typeform, the Typeform Trigger node will trigger the workflow. The node returns the response that the user has submitted in the form.\n\nGoogle Cloud Natural Language node: This node analyses the sentiment of the response the user has provided and gives a score.\n\nIF node: The IF node uses the score provided by the Google Cloud Natural Language node and checks if the score is negative (smaller than 0). If the score is negative we get the result as True, otherwise False.\n\nMattermost node: If the score is negative, the IF node returns true and the true branch of the IF node is executed. We connect the Mattermost node with the true branch of the IF node. Whenever the score of the sentiment analysis is negative, the node gets executed and a message is posted on a channel in Mattermost.\n\nNoOp: This node here is optional, as the absence of this node won't make a difference to the functioning of the workflow.\n\nThis workflow can be used by Product Managers to analyze the feedback of the product. The workflow can also be used by HR to analyze employee feedback. You can even use this node for sentiment analysis of Tweets.\n\nTo perform a sentiment analysis of Tweets, replace the Typeform Trigger node with the Twitter node.\n\nNote:* You will need a Trigger node or Start node to start the workflow.\n\nInstead of posting a message on Mattermost, you can save the results in a database or a Google Sheet, or Airtable. Replace the Mattermost node with (or add after the Mattermost node) the node of your choice to add the result to your database. \n\nYou can learn to build this workflow on the documentation page of the Google Cloud Natural Language node.",
  "totalViews": 731,
  "source": "official",
  "user": {
    "id": 5176,
    "name": "Harshil Agrawal",
    "username": "harshil1712",
    "bio": "",
    "verified": true,
    "links": "[\"harshil.dev\"]",
    "avatar": "https://gravatar.com/avatar/1060ec3113fdd8cafb191f3728c0ac39436b3cd46be4dd518923e242fb708ef1?r=pg&d=retro&size=200"
  },
  "categories": [
    "Communication",
    "Analytics"
  ],
  "nodes": [
    {
      "name": "Mattermost",
      "type": "n8n-nodes-base.mattermost",
      "categories": [
        "Communication"
      ],
      "subcategories": {}
    },
    {
      "name": "Google Cloud Natural Language",
      "type": "n8n-nodes-base.googleCloudNaturalLanguage",
      "categories": [
        "Analytics"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 2,
  "createdAt": "2020-11-20T09:51:52.811Z",
  "path": "official/template_786/workflow.json"
}