{
  "id": 3207,
  "name": "Chinese Translator via Line x OpenRouter",
  "description": "The Chinese Translator workflow automates the translation of text into Chinese characters, pinyin, and English translations via Line Messaging API. This workflow leverages OpenRouter.ai to call advanced language models such as Qwen for accurate translations and ensures smooth user interaction by providing loading animations and timely replies.\n\nPurpose\nThis workflow aims to \nProvide users with real-time translations of input text into Chinese characters, pinyin, and English\nDeliver seamless user experience through interactive features like loading animations and quick reply messages\nEnable easy integration with Line Messaging API for scalable deployment\nKey Features\nReal-Time Translation : Translates user-inputted text instantly using OpenRouter.ai's standardized API.\nComprehensive Output : Delivers Chinese characters, pinyin, and English translations for each word or phrase.\nInteractive User Experience : Incorporates loading animations to inform users that the workflow is processing their request.\nLine Integration : Utilizes Line Webhooks and Reply APIs to facilitate communication between users and the translation service.\n\nData Flow\nReceiving Input\nNode: Line Webhook\nCaptures incoming messages from Line users.\nExtracts the text content and reply token from the webhook payload.\nLoading Animation\nNode: Line Loading Animation\nSends a loading animation back to the user, indicating that the workflow is processing the request.\nEnhances user experience by providing immediate feedback.\nTranslation Processing\nNode: Use OpenRouter\nSends the extracted text to OpenRouter.ai's API, utilizing the Qwen model for translation.\nRequests Chinese characters, pinyin, and English translations for the input text.\nSending Response\nNode: Line Reply\nFormats the translation results into a readable text message.\nSends the translated text back to the user via Line's Reply API.\n\nSetup Instructions\nPrerequisites\nLine Developer Account : Create a Line channel to obtain necessary credentials for webhooks and messaging.\nOpenRouter.ai Account : Set up an account and configure access to utilize their language models.\n\nSteps to Configure\nSet Up Line Webhook :\nNavigate to the Line Developers Console and create a new webhook URL.\nCopy the generated webhook URL and paste it into the Line Webhook node in n8n.\nConfigure OpenRouter.ai :\nObtain API credentials from OpenRouter.ai and integrate them into the Use OpenRouter node within the workflow.\nAdjust Workflow Settings :\nEnsure the timezone is set to Asia/Bangkok .\nVerify that all nodes are correctly connected and configured with appropriate credentials.\n\nIntended Audience\nThis workflow is ideal for:\nLanguage Learners : Seeking quick translations and pronunciation guides for Chinese language studies.\nTravelers : Looking to communicate effectively while traveling in Chinese-speaking regions.\nBusinesses : Aiming to provide multilingual support to customers and clients.\n\nBenefits\nEnhanced Learning : Provides comprehensive translations, including pinyin, aiding in language acquisition.\nUser-Friendly Interface : Real-time loading animations and prompt replies ensure a smooth user experience.\nScalable Deployment : Easily integrates with Line's extensive user base for widespread accessibility.\n\n",
  "totalViews": 718,
  "source": "official",
  "user": {
    "id": 92858,
    "name": "lin@davoy.tech",
    "username": "linlinmhee",
    "bio": "",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/4e38af5bc6715cea4e86e60c03e21e287cea3cdb5ceba78b3003e6404743fd32?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    }
  ],
  "nodeCount": 1,
  "createdAt": "2025-03-18T03:27:43.013Z",
  "path": "official/template_3207/workflow.json"
}