{
  "id": 2856,
  "name": "Automatic Youtube Shorts Generator",
  "description": "Automated YouTube Shorts Creator from Google News Trends\nTransform trending Google News articles into engaging YouTube Shorts with this fully automated workflow. Save time and effort while creating dynamic, eye-catching videos that are perfect for content creators, journalists, and digital marketers.\n\nKey Features\n Trend Analysis: Automatically fetch Google News articles and entertainment trends every 24 hours.\nAI-Powered Video Creation:                    \n Generate accurate transcripts from articles using Deepseek AI.\n Create visually appealing backgrounds with AI image generation tools.\nAdd voiceovers with ElevenLabs TTS or similar services.\n                                      \nDynamic Video Compilation:                    \nCombine images, audio, and background music to craft short, dynamic videos.\nFully customizable video length and music selection.\n                                      \nYouTube Integration: Upload videos directly to YouTube, complete with autogenerated titles and descriptions.\nOrganized Management: Titles and descriptions are saved to a Google Sheet for easy tracking and editing.\n\nHow It Works\nFetch trending topics from Google News using Deepseek.\nConvert the article's content into a readable transcript.\nAutomatically create a voiceover, generate visuals, and combine them into a complete video.\nUpload the video to YouTube with a dynamic caption and description.\n\nWho Is It For?\nContent creators looking to expand their reach on YouTube Shorts.\nNews agencies aiming to deliver content faster.\nDigital marketers needing quick, engaging videos.\n\nSetup Requirements\nAPI keys for Google News, ElevenLabs, OpenAI, and Deepseek.\nBasic knowledge of API integration and video content creation.\n\nStart creating trending, eye-catching YouTube Shorts in minutes. Automate your workflow and stay ahead in the content game!",
  "totalViews": 5776,
  "source": "official",
  "user": {
    "id": 92640,
    "name": "Samautomation.work",
    "username": "contactexpertly",
    "bio": "Sam Automation - Automate Your Content Creation!\n<br>\nWant to scale your content strategy without extra work? With Sam Automation, you can:\n✅ Auto-generate YouTube, Instagram, and TikTok videos\n✅ Use powerful n8n workflows to automate your processes\n✅ Leverage our JSON Video API for 100 renders per month\n<br>\nSubscribe now and discover how to save time and automate your content production! 🚀\n\n🔗 Learn more: samautomation.work",
    "verified": false,
    "links": "[\"https://samautomation.work/\"]",
    "avatar": "https://gravatar.com/avatar/86d93302717dc91913624ca261c6fed6049cc20fcfd857d2a26c179b7119204f?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes",
    "Marketing"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "YouTube",
      "type": "n8n-nodes-base.youTube",
      "categories": [
        "Marketing"
      ],
      "subcategories": {}
    },
    {
      "name": "Google Cloud Storage",
      "type": "n8n-nodes-base.googleCloudStorage",
      "categories": [
        "Development",
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 5,
  "createdAt": "2025-02-07T00:47:46.429Z",
  "path": "official/template_2856/workflow.json"
}