{
  "id": 2606,
  "name": "AI Youtube Trend Finder Based On Niche",
  "description": "Youtube Video\n\nThis n8n workflow is designed to assist YouTube content creators in identifying trending topics within a specific niche. By leveraging YouTube's search and data APIs, it gathers and analyzes video performance metrics from the past two days to provide insights into what content is gaining traction. Here's how the workflow operates:\n\nTrigger Setup: The workflow begins when a user sends a query through the chat_message_received node. If no niche is provided, the AI prompts the user to select or input one.\n\nAI Agent (Language Model): The central node utilizes a GPT-based AI agent to:\n   Understand the user's niche or content preferences.\n   Generate tailored search terms related to the niche.\n   Process YouTube API responses and summarize trends using insights such as common themes, tags, and audience engagement metrics (views, likes, and comments).\n\nYouTube Search: The youtube_search node runs a secondary workflow to query YouTube for relevant videos published within the last two days. It retrieves basic video data such as video IDs, relevance scores, and publication dates.\n\nVideo Details Retrieval: The workflow fetches additional details for each video:\n   Video Snippet: Metadata like title, description, and tags.\n   Video Statistics: Metrics such as views, likes, and comments.\n   Content Details: Video duration, ensuring only content longer than 3 minutes and 30 seconds is analyzed.\n\nData Processing:\n   Video metadata is cleaned, sanitized, and stored in memory.\n   Tags, titles, and descriptions are analyzed to identify patterns and trends across multiple videos.\n\nOutput: The workflow compiles insights and presents them to the user, highlighting:\n   The most common themes or patterns within the niche.\n   URLs to trending videos and their respective channels.\n   Engagement statistics, helping the user understand the popularity of the content.\n\nKey Notes for Setup:\nAPI Keys**: Ensure valid YouTube API credentials are configured in the get_videos, find_video_snippet, find_video_statistics, and find_video_data nodes.\nMemory Buffer**: The window_buffer_memory node ensures the AI agent retains context during analysis, enhancing the quality of the generated insights.\nSearch Term Customization**: The AI agent dynamically creates search terms based on the user’s niche to improve search precision.\n\nUse Case:\nThis workflow is ideal for YouTubers or marketers seeking data-driven inspiration for creating content that aligns with current trends, maximizing the potential to engage their audience.\n\nExample Output:\nFor the niche \"digital marketing\":\nTrending Topic: Videos about \"mental triggers\" and \"psychological marketing.\"\nTags: \"SEO,\" \"Conversion Rates,\" \"Social Proof.\"\nEngagement: Videos with over 200K views and high likes/comment ratios are leading trends.\nVideo links:\n  https://www.youtube.com/watch?v=video_id1\n  https://www.youtube.com/watch?v=video_id2",
  "totalViews": 43213,
  "source": "official",
  "user": {
    "id": 92219,
    "name": "Leonardo Grigorio",
    "username": "leonardogrig",
    "bio": "I combine my full-stack development expertise with AI automation using n8n, creating scalable workflows and seamless integrations for smarter business solutions.",
    "verified": true,
    "links": "[\"https://x.com/leonardogrig\"]",
    "avatar": "https://gravatar.com/avatar/2bb981acd7d0e27410fb1aa4f7989788741d6faafc4e173f69847ec5e5f30e88?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Marketing",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "YouTube",
      "type": "n8n-nodes-base.youTube",
      "categories": [
        "Marketing"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Simple Memory",
      "type": "@n8n/n8n-nodes-langchain.memoryBufferWindow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Memory"
        ],
        "Memory": [
          "For beginners"
        ]
      }
    },
    {
      "name": "Call n8n Workflow Tool",
      "type": "@n8n/n8n-nodes-langchain.toolWorkflow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Tools"
        ],
        "Tools": [
          "Recommended Tools"
        ]
      }
    }
  ],
  "nodeCount": 7,
  "createdAt": "2024-12-05T03:44:49.638Z",
  "path": "official/template_2606/workflow.json"
}