{
  "id": 2925,
  "name": "Send Email if server has upgradable packages",
  "description": "This workflow automates the routine check for upgradable packages on your Ubuntu server, ensuring you stay updated with the latest software patches and security improvements. By running a daily script, it efficiently monitors any available package upgrades and promptly notifies you via email, saving you time and enhancing your server’s security.\n\nHow It Works:\nDaily Monitoring**: The workflow is configured to execute a script daily that connects to your Ubuntu server and checks for any upgradable packages.\nEmail Notification**: If any upgradable packages are detected during the check, the workflow triggers an alert mechanism that automatically sends you a notification email detailing the available updates.\n\nSet Up Steps:\nSSH Credentials**: Provide the SSH login credentials for your Ubuntu server. This will allow the workflow to securely connect and perform checks for software updates.\nSMTP Credentials**: Provide SMTP login details for your email account. These credentials are used to configure the email notifications system, enabling it to send alerts about the upgradable packages.\n\nBenefits:\nTimeliness**: Receive prompt updates on critical software upgrades to maintain the optimal performance and security of your server.\nAutomation**: Reduces the need for manual checks, allowing you to focus on other critical tasks with peace of mind.\nCustomizable**: Easily adjust the checking frequency or update the notification settings according to your preferences.",
  "totalViews": 8198,
  "source": "official",
  "user": {
    "id": 92764,
    "name": "Hostinger",
    "username": "hostinger",
    "bio": "Hostinger aims to make online presence accessible to everyone worldwide – from developers to aspiring bloggers and business owners. With our fast hosting technology, AI-powered Website Builder, and easy-to-operate hPanel you can succeed online faster and easier.",
    "verified": true,
    "links": "[\"https://www.hostinger.com/vps/n8n-hosting\"]",
    "avatar": "https://gravatar.com/avatar/be87ae832a10297a42d8d92ade9b7b680e2e0cdd81c519603277b10956e46c86?r=pg&d=retro&size=200"
  },
  "categories": [
    "Communication",
    "HITL",
    "Core Nodes",
    "Development"
  ],
  "nodes": [
    {
      "name": "Send Email",
      "type": "n8n-nodes-base.emailSend",
      "categories": [
        "Communication",
        "HITL",
        "Core Nodes"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2025-02-17T15:03:19.594Z",
  "path": "official/template_2925/workflow.json"
}