{
  "id": 3499,
  "name": "AI-powered Student Assistant for Course Information via Twilio SMS",
  "description": "This n8n template offers a simple yet capable chatbot assistant who can answer course enquiries over SMS.\n\nGiven the right access to data, AI Agents are capable of planning and performing relatively complex research tasks to get their answers. In this example, the agent must first understand the database schema, retrieve lists of values before generating it's own query to search over the database.\n\nCheckout the example database here - https://airtable.com/appO5xvP1aUBYKyJ7/shr8jSFDaghubDOrw\n\nHow it works\nA Twilio trigger gives us the ability to receive SMS input into our workflow via webhook.\nThe message is then directed to our AI agent who is instructed to assist the user and use the course database as reference. The database is an Airtable base.\nThe agent autonomously figures out which tool it needs to use and generates it's own \"filter_by_formula\" query to search over the available courses.\nOn successful search results, the Agent can then use this information to answer the user's query.\nThe Agent's output is logged in a second sheet of the Airtable base. We can use this later for analysis and lead gen.\nFinally, the response is sent back to the user through SMS using Twilio.\n\nHow to use\nEnsure your Twilio number is set to forward messages to this workflow's webhook URL.\nConfigure and update the course database as required. If you're not interested in courses, you can swap this out for inventory, deliveries or any other data relevant to your business.\nAsk questions like:\n  \"Can you help me find suitable courses to fill my Wednesday mornings?\"\n  \"Which courses are being instructed by profession Lee?\"\n  \"I'm interested in creative arts. What courses are available which could be relevant to me?\"\n\nRequirements\nTwilio for SMS receiving and sending\nOpenAI for LLM and Agent\nAirtable for Course Database\n\nCustomising this workflow\nAdd additional tools and expand the range of queries the agent is able to answer or assist with.\nNot using Airtable? This technique also works with SQL databases like PostgreSQL.\n",
  "totalViews": 764,
  "source": "official",
  "user": {
    "id": 91804,
    "name": "Jimleuk",
    "username": "jimleuk",
    "bio": "Freelance consultant based in the UK specialising in AI-powered automations. I work with select clients tackling their most challenging projects. For business enquiries, send me an email at hello@jimle.uk\n\nLinkedIn: https://www.linkedin.com/in/jimleuk/\nX/Twitter: https://x.com/jimle_uk",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/4ab99e51473df76838beeaac908747f7928c625f869794815cabe34016967d51?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Communication",
    "Development",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Airtable",
      "type": "n8n-nodes-base.airtable",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Twilio",
      "type": "n8n-nodes-base.twilio",
      "categories": [
        "Communication",
        "Development"
      ],
      "subcategories": {}
    },
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Simple Memory",
      "type": "@n8n/n8n-nodes-langchain.memoryBufferWindow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Memory"
        ],
        "Memory": [
          "For beginners"
        ]
      }
    }
  ],
  "nodeCount": 5,
  "createdAt": "2025-04-09T15:37:15.063Z",
  "path": "official/template_3499/workflow.json"
}