{
  "id": 2099,
  "name": "Sync Customer Email Subscriptions Between Shopify and Mautic",
  "description": "Having a seamless flow of customer data between your online store and your marketing platform is essential.\n\nBy keeping your systems synchronized, you can ensure that your marketing campaigns are accurately targeted and effective. \n\nThe integration between Shopify, a leading e-commerce platform, and Mautic, an open-source marketing automation system, is not available out-of-the-box. \n\nHowever, with a n8n workflow you can bridge this gap with.\n\nThis template will help you:\n\nenhance accuracy in marketing lists by ensuring that subscription changes in Shopify are instantly updated in Mautic.\nimprove compliance with data protection laws by respecting users' subscription preferences across platforms\nachieve integration without the need for additional plugins or software, minimizing complexity and potential points of failure.\n\nThis template will demonstrate the follwing concepts in n8n:\n\nworking with Shopify in n8n\ncontrol flow with the IF node\nuse Webhooks\nvalidate Webhooks with the Crypto node\nuse the GraphQL node to call the Shopify Admin API\n\nThe template consists of two parts:\n\nSync Email Subscriptions from Shopify to Mautic\nSync Email Subscriptions from Mautic to Shopify\n\nHow to get started?\n\nCreate a custom app in Shopify get the credentials needed to connect n8n to Shopify\nThis is needed for the Shopify Trigger\nCreate Shopify Acces Token API credentials n n8n for the Shopify trigger node\nCreate Header Auth credentials: \nUse X-Shopify-Access-Token as the name and the Acces-Token from the Shopify App you created as the value.\nThe Header Auth is neccessary for the GraphQL nodes.\nEnable the Mautic API under Configuration/API Settings, After the settings are saved you will have an additional entry in your settings menu to create API credentials for n8n\nCreate Mautic credentials in n8n\n\nPlease make sure to read the notes in the template. \n\nFor a detailed explanation please check the corresponding video: https://youtu.be/x63rrh_yJzI\n",
  "totalViews": 1108,
  "source": "official",
  "user": {
    "id": 91450,
    "name": "Sascha",
    "username": "m3tam3re",
    "bio": "",
    "verified": true,
    "links": "[]",
    "avatar": "https://gravatar.com/avatar/d0bb36ca6da107a39b902adcf9b118616c8b27a189be33ac2ad74e7102c9478f?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Development",
    "Marketing",
    "Communication",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "GraphQL",
      "type": "n8n-nodes-base.graphql",
      "categories": [
        "Data & Storage",
        "Development"
      ],
      "subcategories": {}
    },
    {
      "name": "Mautic",
      "type": "n8n-nodes-base.mautic",
      "categories": [
        "Marketing",
        "Communication"
      ],
      "subcategories": {}
    },
    {
      "name": "Crypto",
      "type": "n8n-nodes-base.crypto",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2024-02-16T14:00:37.794Z",
  "path": "official/template_2099/workflow.json"
}