{
  "id": 863,
  "name": "Verify a phone number with uProc",
  "description": "Do you want to avoid communication problems when launching phone calls? \n\nThis workflow verifies landline and mobile phone numbers using the uProc Get Parsed and validated phone tool with worldwide coverage.\n\n\n\nYou need to add your credentials (Email and API Key - real -) located at Integration section to n8n.\n\nNode \"Create Phone Item\" can be replaced by any other supported service with phone values, like databases (MySQL, Postgres), or Typeform.\n\nThe \"uProc\" node returns the next fields per every parsed and validated phone number:\ncountry_prefix: contains the international country phone prefix number.\ncountry_code: contains the 2-digit ISO country code of the phone number.\nlocal_number: contains the phone number without international prefix.\nformatted: contains a formatted version of the phone number, according to country detected.\nvalid: detects if the phone number has a valid format and prefix.\ntype: the phone number type (mobile, landline, or something else).\n\n\"If\" node checks if the phone number is valid.\n\nYou can use the result to mark invalid phone numbers in your database or discard them from future telemarketing campaigns.",
  "totalViews": 1096,
  "source": "official",
  "user": {
    "id": 5774,
    "name": "Miquel Colomer",
    "username": "mcolomer",
    "bio": "As a passionate developer and AI agent creator, I’ve been at the forefront of automation, pioneering workflows and training AI to handle complex tasks seamlessly. I’m an early adopter and expert of n8n, having worked with its powerful capabilities to create automation solutions for diverse industries. I founded n8nhackers, the first AI-powered agency focused on n8n, where we help businesses transform their workflows with cutting-edge automation.",
    "verified": true,
    "links": "[\"https://n8nhackers.com\"]",
    "avatar": "https://gravatar.com/avatar/c4974f5be3985d7f30465d2d963967905bcb2f9b8a8ecaf8ba4396bfbd034db2?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage"
  ],
  "nodes": [
    {
      "name": "uProc",
      "type": "n8n-nodes-base.uproc",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 1,
  "createdAt": "2020-12-30T10:34:58.688Z",
  "path": "official/template_863/workflow.json"
}