{
  "id": 3509,
  "name": "Transform Gmail Newsletters into Insightful LinkedIn Posts Using OpenAI",
  "description": "Who Is This For?  \nThis workflow is perfect for content creators, marketers, and business professionals who receive regular newsletters and want to effortlessly convert them into engaging LinkedIn posts. By automating the extraction and repurposing process, you can save time and consistently share thoughtful updates with your network.\n\nWhat Problem Does This Workflow Solve?  \nManually reading newsletters, extracting the key points, and then formatting that content into professional, engaging LinkedIn posts can be time-consuming and error-prone. This workflow automates those steps by:\nFiltering Emails:** Uses the Gmail node to process only those emails from a specific sender (e.g., newsletter@example.com).\nExtracting Content:** Leverages OpenAI to identify and summarize the top news items in your newsletter.\nGenerating Posts:** Crafts concise, insightful LinkedIn posts in a smart, deadpan style with a touch of subtle humor.\nPublishing:** Posts the generated content directly to LinkedIn.\n\nWhat This Workflow Does  \nFilter Newsletters:** The Gmail node is set up to only handle emails from your chosen sender, ensuring that only relevant newsletters are processed.\nExtract Key Content:** An OpenAI node analyzes the newsletter text to pull out the most important news items, including headlines and summaries.\nSplit Content:** A Split Out node divides the extracted content so each news item is processed on its own.\nGenerate LinkedIn Posts:** Another OpenAI node takes each news item's details and produces a well-structured LinkedIn post that delivers practical insights and ends with a reflective observation or question.\nPublish to LinkedIn:** The LinkedIn node publishes the crafted posts directly to your account.\n\nSetup  \nGmail Node: Rename it to “Filter Gmail Newsletter” and configure it to filter emails by your newsletter sender.\nOpenAI Nodes: Ensure your OpenAI API credentials are set up correctly. Customize the prompt if needed to match your desired tone.\nLinkedIn Node: Rename it to “Post to LinkedIn” and confirm that your LinkedIn OAuth2 credentials are properly configured.\n\nHow to Customize  \nOpenAI Prompts:** Adjust the prompts in the OpenAI nodes to fine-tune the post tone and output formatting.\nEmail Filter:** Change the Gmail filter to match the sender of your newsletters.\nPost Processing:** Optionally, add extra formatting (using Function nodes) to further enhance the readability of the generated LinkedIn posts.\n\nThis template offers an automated, hands-off solution to transform your newsletter content into engaging LinkedIn updates, keeping your audience informed and inspired with minimal effort.\n",
  "totalViews": 1305,
  "source": "official",
  "user": {
    "id": 93715,
    "name": "Ramsey Njire",
    "username": "informed-simplicity",
    "bio": "",
    "verified": false,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/18babd3198d8326ac0ed24941c34d7d5348f067204ab9274e50a5608e2f83ac5?r=pg&d=retro&size=200"
  },
  "categories": [
    "Communication",
    "HITL",
    "Marketing",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Gmail",
      "type": "n8n-nodes-base.gmail",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "LinkedIn",
      "type": "n8n-nodes-base.linkedIn",
      "categories": [
        "Marketing",
        "Communication"
      ],
      "subcategories": {}
    },
    {
      "name": "OpenAI",
      "type": "@n8n/n8n-nodes-langchain.openAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Miscellaneous",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2025-04-10T13:08:17.859Z",
  "path": "official/template_3509/workflow.json"
}