{
  "id": 2930,
  "name": "Generate a YouTube Bedtime Story using OpenAI",
  "description": "Automated YouTube Bedtime Story Video Generator (No Code) n8n Workflow\n\nFree Support:\n\nSetting up and getting the workflow tailord to your needs.\nOne small free adjustment included.\n\nTransform your creative ideas into enchanting bedtime story videos with this fully automated n8n workflow. Designed for content creators, digital marketers, and storytellers, this tool streamlines the process of turning audio recordings into professional, engaging YouTube videos.\n\nSamautomation.work\nYou will have the best and cheapest video rendering service online. Check the website for more information. You can customize every video and change all these settings:\n\nChange the aspact ratio to 16:9 for long form content. Check the API docs for more information. \n\n    \"settings\": {\n      \"aspect_ratio\": \"9:16\",\n      \"background_volume\": 0.15,\n      \"voice_volume\": 1.0,\n      \"font\": \"bangers\",\n      \"font_size\": 40,\n      \"text_color\": \"blue\",\n      \"stroke_color\": \"white\",\n      \"stroke_width\": 10,\n      \"disable_captions\": \"true\"\n\nMore information on:\nSamautomation.work\n\nsupport\nContact our whatsapp support if you have any questions, we are ready to assist with customizing the template if needed.\n\nKey Features\n\nSeamless Audio-to-Text Conversion:**  \n  Utilize OpenAI Whisper to convert audio recordings into accurate transcripts, ensuring every word of your story is captured.\n\nAI-Powered Image Generation:**  \n  Automatically generate beautiful, thematic visuals using advanced AI image tools that create captivating 16:9 backgrounds tailored for bedtime stories.\n\nDynamic Video Compilation:**  \n  Merge images, voiceovers, and background music into a polished video with a few clicks. Customize video length, style, and audio levels to match your vision.\n\nAutomated YouTube Integration:**  \n  Upload your videos directly to YouTube complete with autogenerated titles, descriptions, and metadata. Manage your content easily with real-time updates.\n\nEfficient Workflow Management:**  \n  Track your projects via Google Sheets and receive instant notifications through Telegram, keeping you always in the loop.\n\nCost Efficiency:**  \n  Each video costs only 25 cents to produce, making this solution incredibly affordable for large-scale content creation.\n\nHow It Works\n\nCapture & Transcribe:  \n   Record your bedtime story and let OpenAI Whisper transcribe the audio into text.\n\nGenerate Stunning Visuals:  \n   Use integrated AI image generation to create dreamy visuals that complement your narrative.\n\nCompile Your Video:  \n   Combine the visuals, transcripts, and background music into a complete video ready for distribution.\n\nPublish & Manage:  \n   Automatically upload your video to YouTube, with all details saved and tracked in Google Sheets for seamless management.\n\nWho Is It For?\n\nThis workflow is perfect for:\nContent Creators** looking to effortlessly produce engaging bedtime story videos.\nDigital Marketers** aiming to boost video content output without heavy manual intervention.\nStorytellers & Educators** who want to bring their narratives to life with a professional finish.\nSmall Businesses & Startups** seeking scalable video production solutions.\n\nSetup Requirements\n\nAPI keys for OpenAI, Google Cloud Storage, and YouTube.\nBasic familiarity with n8n and API integration.\nA passion for storytelling and creative video production.\nVideo Rendering with samautomation.work\n\nStart automating your video creation process today and captivate your audience with enchanting bedtime stories. With this workflow, you can save time, enhance productivity, and focus on what you do best—telling magical stories, all while keeping your production cost at just 25 cents per video!\n\nReady to transform your content game?  \nGet your Automated YouTube Bedtime Story Video Generator now and start creating charming videos in minutes!\n\nDemo video\nCheck out the link to the demo video of the end result. \n\n\n",
  "totalViews": 1626,
  "source": "official",
  "user": {
    "id": 92640,
    "name": "Samautomation.work",
    "username": "contactexpertly",
    "bio": "Sam Automation - Automate Your Content Creation!\n<br>\nWant to scale your content strategy without extra work? With Sam Automation, you can:\n✅ Auto-generate YouTube, Instagram, and TikTok videos\n✅ Use powerful n8n workflows to automate your processes\n✅ Leverage our JSON Video API for 100 renders per month\n<br>\nSubscribe now and discover how to save time and automate your content production! 🚀\n\n🔗 Learn more: samautomation.work",
    "verified": false,
    "links": "[\"https://samautomation.work/\"]",
    "avatar": "https://gravatar.com/avatar/86d93302717dc91913624ca261c6fed6049cc20fcfd857d2a26c179b7119204f?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes",
    "Communication",
    "HITL",
    "Marketing"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Telegram",
      "type": "n8n-nodes-base.telegram",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "YouTube",
      "type": "n8n-nodes-base.youTube",
      "categories": [
        "Marketing"
      ],
      "subcategories": {}
    },
    {
      "name": "Google Cloud Storage",
      "type": "n8n-nodes-base.googleCloudStorage",
      "categories": [
        "Development",
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 6,
  "createdAt": "2025-02-18T00:51:37.840Z",
  "path": "official/template_2930/workflow.json"
}