{
  "id": 3409,
  "name": "Batch Process Prompts with Anthropic Claude API",
  "description": "This workflow template provides a robust solution for efficiently sending multiple prompts to Anthropic's Claude models in a single batch request and retrieving the results. It leverages the Anthropic Batch API endpoint (/v1/messages/batches) for optimized processing and outputs each result as a separate item.\n\nCore Functionality & Example Usage Included\n\nThis template includes:\nThe Core Batch Processing Workflow: Designed to be called by another n8n workflow.\nAn Example Usage Workflow: A separate branch demonstrating how to prepare data and trigger the core workflow, including examples using simple strings and n8n's Langchain Chat Memory nodes.\n\nWho is this for?\n\nThis template is designed for:\n\nDevelopers, data scientists, and researchers** who need to process large volumes of text prompts using Claude models via n8n.\nContent creators** looking to generate multiple pieces of content (e.g., summaries, Q&As, creative text) based on different inputs simultaneously.\nn8n users** who want to automate interactions with the Anthropic API beyond single requests, improve efficiency, and integrate batch processing into larger automation sequences.\nAnyone needing to perform bulk text generation or analysis tasks with Claude programmatically.\n\nWhat problem does this workflow solve?\n\nSending prompts to language models one by one can be slow and inefficient, especially when dealing with hundreds or thousands of requests. This workflow addresses that by:\n\nBatching:** Grouping multiple prompts into a single API call to Anthropic's dedicated batch endpoint (/v1/messages/batches).\nEfficiency:** Significantly reducing the time required compared to sequential processing.\nScalability:** Handling large numbers of prompts (up to API limits) systematically.\nAutomation:** Providing a ready-to-use, callable n8n structure for batch interactions with Claude.\nStructured Output:** Parsing the results and outputting each individual prompt's result as a separate n8n item.\n\nUse Cases:\n\nBulk content generation (e.g., product descriptions, summaries).\nLarge-scale question answering based on different contexts.\nSentiment analysis or data extraction across multiple text snippets.\nRunning the same prompt against many different inputs for research or testing.\n\nWhat the Core Workflow does\n\n(Triggered by the 'When Executed by Another Workflow' node)\n\nReceive Input: The workflow starts when called by another workflow (e.g., using the 'Execute Workflow' node). It expects input data containing:\n    anthropic-version (string, e.g., \"2023-06-01\")\n    requests (JSON array, where each object represents a single prompt request conforming to the Anthropic Batch API schema).\nSubmit Batch Job: Sends the formatted requests data via POST to the Anthropic API /v1/messages/batches endpoint to create a new batch job. Requires Anthropic credentials.\nWait & Poll: Enters a loop:\n    Checks if the processing_status of the batch job is ended.\n    If not ended, it waits for a set interval (10 seconds by default in the 'Batch Status Poll Interval' node).\n    It then checks the batch job status again via GET to /v1/messages/batches/{batch_id}. Requires Anthropic credentials.\n    This loop continues until the status is ended.\nRetrieve Results: Once the batch job is complete, it fetches the results file by making a GET request to the results_url provided in the batch status response. Requires Anthropic credentials.\nParse Results: The results are typically returned in JSON Lines (.jsonl) format. The 'Parse response' Code node splits the response text by newlines and parses each line into a separate JSON object, storing them in an array field (e.g., parsed).\nSplit Output: The 'Split Out Parsed Results' node takes the array of parsed results and outputs each result object as an individual item from the workflow.\n\nPrerequisites\n\nAn active n8n instance (Cloud or self-hosted).\nAn Anthropic API account with access granted to Claude models and the Batch API.\nYour Anthropic API Key.\nBasic understanding of n8n concepts (nodes, workflows, credentials, expressions, 'Execute Workflow' node).\nFamiliarity with JSON data structures for providing input prompts and understanding the output.\nUnderstanding of the Anthropic Batch API request/response structure.\n(For Example Usage Branch) Familiarity with n8n's Langchain nodes (@n8n/n8n-nodes-langchain) if you plan to adapt that part.\n\nSetup\n\nImport Template: Add this template to your n8n instance.\nConfigure Credentials:\n    Navigate to the 'Credentials' section in your n8n instance.\n    Click 'Add Credential'.\n    Search for 'Anthropic' and select the Anthropic API credential type.\n    Enter your Anthropic API Key and save the credential (e.g., name it \"Anthropic account\").\nAssign Credentials: Open the workflow and locate the three HTTP Request nodes in the core workflow:\n    Submit batch\n    Check batch status\n    Get results\n    In each of these nodes, select the Anthropic credential you just configured from the 'Credential for Anthropic API' dropdown.\nReview Input Format: Understand the required input structure for the When Executed by Another Workflow trigger node. The primary inputs are anthropic-version (string) and requests (array). Refer to the Sticky Notes in the template and the Anthropic Batch API documentation for the exact schema required within the requests array.\nActivate Workflow: Save and activate the core workflow so it can be called by other workflows.\n\n➡️ Quick Start & Input/Output Examples: Look for the Sticky Notes within the workflow canvas! They provide crucial information, including examples of the required input JSON structure and the expected output format.\n\nHow to customize this workflow\n\nInput Source:* The core workflow is designed to be called. You will build *another workflow that prepares the anthropic-version and requests array and then uses the 'Execute Workflow' node to trigger this template. The included example branch shows how to prepare this data.\nModel Selection & Parameters:* Model (claude-3-opus-20240229, etc.), max_tokens, temperature, and other parameters are defined *within each object inside the requests array you pass to the workflow trigger. You configure these in the workflow calling this template.\nPolling Interval:** Modify the 'Wait' node ('Batch Status Poll Interval') duration if you need faster or slower status checks (default is 10 seconds). Be mindful of potential rate limits.\nParsing Logic:** If Anthropic changes the result format or you have specific needs, modify the Javascript code within the 'Parse response' Code node.\nError Handling:** Enhance the workflow with more specific error handling for API failures (e.g., using 'Error Trigger' or checking HTTP status codes) or batch processing issues (batch.status === 'failed').\nOutput Processing:* In the workflow that *calls this template, add nodes after the 'Execute Workflow' node to process the individual result items returned (e.g., save to a database, spreadsheet, send notifications).\n\nExample Usage Branch (Manual Trigger)\n\nThis template also contains a separate branch starting with the Run example Manual Trigger node.\n\nPurpose:** This branch demonstrates how to construct the necessary anthropic-version and requests array payload.\nMethods Shown:** It includes steps for:\n    Creating a request object from a simple query string.\n    Creating a request object using data from n8n's Langchain Chat Memory nodes (@n8n/n8n-nodes-langchain).\nExecution:** It merges these examples, constructs the final payload, and then uses the Execute Workflow node to call the main batch processing logic described above. It finishes by filtering the results for demonstration.\nNote:** This branch is for demonstration and testing. You would typically build your own data preparation logic in a separate workflow. The use of Langchain nodes is optional for the core batch functionality.\n\nNotes\n\nAPI Limits:** According to the Anthropic API documentation, batches can contain up to 100,000 requests and be up to 256 MB in total size. Ensure your n8n instance has sufficient resources for large batches.\nAPI Costs:** Using the Anthropic API, including the Batch API, incurs costs based on token usage. Monitor your usage via the Anthropic dashboard.\nCompletion Time:** Batch processing time depends on the number and complexity of prompts and current API load. The polling mechanism accounts for this variability.\nVersioning:** Always include the anthropic-version header in your requests, as shown in the workflow and examples. Refer to Anthropic API versioning documentation.\n",
  "totalViews": 472,
  "source": "official",
  "user": {
    "id": 93555,
    "name": "Greg Evseev",
    "username": "greg",
    "bio": "15+ years in AI/ML development & integration. Now specializing in establishing ISO 42001-compliant AI management systems. Background includes AI/ML research, system development, AI governance, and ISO 42001 Lead Auditor training (in progress).\n\nHelping organizations:\n✓ Evaluate AI maturity & governance\n✓ Implement ISO 42001 systems\n✓ Bridge technical & regulatory requirements\n✓ Design practical AI governance frameworks\n\nExpertise: AI Risk Assessment, Compliance Strategy, Technical Due Diligence.",
    "verified": true,
    "links": "[\"https://www.linkedin.com/in/aimsgreg\"]",
    "avatar": "https://gravatar.com/avatar/a2532827cb048e2c6433b7d6c3bf075066d9fac93092eca13593902b502e75b1?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "Simple Memory",
      "type": "@n8n/n8n-nodes-langchain.memoryBufferWindow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Memory"
        ],
        "Memory": [
          "For beginners"
        ]
      }
    },
    {
      "name": "Chat Memory Manager",
      "type": "@n8n/n8n-nodes-langchain.memoryManager",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Miscellaneous",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-04-02T19:20:04.824Z",
  "path": "official/template_3409/workflow.json"
}