{
  "id": 2032,
  "name": "Poll emails using JMAP ",
  "description": "n8n does not currently offer a way to retrieve emails from arbritrary providers via a regular node. Unless you're using Gmail or Outlook, you can only use the email trigger to start a workflow when a new email arrives.\n\nThis currently limits the possible use cases you can cover in your n8n workflows, as you cannot (for example) get an idea of how many unread messages there are in an inbox, or search for specific messages when an event occurs.\n\nBut fear not, there's a new sheriff in town! The JMAP standard allows you to interact with your mailboxes, calendars and contacts through single HTTP requests whenever needed.\n\nThis n8n workflow demonstrates how to retrieve the total number of unread messages from a JMAP server and also retrieve details for the first 3 messages. It can easily be adapted to search for messages other than unread, or to return details for more than the first 3 messages.\n\nScreenshots\n\nFAQ\n\nWhich n8n version do I need?\n\nThe workflow was built using n8n 1.20 and should work here out of the box. HTTP requests are also supported on older n8n versions, so the workflow can be backported as an alternative.\n\nWhich credentials do I need?\n\nThe JMAP standard does not limit the available authentication options. Fastmail (the sponsor of the standard) supports Bearer authentication as well as OAuth2.\n\nIn n8n you can implement the Fastmail Bearer authentication by creating Header Auth credentials with a name of Authorization and a value of Bearer $apiToken (replacing $apiToken with your actual API token from Fastmail).\n\nFor other services you'd need to check the respective API documentation for more details on the support authentication methods. \n\nWhat even is JMAP?\n\nIt's an official Internet Engineering Task Force (IETF) standard, sponsored by Fastmail, that will hopefully replace the legacy standards CalDAV, CardDAV, and IMAP soon. The full specs are available here.\n\nHow can I use JMAP?\n\nIf you're a Fastmail customer or if you're hosting your own Stalwart mail server you can use JMAP today.\n\nIf your email provider doesn't yet support JMAP, you might want to contact them and let them know you're interested in this functionality.",
  "totalViews": 596,
  "source": "official",
  "user": {
    "id": 21240,
    "name": "Tom",
    "username": "mutedjam",
    "bio": "",
    "verified": true,
    "links": "[\"https://github.com/that-one-tom/\"]",
    "avatar": "https://gravatar.com/avatar/7a3710173e907baffaf7ed7ebffc37955c9cdeadb8612200225a34a2e056aa17?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    }
  ],
  "nodeCount": 1,
  "createdAt": "2023-12-25T11:22:32.536Z",
  "path": "official/template_2032/workflow.json"
}