{
  "id": 2866,
  "name": "Scrape Latest Github Trending Repositories",
  "description": "Scrape Latest 20 TechCrunch Articles\n\nWho is this for?\nThis workflow is designed for developers, researchers, and data analysts who need to track the latest trending repositories on GitHub. It is useful for anyone who wants to stay updated on popular open-source projects without manually browsing GitHub’s trending page.\n\nWhat problem is this workflow solving?\nManually checking GitHub’s trending repositories daily can be time-consuming and inefficient. This workflow automates the extraction of trending repositories, providing structured data including repository name, author, description, programming language, and direct repository links. \n\nWhat this workflow does\nThis workflow scrapes the trending repositories from GitHub’s trending page and extracts essential metadata such as repository names, languages, descriptions, and URLs. It processes the extracted data and structures it into an easy-to-use format.\n\nSetup\nEnsure you have n8n installed and configured.\nImport this workflow into your n8n instance.\nRun the workflow manually or schedule it to execute at regular intervals.\n(Optional) Customize the extracted data or integrate it with other systems.\n\nHow to customize this workflow to your needs\nModify the HTTP request node to target different GitHub trending categories (e.g., specific programming languages).\nAdd further processing steps such as filtering repositories by stars, forks, or specific keywords.\nIntegrate this workflow with Slack, email, or a database to store or notify about trending repositories.\n\nWorkflow Steps\nTrigger execution manually using the \"When clicking ‘Test workflow’\" node.\nSend an HTTP request to fetch GitHub’s trending page using \"Request to Github Trend\".\nExtract the trending repositories box from the HTML response using \"Extract Box\".\nExtract all repository data including names, authors, descriptions, and languages using \"Extract all repositories\".\nConvert extracted data into a structured list for easier processing using \"Turn to a list\".\nExtract detailed repository information using \"Extract repository data\".\nFormat and set variables to ensure clean and structured data output using \"Set Result Variables\".\n\nNote: Since GitHub’s trending page updates dynamically, ensure you run this workflow periodically to capture the latest trends.\n",
  "totalViews": 7263,
  "source": "official",
  "user": {
    "id": 92584,
    "name": "Teddy",
    "username": "teddysbeach",
    "bio": "12 years in development, South Korea, Seoul",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/b771a9567b1ac39d9b55f8ad7983bbcf2ebdc28919060dda15c13cf4dac9827a?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "HTML",
      "type": "n8n-nodes-base.html",
      "categories": [
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2025-02-08T03:25:14.572Z",
  "path": "official/template_2866/workflow.json"
}