{
  "id": 2408,
  "name": "User verification and login using Auth0",
  "description": "  Release yourself from the pain of user login with this simple solution!\nWho this is for\n This is for everyone that wants to provide a simple login solution to their users/colleagues\nWhat this template does\nThis workflow utilizes Auth0 to provide a simple and easy authentication page that allows login via gmail or any email address.\n\nSetup\nTo use this workflow, simply sign up at https://auth0.com and create a new Single Page Application, then from Dashboard/Applications, copy the values as instructed in the workflow. It should not take more than ten minutes to setup.\nFirst, go to https://auth0.com and create a Single Page Application. \nFrom Dashboard/Applications, click on your new app settings. \nThe first step is to add the following to allowed callback URLs: http://localhost:5678, http://localhost:5678/webhook/receive-token (If you do not run n8n locally, replace localhost with your server where you run n8n. You must also replace it in Set Application Details 'my_server' field)\nFrom the same settings page,  retrieve the Domain, Client_ID, and Client_Secret of your application.\nFill in Set Application Details and Set Application Details1\nLogin from https:///webhook/login!\n\nIt can also be extended to allow login via Github, Facebook, and other socials.\n\n",
  "totalViews": 8707,
  "source": "official",
  "user": {
    "id": 91959,
    "name": "Jay Hartley",
    "username": "jay",
    "bio": "Low-code/no-code developer for automated solutions. Several years experience in automated workflow building for content creation management, distribution and marketing.",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/6c7feb8fe0cc33e0668424a616614c0ddd1adecf273274b690c6b41dd8aea245?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    }
  ],
  "nodeCount": 1,
  "createdAt": "2024-09-11T17:39:52.601Z",
  "path": "official/template_2408/workflow.json"
}