{
  "id": 2769,
  "name": "Gravity Forms to KlickTipp Integration - Feedback form",
  "description": "\n\nCommunity Node Disclaimer: As this workflow relies on a community node, it is limited to self-hosted environments.\n\nHow It Works  \n\nGravity Forms Customer Feedback Form Integration: This workflow streamlines the process of handling customer feedback submitted via Gravity Forms. It ensures the data is correctly formatted and seamlessly integrates with KlickTipp.  \n\nData Transformation: Input data is validated and transformed to meet KlickTipp’s API requirements, including formatting phone numbers and converting dates.  \n\nKey Features  \n\nGravity Forms Trigger  \nCaptures new form submissions from Gravity Forms via a webhook and initiates the workflow.  \n\nData Processing and Transformation  \nFormats and validates essential data:  \n  Converts phone numbers to numeric-only format with international prefixes.  \n  Transforms dates (e.g., birthdays) to UNIX timestamps.  \n  Calculates and scales numeric responses (e.g., webinar ratings).  \n  Parses webinar selections into timestamps for structured scheduling.  \n\nSubscriber Management in KlickTipp  \nAdds or updates contacts in a KlickTipp subscriber list.  \nIncludes custom field mappings such as:  \n  Personal details (name, email, birthday, phone number).  \n  Feedback and preferences (e.g., webinar ratings, chosen sessions).  \n  Structured answers from form responses.\nTags contacts for segmentation: Adds fixed and dynamic tags to contacts.\n  \n\nError Handling  \nEnsures invalid or empty data is handled gracefully, preventing workflow interruptions.  \n\nSetup Instructions  \n\nInstall and Configure Nodes:  \nSet up the Webhook, Set, and KlickTipp nodes in your n8n instance.  \nAuthenticate your Gravity Forms and KlickTipp accounts.  \n\nPrepare Custom Fields in KlickTipp:  \nCreate fields in KlickTipp to align with the form submission data, such as:  \n\n  | Name                          | Datentyp   |\n  |-----------------------------------|----------------|\n  | Gravityforms_URL_Linkedin         | URL            |\n  | Gravityforms_kurs/webinar_zeitpunkt | Datum & Zeit   |\n  | Gravityforms_kurs/webinar_bewertung | Dezimalzahl    |\n  | Gravityforms_feedback             | Absatz         |\n  | Gravityforms_kontaktaufnahme      | Zeile          |  \n\nAfter creating fields, allow 10-15 minutes for them to sync. If fields don’t appear, reconnect your KlickTipp credentials.  \n\nField Mapping and Adjustments:  \nVerify and customize field assignments in the workflow to align with your specific form and subscriber list setup.  \n\nWorkflow Logic  \n\nTrigger via Gravity Forms Submission:  \n   The workflow begins when a new form submission is received through the webhook.  \n\nTransform Data for KlickTipp:  \n   Formats and validates raw form data for compatibility with KlickTipp’s API.  \n\nAdd to KlickTipp Subscriber List:  \n   Adds processed data as a new subscriber or updates an existing one.  \n\nGet all tags from KlickTipp and create a list: Fetches all existing Tags and turns them into an array\n\nDefine tags to dynamically set for contacts: Definiton of variables that are received from the form submission and should be converted into tags\n\nMerge tags of both lists:\nChecks whether the list of existing tags in KlickTipp contains the tags which should be dynamically set based on the form submission\n\nTag creation and tagging contacts: Creates new tags if it previously did not exist and then tags the contact\n\n\nBenefits  \n\nEfficient lead generation: Contacts from forms are automatically imported into KlickTipp and can be used immediately, saving time and increasing the conversion rate.  \nAutomated processes: Experts can start workflows directly, such as welcome emails or course admissions, reducing administrative effort.  \nError-free data management: The template ensures precise data mapping, avoids manual corrections and reinforces a professional appearance.  \n\nTesting and Deployment  \n\nTest the workflow by filling the form on Gravity Forms and verifying data updates in KlickTipp.  \n\nNotes  \n\nCustomization: Update field mappings within the KlickTipp nodes to align with your account setup. This ensures accurate data syncing.  \n",
  "totalViews": 338,
  "source": "official",
  "user": {
    "id": 92256,
    "name": "KlickTipp",
    "username": "KlickTipp",
    "bio": "Reach more people. 100% GDPR compliant. Quickly create automated email campaigns, SMS and marketing automations. Market your knowledge independently of Google & Co., sell lucrative products and activate your customers.",
    "verified": true,
    "links": "[\"https://www.klicktipp.com/\"]",
    "avatar": "https://gravatar.com/avatar/38677fedcb7c47d414fa2b6ecabb1f51a1f0efaecd06f316971632d6c192e2ff?r=pg&d=retro&size=200"
  },
  "categories": [],
  "nodes": [],
  "nodeCount": 0,
  "createdAt": "2025-01-21T17:03:13.432Z",
  "path": "official/template_2769/workflow.json"
}