{
  "id": 2376,
  "name": "Backup Tag-Selected Workflows to Gitlab",
  "description": "Fetches workflow definitions from within n8n, selecting only the ones that have one or more (configurable) assigned tags and then:\nDerives a suitable backup filename by reducing the workflow name to a string with alphanumeric characters and no-spaces\n    Note: This isn't bulletproof, but works as long as workflow names aren't too crazy.\nDetermines which workflows need to be backed up based on whether each one:\n    has been modified. (Note: Even repositioning a node counts.)\n   ...or...\n    is new. (Note: Renaming counts as this.)\nCommits JSON copies of each workflow, as necessary, to a Gitlab repository with a generated, date-stamped commit message.\n\nSetup\nCredentials\n  Create a Gitlab Credentials item and assign it to all Gitlab nodes.\n  Create an n8n Credentials item and assign it to the n8n node\n    Note: This was tested with http://localhost:5678/api/v1 but should work with any reachable n8n instance and API key.\n\nModify these values in the \"Globals\" Node\n  gitlab_owner - {{your gitlab account}}\n  gitlab_project - {{ your gitlab project name }}\n  gitlab_workflow_path - {{ subdirectory in the project where backup files should be saved/committed }}\n  tags_to_match_for_backup - {{tag(s) to match for backup selection}}\n    *ALERT: According to the n8n node's Filters -&gt; tags field annotations, and API documentation, this supports a CSV list of multiple tags (e.g. tag1,tag2), but the API behavior requires workflows to have all-of the listed tags, not any-of them.*\n      See: https://github.com/n8n-io/n8n/issues/10348\n      TL/DR - Don't expect a multiple tag list to be more inclusive.\n      Possible workaround: To match more than one tag value, duplicate the n8n node into multiple single-tag matches, or split and iterate multiple values, and merge the results.\n\nPossible Enhancements\nMake the branch (\"Reference\") for all the gitlab nodes configurable.  Fixed on all as \"main\" in the template.\nAdd an n8n node to generate an audit and store the output in gitlab along with the backups.\nExtend the workflow at the end to create a Gitlab release/tag whenever any backup files are actually updated or created.\n\n\n",
  "totalViews": 1474,
  "source": "official",
  "user": {
    "id": 91880,
    "name": "Hubschrauber",
    "username": "hubschrauber",
    "bio": "Software developer specializing in \"back-end plumbing\" to connect and sync data between large corporate systems, enabling application distribution/migration, scaling, and containerization.  Using n8n for various orchestration tasks both at home and \"on the job.\"",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/937647d994a5af6961d76103821d84448e970d74e6d0d303e8a76b56fd1da695?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development"
  ],
  "nodes": [
    {
      "name": "GitLab",
      "type": "n8n-nodes-base.gitlab",
      "categories": [
        "Development"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 1,
  "createdAt": "2024-08-11T02:28:38.951Z",
  "path": "official/template_2376/workflow.json"
}