{
  "id": 3521,
  "name": "Twitch Auto-Clip-Generator: Fetch from Streamers, Clip & Edit on Autopilot",
  "description": "Twitch Clipping Automation Workflow\n\n\nThis automated Twitch clipping workflow is perfect for Twitch streamers, content creators, and clippers who want to repurpose and monetize their favorite stream moments. Whether you’re a streamer aiming to boost engagement on social media or a viewer curating highlights from your favorite channels, this workflow streamlines the process of creating high-quality clips.\n\nFeatures\n\nManually extracting and editing Twitch clips is time-consuming and inefficient (since streams usually last several hours). Our Twitch clipping automation workflow addresses this challenge by automatically:\nCapturing daily stream highlights.\nFiltering for the best, most engaging clips.\nEditing clips into social-media-ready formats (9:16).\nOrganizing and uploading the clips for quick sharing.\n\nThis automation helps you save valuable time and maximizes your content production, making it ideal for growing your online presence and monetizing Twitch highlights.\n\nWhat this workflow does\n\nDaily Trigger:** Automatically runs each day to detect new Twitch streams.\nClip Extraction:** Gathers all clips from that day’s broadcast using Twitch API integration.\nClip Filtering:** Uses customizable criteria to select only the highest quality clips.\nClip Editing:** Automatically edits clips into scroll-stopping clips suitable for TikTok, Instagram Reels, YouTube Shorts, and other social platforms.\nFlexible Upload Options:** \n\tGoogle Drive (default): Stores the edited clips for easy review and selection.\n\tTikTok: Directly uploads clips for quick sharing on TikTok (customization needed).\n\tYouTube Shorts: Formats and uploads clips as YouTube Shorts (customization needed).\n\tInstagram Reels: Prepares and uploads clips for Instagram Reels (customization needed).\n\nSetup\n\nTo set up this Twitch clipping automation workflow, you will need:\nTwitch Account: With your Twitch Account you need to log in to the Twitch Developer Console.\nGoogle Drive Integration: Set up your Google Drive in n8n.\nFilter Configuration (Optional): Define what constitutes a “best clip” using parameters such as view count, clip length, or specific keywords (there is a basic filter set as default).\n\nHow to customize this workflow to your needs\n\nAdvanced Filtering Logic:** Customize the criteria for selecting clips based on your unique style or specific engagement metrics.\nDestination Settings:** Choose and configure your preferred upload destinations. Switch between Google Drive, TikTok, YouTube Shorts, or Instagram Reels based on your content strategy.\nNotification Integration:** Add notifications via Slack, Discord, or email to alert you when new clips are ready.\n",
  "totalViews": 581,
  "source": "official",
  "user": {
    "id": 92893,
    "name": "Mateo Fiorito Rocha",
    "username": "lemolex",
    "bio": "Passionate about AI-driven automation, LLMs, and intelligent systems that enhance efficiency and engagement. Let’s build smarter workflows, send me a message!",
    "verified": true,
    "links": "[\"https://www.linkedin.com/in/mateofioritorocha/\"]",
    "avatar": "https://gravatar.com/avatar/1547577657bcdb579dd2c1946c4382029800b8e23e112916e4fe11cc66a6f9fa?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Data & Storage",
    "Marketing"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "YouTube",
      "type": "n8n-nodes-base.youTube",
      "categories": [
        "Marketing"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-04-11T21:46:09.083Z",
  "path": "official/template_3521/workflow.json"
}