{
  "id": 2940,
  "name": "🔥📈🤖 AI Agent  for n8n Creators Leaderboard - Find Popular Workflows",
  "description": "n8n Creators Leaderboard Workflow\n\nWhy Use This Workflow?\n\nThe n8n Creators Leaderboard Workflow is a powerful tool for analyzing and presenting detailed statistics about workflow creators and their contributions within the n8n community. It provides users with actionable insights into popular workflows, community trends, and top contributors, all while automating the process of data retrieval and report generation.\n\nBenefits\nDiscover Popular Workflows**: Identify workflows with the most unique visitors and inserters (weekly and monthly).  \nUnderstand Community Trends**: Gain insights into what workflows are resonating with the community.  \nRecognize Top Contributors**: Highlight impactful creators to foster collaboration and inspiration.  \nSave Time with Automation**: Automates data fetching, processing, and reporting for efficiency.\n\nUse Cases\nFor Workflow Creators**: Track performance metrics of your workflows to optimize them for better engagement.  \nFor Community Managers**: Identify trends and recognize top contributors to improve community resources.  \nFor New Users**: Explore popular workflows as inspiration for building your own automations.\n\nHow It Works\n\nThis workflow aggregates data from GitHub repositories containing statistics about workflow creators and their templates. It processes this data, filters it based on user input, and generates a detailed Markdown report using an AI agent.\n\nKey Features\nData Aggregation: Fetches creator and workflow statistics from GitHub JSON files.\nCustom Filtering: Focuses on specific creators based on a username provided via chat.\nAI-Powered Reports: Generates comprehensive Markdown reports with summaries, tables, and insights.\nOutput Flexibility: Saves reports locally with timestamps for easy access.\n\nData Retrieval & Processing\nCreators Data**: Retrieved via an HTTP Request node from a JSON file containing aggregated statistics about creators.\nWorkflows Data**: Pulled from another JSON file with workflow metrics like visitor counts and inserter statistics.\nData Merging**: Combines creator and workflow data by matching usernames to provide enriched statistics.\n\nReport Generation\nThe AI agent generates a Markdown report that includes:\nA summary of the creator’s contributions.\nA table of workflows with key metrics (e.g., unique visitors, inserters).\nInsights into trends or community feedback.\n\nThe report is saved locally as a file with a timestamp for tracking purposes.\n\nQuick Start Guide\n\nPrerequisites\nEnsure your n8n instance is running.\nVerify that the GitHub base URL and file variables are correctly set in the Global Variables node.\nConfirm that your OpenAI credentials are configured for the AI Agent node.\n\nHow to Start\nActivate the Workflow: Make sure the workflow is active in your n8n environment.\nTrigger via Chat: Use the Chat Trigger node to initiate the workflow by sending a message like:  \n   show me stats for username [desired_username]  \n   Replace [desired_username] with the username you want to analyze.\nProcessing & Report Generation: The workflow fetches data, processes it, and generates a Markdown report.\nView Output: The final report is saved locally as a file (with a timestamp), which you can review to explore leaderboard insights.\n",
  "totalViews": 5640,
  "source": "official",
  "user": {
    "id": 92125,
    "name": "Joseph LePage",
    "username": "joe",
    "bio": "As an AI Automation consultant based in Canada, I partner with forward-thinking organizations to implement AI solutions that streamline operations and drive growth.",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/e7ca218dfc87b68344bbd66f40da01546d2f6fc1cf884267821e8a77e3e8410a?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Ollama Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOllama",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Simple Memory",
      "type": "@n8n/n8n-nodes-langchain.memoryBufferWindow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Memory"
        ],
        "Memory": [
          "For beginners"
        ]
      }
    },
    {
      "name": "Call n8n Workflow Tool",
      "type": "@n8n/n8n-nodes-langchain.toolWorkflow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Tools"
        ],
        "Tools": [
          "Recommended Tools"
        ]
      }
    }
  ],
  "nodeCount": 6,
  "createdAt": "2025-02-19T01:38:03.072Z",
  "path": "official/template_2940/workflow.json"
}