{
  "id": 2491,
  "name": "Create LinkedIn Contributions with AI and Notify Users On Slack",
  "description": "This workflow automates the process of gathering LinkedIn advice articles, extracting their content, and generating unique contributions for each article using an AI model. The contributions are then posted to a Slack channel and a NocoDB database for record-keeping. The workflow is triggered weekly to ensure new articles are continuously collected and responded to.\n\nWho is this for?\nThis workflow is designed for professionals, marketers, and content creators looking to boost their LinkedIn presence by regularly engaging with LinkedIn advice articles. It’s especially useful for those who want to be seen as a \"thought leader\" or \"top voice\" in their niche by contributing relevant and unique advice to trending topics.\n\nWhat problem is this workflow solving?\nManually searching for relevant LinkedIn articles, reading through them, and crafting thoughtful contributions can be time-consuming. This workflow solves that by automating the process of finding new articles, extracting key content, and generating AI-powered contributions. It helps users stay consistently active on LinkedIn, contributing value to trending discussions.\n\nWhat this workflow does\nTriggers Weekly: The workflow is set to run every Monday at 8:00 AM.\nSearch Google for LinkedIn Advice Articles: Uses a predefined Google search URL to find the latest LinkedIn advice articles based on the user's area of expertise.\nExtract LinkedIn Article Links: A code node extracts all LinkedIn advice article links from the search results.\nRetrieve Article Content: For each article link, the workflow retrieves the HTML content and extracts the article title, topics, and existing contributions.\nGenerate AI-Powered Contributions: The workflow sends the extracted article content to an AI model, which generates unique, helpful advice for each topic within the article.\nPost to Slack & NocoDB: The AI-generated contributions, along with the article links, are posted to a designated Slack channel and stored in a NocoDB database for future reference.\n\nSetup\nGoogle Search URL: Update the Google search URL with the relevant LinkedIn advice query for your field (e.g., \"site:linkedin.com/advice 'marketing automation'\").\nSlack Integration: Connect your Slack account and specify the Slack channel where you want the contributions to be posted.\nNocoDB Integration: Set up your NocoDB project to store the generated contributions along with the article titles and links.\n\nHow to customize this workflow\nChange Search Terms**: Modify the Google search URL to focus on a different LinkedIn topic or expertise area.\nAdjust Trigger Frequency**: The workflow is set to run weekly, but you can adjust the frequency by changing the schedule trigger.\nEnhance Contribution Quality**: Customize the AI model's prompt to generate contributions that align with your brand voice or content strategy.\n\nWorkflow Summary\nThis workflow helps users maintain a consistent presence on LinkedIn by automating the discovery of new advice articles and generating unique contributions using AI. It is ideal for professionals who want to engage with LinkedIn content regularly without spending too much time manually searching and drafting responses.",
  "totalViews": 4773,
  "source": "official",
  "user": {
    "id": 92011,
    "name": "Darryn",
    "username": "optimus01",
    "bio": "",
    "verified": true,
    "links": "[\"http://onlinethinking.io/community/\"]",
    "avatar": "https://gravatar.com/avatar/7c20cc4f6cea0480e0e7d58353274476e195d6ec8926a3a6709bb217e7f03713?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes",
    "Communication",
    "HITL",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Airtable",
      "type": "n8n-nodes-base.airtable",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Slack",
      "type": "n8n-nodes-base.slack",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "NocoDB",
      "type": "n8n-nodes-base.nocoDb",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "HTML",
      "type": "n8n-nodes-base.html",
      "categories": [
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Data Transformation"
        ]
      }
    },
    {
      "name": "OpenAI",
      "type": "@n8n/n8n-nodes-langchain.openAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Miscellaneous",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 8,
  "createdAt": "2024-10-23T19:16:01.726Z",
  "path": "official/template_2491/workflow.json"
}