{
  "id": 2390,
  "name": "Automate company research using ProspectLens and Google Sheets",
  "description": "\n\nThis n8n workflow automates the process of researching companies by gathering relevant data such as traffic volume, foundation details, funding information, founders, and more.\n\nThe workflow leverages the ProspectLens API, which is particularly useful for researching companies commonly found on Crunchbase and LinkedIn.\n\nProspectLens is an API that provides very detailed company data. All you need to do is supply the company's domain name.\n\nYou can obtain your ProspectLens API key here:\nhttps://apiroad.net/marketplace/apis/prospectlens\n\nIn n8n, create a new \"HTTP Header\" credential. Set x-apiroad-key as the \"Name\" and enter your APIRoad API key as the \"Value\". Use this credential in the HTTP Request node of the workflow.\n\n\n\n",
  "totalViews": 3632,
  "source": "official",
  "user": {
    "id": 91927,
    "name": "Anthony",
    "username": "scrapeninja",
    "bio": "I am a software engineer and technical lead with over 15 years of experience, and I am passionate about building and scaling SaaS products. ScrapeNinja.net (bootstrapped) has been the most exciting and challenging product I have built so far. ScrapeNinja is primarily aimed at fellow developers and founders of software products, and it tries to alleviate the major pains of reliable, observable and scalable web scraping and feeding data into LLMs. ",
    "verified": true,
    "links": "[\"https://pixeljets.com\"]",
    "avatar": "https://gravatar.com/avatar/edbc5b9e7a0952395b10b4f8af8dfe7b157328e94f8a6776715a89edc27412e0?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-08-23T14:36:00.805Z",
  "path": "official/template_2390/workflow.json"
}