{
  "id": 2966,
  "name": "Upload Multiple Attachments from Gmail to Google Drive - Without a Code Node",
  "description": "Summary\nThis template uses the item handling nodes, and expression-support in n8n, without using a Code node, to extract multiple attachments from a GMail (trigger input) message/event, and (conditionally) upload each of them to Google Drive.\n\nNote: There is another template titled Get Multiple Attachments from Gmail and upload them to GDrive that does basically the same thing, but it uses a Code node.\n\nDetails\nUsing Split Out instead of Code\nThe “secret” to how this works is that n8n supports a special input field name $binary that references the entire set of (multiple) binary data sub-elements in a single input item.  It may look like an expression, but in this case it is a “fixed” (literal) value used as the Fields to Split Out parameter value.\n\nDealing with names that are prefixed/suffixed with an Index\nThe next challenge with multiple attachments from a GMail message is that each one is still assigned different name like \"attachment_0\", \"attachment_1\", etc.  This makes it tricky to reference them in a generic way.  However, once n8n splits the items out, the binary in each item is always the first (i.e. index-zero / [0]) and ONLY key/value.  So, that makes it possible get the key-name and attributes of the corresponding value indirectly with some clever expression syntax.\nInput Data Field Name -&gt; Expression: {{ $binary.keys()[0] }} - This returns the name, regardless of whether it is \"attachment_0\", \"attachment_1\", or whatever else.\nAttachment file name: -&gt; Expression: {{ $binary.values()[0].fileName }}\nAttachment file name extension: -&gt; Expression: {{ $binary.values()[0].fileExtension }}\nAttachment file type: -&gt; Expression: {{ $binary.values()[0].fileType }}\nAttachment file size (e.g. string \"100 kB\"): -&gt; Expression: {{ $binary.values()[0].fileSize }}\nAttachment file size (numeric): -&gt; Expression: {{ $binary.values()[0].fileSize.split(' ')[0].toNumber() }}\nAttachment mime type: -&gt; Expression: {{ $binary.values()[0].mimeType }}\nAttachment id (storage GUID): -&gt; Expression: {{ $binary.values()[0].id }}\n\nFlow Control\nSince each of the attachments becomes a single item, it is relatively straightforward to introduce other n8n nodes like If, Switch, or Filter and route each single attachment item into different workflow paths.  The template demonstrates how each attachment binary could be routed based on its file size, as an example.",
  "totalViews": 1800,
  "source": "official",
  "user": {
    "id": 91880,
    "name": "Hubschrauber",
    "username": "hubschrauber",
    "bio": "Software developer specializing in \"back-end plumbing\" to connect and sync data between large corporate systems, enabling application distribution/migration, scaling, and containerization.  Using n8n for various orchestration tasks both at home and \"on the job.\"",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/937647d994a5af6961d76103821d84448e970d74e6d0d303e8a76b56fd1da695?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage"
  ],
  "nodes": [
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 1,
  "createdAt": "2025-02-21T18:45:43.874Z",
  "path": "official/template_2966/workflow.json"
}