{
  "id": 3438,
  "name": "Automatically Create Cinematic Quote Videos with AI and Upload to YouTube",
  "description": "⚠️ Important Disclaimer:\nThis template is only compatible with a self-hosted n8n instance using a community node.\nWho is this for?\nThis workflow is ideal for digital content creators, marketers, social media managers, and automation enthusiasts who want to produce fully automated vertical video content featuring inspirational or motivational quotes. Specifically tailored for Thai language, it effectively demonstrates integration of AI-generated imagery, video, ambient sound, and visually appealing quote overlays.\n\nWhat problem is this workflow solving?\nManually creating high-quality, vertically formatted quote videos is often repetitive, time-consuming, and involves multiple tedious steps like selecting suitable visuals, editing audio tracks, and correctly overlaying text. Additionally, manual uploading to platforms like YouTube and maintaining accurate content records are prone to errors and inefficiencies.\n\nWhat this workflow does:\nFetches a quote, author, and scenic background description from a Google Sheet.\nAutomatically generates a vertical background image using the Flux AI (txt2img) API.\nTransforms the AI-generated image into a subtly animated cinematic vertical video using the Kling video-generation API.\nGenerates an immersive, ambient background sound using ElevenLabs’ sound generation API.\nDynamically overlays the selected Thai-language quote and author text onto the generated video using FFmpeg, ensuring visually appealing typography (e.g., Kanit font).\nAutomatically uploads the final video to YouTube.\nUpdates the resulting YouTube video URL back to the Google Sheet, keeping your content records current and well-organized.\n\nSetup\nRequirements:\nThis workflow requires a self-hosted n8n instance, as the execution of FFmpeg commands is not supported on n8n Cloud. Ensure FFmpeg is installed on your self-hosted environment.\n\nAPI keys and accounts setup for Flux, Kling, ElevenLabs, Google Sheets, Google Drive, and YouTube.\n\nGoogle Sheets Setup:\nYour Google Sheet must include these columns:\nIndex**\tUnique identifier for each quote\nQuote (Thai)**\tQuote text in Thai language (or your chosen language)\nPen Name (Thai)**\tAuthor or pen name of the quote's creator\nBackground (EN)**\tShort English description of the scene (e.g., \"sunrise over mountains\")\nPrompt (EN)**\tDetailed English prompt describing the image/video scene (e.g., \"peaceful sunrise with misty mountains\")\nBackground Image**\tURL of AI-generated image (updated automatically)\nBackground Video**\tURL of generated video (updated automatically)\nMusic Background**\tURL of generated ambient audio (updated automatically)\nVideo Status**\tYouTube URL (updated automatically after upload)\nA ready-to-use Google Sheets template is provided [here (provide your actual link)].\n\nTo help you get started quickly, you can use this template spreadsheet.\nNext steps:\nAuthenticate Google Sheets, Google Drive, YouTube API, Flux AI, Kling API, and ElevenLabs API within n8n.\nEnsure FFmpeg supports fonts compatible with your chosen language (for Thai, \"Kanit\" font is recommended).\nPrepare your Google Sheets with desired quotes, authors, and image/video prompts.\nHow to customize this workflow to your needs:\nFonts:** Adjust font type, size, color, and positioning within the provided FFmpeg commands in the workflow’s code nodes. Verify that selected fonts properly support your target language.\nMedia Customization:** Customize the scene descriptions in your Google Sheet to change image/video backgrounds automatically generated by AI.\nQuote Management:** Easily manage, add, or update quotes and associated details directly via Google Sheets without workflow modifications.\nAudio Ambiance:** Customize or adjust the ambient sound prompt for ElevenLabs within the workflow’s HTTP Request node to match your video's desired mood.\n\nBenefits of using AI-generated content and localized fonts:\nLeveraging AI-generated visual and audio elements along with localized fonts greatly enhances audience engagement by creating visually appealing, professional-quality content tailored specifically for your target audience. This automated workflow drastically reduces production time and manual effort, enabling rapid, consistent content creation optimized for platforms such as YouTube Shorts, Instagram Reels, and TikTok.\n\n",
  "totalViews": 1311,
  "source": "official",
  "user": {
    "id": 92667,
    "name": "Jaruphat J.",
    "username": "jaruphatj",
    "bio": "Project Manager who passionate about Automation & AI and continuously explore innovative ways to improve business processes through intelligent workflow automation. Let’s connect and automate the future! ",
    "verified": true,
    "links": "[\"https://www.youtube.com/@JaruphatJ\"]",
    "avatar": "https://gravatar.com/avatar/847eff98bf683847ee92dd56b7d8169f88e9e8f3d839590713d6eab45c59a72f?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-04-05T01:03:46.035Z",
  "path": "official/template_3438/workflow.json"
}