{
  "id": 3531,
  "name": "Convert YouTube Videos into SEO Blog Posts with GPT-4o, Dumpling AI, and Flux",
  "description": "Workflow Description\n\nThis workflow helps content creators automatically repurpose YouTube videos into SEO-friendly blog posts. It extracts the video transcript, uses AI to generate a full blog post with a relevant image, and sends the complete package via email, ready for publication.\n\nPrerequisites/Requirements\n\nThis workflow relies on external AI services. You will need:\n\nOpenAI Account: Used for generating the blog post text (specifically mentioned using GPT-4o in the workflow notes).\n    Credentials: Requires an API key from OpenAI.\n    Cost: OpenAI API usage is typically paid based on the amount of text processed (tokens). Check OpenAI's current pricing.\n    Setup: Sign up at OpenAI and obtain your API key.\nDumpling AI Account: Used for retrieving YouTube video transcript and generating the blog post image.\n    Credentials: Requires an API key from Dumpling AI.\n    Cost: Dumpling AI offers 250 free credits to start with and different plans for different levels of usage. Check the pricing page for more details.\n    Setup: Sign up at Dumpling AI and obtain your API key/credentials.\nEmail Account: Credentials for the email service (e.g., Gmail) used to send the final result.\n\nHow it works\n\nInput Video Details: You provide the YouTube video URL and your email address.\nGet Transcript: The workflow fetches the transcript of the specified YouTube video.\nGenerate Content: An AI model crafts a blog post (title, description, body) based on the transcript.\nCreate Image: Another AI model generates a suitable image for the blog post.\nFormat & Package: The blog post is converted to HTML, and the image is prepared for sending.\nEmail Result: The final HTML blog post and image are emailed to you.\n\nSet up steps\n\nConfigure Variables: Enter the specific YouTube video URL and the recipient email address in the \"Set Variables\" node.\nConnect Credentials: Add your credentials for the services used (e.g., OpenAI for text generation, Dumpling AI for YouTube Transcript and AI image generation service).\nConnect Email Credentials: Authenticate your Gmail account (or chosen email provider) to allow the workflow to send the email.\n\nTake it to the next level\n\nDirect Publishing:** Instead of emailing the result, connect directly to your CMS (like WordPress, Ghost, Webflow) to automatically create a draft or publish the blog post.\nAI Agent Integration:** Replace the single \"Generate Blog Post\" step with an AI Agent for more sophisticated content generation, potentially researching topics or structuring the post section by section based on the transcript.\nSocial Media Snippets:** Add steps to generate companion social media posts (e.g., for Twitter, LinkedIn) summarizing the blog post.\nBatch Processing:** Modify the trigger to read multiple YouTube URLs from a spreadsheet or database to convert videos in bulk.\nEnhanced SEO:** Refine the AI prompts to specifically target keywords or incorporate SEO best practices more deeply into the generated content.\nMultiple Image Options:** Generate several image variations and include them in the email or draft post for selection.\n",
  "totalViews": 1468,
  "source": "official",
  "user": {
    "id": 93751,
    "name": "Yang",
    "username": "yang",
    "bio": "",
    "verified": true,
    "links": "[]",
    "avatar": "https://gravatar.com/avatar/6c996ff9ed140535b522858466c376f84e755b851b34b0ad900e4e6568568f84?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Communication",
    "HITL",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Gmail",
      "type": "n8n-nodes-base.gmail",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "OpenAI",
      "type": "@n8n/n8n-nodes-langchain.openAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Miscellaneous",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2025-04-13T05:31:39.383Z",
  "path": "official/template_3531/workflow.json"
}