{
  "id": 2776,
  "name": "Sync New Files From Google Drive with Airtable",
  "description": "This workflow automatically fetches newly uploaded files from a specific folder in Google Drive, shares them via email with specified recipients, and logs the file details (name, ID, created time, modified time) into Airtable for easy tracking. It streamlines the process of file sharing and management while keeping track of important metadata in a central place.\nStep-by-Step Instructions\n\nGoogle Drive Node (Fetch New File)\nAction: \nThis node fetches newly uploaded files from the specific folder you’ve mentioned in your Google Drive.\n\nConfiguration:\nSet the folder ID in the Google Drive node where the files are uploaded.\nUse the “New File in Folder” trigger to automatically detect new files added to the folder.\n\nSend Email Node (Share File via Email)\nAction: \nAfter detecting the new file, this node shares the file via email with the recipient you specify.\n\nConfiguration:\nSet the recipient's email address.\nInclude the file URL from the Google Drive node in the email body, allowing easy access to the file.\nAdd the file name as part of the email subject or body to notify the recipient about the new file.\n\nAirtable Node (Store File Metadata)\nAction: \nThis node stores the file’s metadata, such as name, ID, creation time, modification time, and the email address to which it was sent, in your Airtable database.\n\nConfiguration:\nSet up Airtable with a table.\nMap the output from the Google Drive node to store the file metadata, and use the email address from the email node for tracking.\n\nAbout WeblineIndia\nWeblineIndia specializes in delivering innovative and custom AI solutions to simplify and automate business processes. If you need any help, please reach out to us.",
  "totalViews": 841,
  "source": "official",
  "user": {
    "id": 92407,
    "name": "WeblineIndia",
    "username": "weblineindia",
    "bio": "A Leading Software Engineering, Consulting & Outsourcing Services Company in USA & India serving Clients Globally since 1999.",
    "verified": true,
    "links": "[\"https://www.weblineindia.com/\"]",
    "avatar": "https://gravatar.com/avatar/a229d43aefca4588581583c58bb37b4773aebbdf4c1fef86a08bb1d38eae91fa?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage"
  ],
  "nodes": [
    {
      "name": "Airtable",
      "type": "n8n-nodes-base.airtable",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 2,
  "createdAt": "2025-01-22T14:01:41.722Z",
  "path": "official/template_2776/workflow.json"
}