{
  "id": 2644,
  "name": "Flux Dev Image Generation (Fal.ai) to Google Drive",
  "description": "This workflow automates AI-based image generation using the Fal.ai Flux API. Define custom prompts, image parameters, and effortlessly generate, monitor, and save the output directly to Google Drive. Streamline your creative automation with ease and precision.\n\nWho is this for?\n\nThis template is for content creators, developers, automation experts, and creative professionals looking to integrate AI-based image generation into their workflows. It’s ideal for generating custom visuals with the Fal.ai Flux API and automating storage in Google Drive.\n\nWhat problem is this workflow solving?\n\nManually generating AI-based images, checking their status, and saving results can be tedious. This workflow automates the entire process — from requesting image generation, monitoring its progress, downloading the result, and saving it directly to a Google Drive folder.\n\nWhat this workflow does\n\tSets Custom Image Parameters: Allows you to define the prompt, resolution, guidance scale, and steps for AI image generation.\n\tSends a Request to Fal.ai: Initiates the image generation process using the Fal.ai Flux API.\n\tMonitors Image Status: Checks for completion and waits if needed.\n\tDownloads the Generated Image: Fetches the completed image once ready.\n\tSaves to Google Drive: Automatically uploads the generated image to a specified Google Drive folder.\n\nSetup\n\t1.\tPrerequisites:\n\t•\tFal.ai API Key: Obtain it from the Fal.ai platform and set it as the Authorization header in HTTP Header Auth credentials.\n\t•\tGoogle Drive OAuth Credentials: Connect your Google Drive account in n8n.\n\t2.\tConfiguration:\n\t•\tUpdate the “Edit Fields” node with your desired image parameters:\n\t•\tPrompt: Describe the image (e.g., “Thai young woman net idol 25 yrs old, walking on the street”).\n\t•\tWidth/Height: Define image resolution (default: 1024x768).\n\t•\tSteps: Number of inference steps (e.g., 30).\n\t•\tGuidance Scale: Controls image adherence to the prompt (e.g., 3.5).\n\t•\tSet your Google Drive folder ID in the “Google Drive” node to save the image.\n\t3.\tRun the Workflow:\n\t•\tTrigger the workflow manually to generate the image.\n\t•\tThe workflow waits, checks status, and saves the final output seamlessly.\n\nCustomization\n\t•\tModify Image Parameters: Adjust the prompt, resolution, steps, and guidance scale in the “Edit Fields” node.\n\t•\tChange Storage Location: Update the Google Drive node with a different folder ID.\n\t•\tAdd Notifications: Integrate an email or messaging node to alert you when the image is ready.\n\t•\tAdditional Outputs: Expand the workflow to send the generated image to Slack, Dropbox, or other platforms.\n\nThis workflow streamlines AI-based image generation and storage, offering flexibility and customization for creative automation.",
  "totalViews": 6380,
  "source": "official",
  "user": {
    "id": 92135,
    "name": "Sira Ekabut",
    "username": "siraekabut",
    "bio": "Excel & Power BI Trainer\n\nHobbies : \n- Advanced AI Image Generation with ComfyUI\n- AI Automation with n8n",
    "verified": true,
    "links": "[\"https://www.thepexcel.com/\"]",
    "avatar": "https://gravatar.com/avatar/5895ef0c4917274b518279c1ab54d9fc12db4422ad4d3833fb58176c846e7e45?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Data & Storage"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-12-16T16:52:49.861Z",
  "path": "official/template_2644/workflow.json"
}