{
  "id": 2771,
  "name": "AI Data Extraction with Dynamic Prompts and Airtable",
  "description": "This n8n template introduces the Dynamic Prompts Ai workflow pattern which are incredible for certain types of data extraction tasks where attributes are unknown or need to remain flexible.\n\nThe general idea behind this pattern is that the prompts for requested attributes to be extracted live outside the template and so can be changed at any time - without needing to edit the template. This seriously cuts down on maintainance requirements and is reusable for any number of tables at little cost.\n\nCheck out the video demo I did for n8n Studio here: https://www.youtube.com/watch?v=_fNAD1u8BZw\n\nCheck out the example Airtable here: https://airtable.com/appAyH3GCBJ56cfXl/shrXzR1Tj99kuQbyL\n\nLooking for the Baserow Version? https://n8n.io/workflows/2780-ai-data-extraction-with-dynamic-prompts-and-baserow/\n\nHow it works\nGiven we have an \"input\" field for context and a number of fields for the data we want to extract, this template will run in the background to react to any changes to either the \"input\" or fields and automatically update the rows accordingly.\nThe key is that Airtable fields have a special property called the \"field description\". In this pattern, we use this property to allow the user to store a simple prompt describing the data that should exist in the column.\nOur n8n template reads these column descriptions aka \"prompts\" to use as instructions to perform tasks on the \"input\".\nIn this template, the \"input\" is a PDF of a resume/CV and the columns are attributes a HR person would want to extract from it - such as full name, address, last position, years of experience etc.\n\nHow to use\nFirst publish this template and ensure it's accessible via webhook URL.\nYou then have to run the \"create airtable webhooks\" mini-flow to configure your Airtable to send change events to the n8n template. This mini-flow exists in the template but you'll have to update the IDs.\n\nCheck the template for more instructions.\n\nRequirements\nAirtable for Tables/Database\nOpenAI for LLM and extraction. Feel free to choose another LLM if preferred.\n\nCustomising this workflow\nIf you're not using files, you can replace the \"input\" field with anything you like. For example, the \"input\" could be single line text.\n",
  "totalViews": 4264,
  "source": "official",
  "user": {
    "id": 91804,
    "name": "Jimleuk",
    "username": "jimleuk",
    "bio": "Freelance consultant based in the UK specialising in AI-powered automations. I work with select clients tackling their most challenging projects. For business enquiries, send me an email at hello@jimle.uk\n\nLinkedIn: https://www.linkedin.com/in/jimleuk/\nX/Twitter: https://x.com/jimle_uk",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/4ab99e51473df76838beeaac908747f7928c625f869794815cabe34016967d51?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Development",
    "Core Nodes",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Airtable",
      "type": "n8n-nodes-base.airtable",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "Basic LLM Chain",
      "type": "@n8n/n8n-nodes-langchain.chainLlm",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    }
  ],
  "nodeCount": 5,
  "createdAt": "2025-01-21T18:38:26.344Z",
  "path": "official/template_2771/workflow.json"
}