{
  "id": 2403,
  "name": "Create Snapshot of Contabo VPS instances on a daily basis",
  "description": "Workflow: Snapshot Contabo\n\nHow it Works\nThis workflow automates daily backups (snapshots) of VPS instances hosted on Contabo. Each day at midnight, it checks for existing snapshots and ensures that only the latest backups are retained by removing older ones. It provides a seamless, hands-off backup process to keep your data secure.\n\nSetup Steps\nSetting up this workflow is quick, typically taking about 10-15 minutes. The essential part of the setup is providing the necessary credentials, which you can easily retrieve from your Contabo control panel.\n\nImport the Workflow: Download and upload the workflow JSON into n8n.\nConfigure Credentials: Add CLIENT_ID, CLIENT_SECRET, API_USER, and API_PASSWORD in the credential node.\nActivate the Workflow: Enable it to run automatically at midnight every day.\n\nFlow Overview\nSchedule Trigger (00:00 daily):** Automatically initiates the workflow.\nFormatted Date:** Prepares a timestamp for naming the snapshot.\nList Snapshots:** Verifies if an existing snapshot is available for each VPS.\nConditional Logic:** \n  No Snapshot? Proceeds to create a new one.\n  Snapshot Found? Deletes the old snapshot before creating a new one.\n\nKey Points\nSnapshot Retention:** Old snapshots are deleted to ensure only the latest backups are stored.\nUnique Identifiers:** UUIDs are used to track and guarantee unique operations.\n\n",
  "totalViews": 1895,
  "source": "official",
  "user": {
    "id": 91774,
    "name": "DUBCOM",
    "username": "dubcom",
    "bio": "I've spent six years as a fullstack developer, focusing on marketing automation with n8n for three years. I integrate systems, automate workflows, and optimize campaigns to enhance efficiency and drive growth in marketing strategies. 🇧🇷🇧🇷🇧🇷🇧🇷",
    "verified": false,
    "links": "[\"https://www.dubcom.com.br\"]",
    "avatar": "https://gravatar.com/avatar/732cb521e70a3ad47d15e1e4065780b47b71f1a67a9f73f655998325ee70c9d5?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    }
  ],
  "nodeCount": 1,
  "createdAt": "2024-09-05T19:31:46.542Z",
  "path": "official/template_2403/workflow.json"
}