{
  "id": 3926,
  "name": "Automated LinkedIn Lead Generation with AI Email Personalization (NOT FINISH)",
  "description": "Lead Machine (NOT FINISH)\n\nWho is this for?\nThis automation is ideal for sales teams, business development professionals, and marketers looking to build a targeted prospect database with automatic qualification. Perfect for agencies, consultants, and B2B companies wanting to identify and prioritize the most promising potential clients.\n\nWhat problem does this workflow solve?\nManually researching companies on LinkedIn, evaluating their fit for your services, verifying emails, and preparing personalized message sequences is time-consuming and subjective. This automation streamlines lead generation by automatically finding, qualifying, and importing qualified prospects into your CRM.\n\nWhat this workflow does\nThis workflow automatically searches for relevant profiles on LinkedIn based on your criteria, retrieves detailed information about each contact, identifies key decision-makers, generates and verifies their email addresses, creates personalized messages based on the prospect's LinkedIn activity, and adds them to your Google Sheet CRM.\n\nSetup\nCreate a Ghost Genius API account and get your API key\nConfigure HTTP Request nodes with Header Auth credentials\nCreate a copy of the provided Google Sheet template\nSet up your Google Sheet and OpenAI credentials following n8n documentation\nCustomize the \"Set Variables\" node to match your target audience and scoring criteria\n\nHow to customize this workflow\nModify search parameters to target different industries, locations, or company sizes\nAdjust the profile count threshold to refine your qualification criteria\nCustomize the AI scoring system to align with your specific product or service offering\nAdapt email templates to match your communication tone and value proposition\nAdd notification nodes to alert you when highly qualified companies are identified",
  "totalViews": 314,
  "source": "official",
  "user": {
    "id": 94057,
    "name": "Matthieu",
    "username": "yaznow",
    "bio": "",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/0087102f41989fc3569adf570c8b0417d9c27884311ec012ce71b0dc2a80b11a?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "OpenAI",
      "type": "@n8n/n8n-nodes-langchain.openAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Miscellaneous",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-05-07T16:15:39.562Z",
  "path": "official/template_3926/workflow.json"
}