{
  "id": 2620,
  "name": "Calendly to KlickTipp Integration",
  "description": "Community Node Disclaimer: This workflow uses community nodes and is compatible only with self-hosted n8n environments.\n\nHow It Works  \n\nEnhanced Calendly Integration: This workflow processes bookings and cancellations in Calendly, dynamically managing invitee and guest data with KlickTipp.  \n\nData Transformation: Dates and times are converted into formats (UNIX timestamps) compatible with KlickTipp’s API, ensuring seamless data integration.  \n\nKey Features  \n\nCalendly Trigger:  \nCaptures new bookings or cancellations of events, including participant details.  \n\nInvitee and Guest Subscription in KlickTipp:  \nAdds or updates invitees and guests in KlickTipp based on booking details (event name, time, join link, reschedule link, cancel link, etc.).  \nTracks and processes cancellations for both invitees and guests.  \nHandles rescheduling intelligently to avoid redundant operations.  \n\nGuest-Specific Operations:  \nProcesses guests individually for bookings and cancellations using dynamic arrays of email addresses.  \nRecovers guest data from invitee records for cancellations since Calendly does not provide guest data upon cancellation.  \n\nData Processing:  \nStandardizes and validates input fields  \nConverts phone numbers to numeric-only format with international prefixes.  \nTransforms dates into UNIX timestamps.  \nReads out the name of the invitee based on both possible input fields for name (name vs. firstname and lastname field setup).  \n\nError Handling:  \nValidates critical fields like phone numbers, URLs, and dates to prevent incorrect data submissions.  \n\nSetup Instructions  \n\nAuthentication:  \nSet up the Calendly and KlickTipp nodes in your n8n instance.  \nConfigure authentication for both Calendly and KlickTipp nodes.  \n\nCustom Field Preparation in KlickTipp:  \nCreate the following custom fields in KlickTipp to align with workflow requirements:  \n\n| Feld-Name                   | Feld-Typ     |\n|----------------------------------|------------------|\n| Calendly_event_name             | Zeile            |\n| Calendly_join_url               | URL              |\n| Calendly_reschedule_url         | URL              |\n| Calendly_cancel_url             | URL              |\n| Calendly_event_start_datetime   | Datum & Zeit     |\n| Calendly_event_end_datetime     | Datum & Zeit     |\n| Calendly_invitee_start_date     | Datum            |\n| Calendly_invitee_end_date       | Datum            |\n| Calendly_invitee_start_time     | Zeit             |\n| Calendly_invitee_end_time       | Zeit             |\n| Calendly_invitee_timezone       | Zeile            |\n| Calendly_invitee_guests_adresses| Zeile            |  \n\nAfter creating fields, allow 10-15 minutes for them to sync. If fields don’t appear, reconnect your KlickTipp credentials.  \n\nField Mapping and Adjustments:  \nOpen each KlickTipp node and map fields to match your setup. The workflow includes placeholders for:  \nInvitee details (first name, last name, email, and phone).  \nEvent details (start/end times, timezone, etc.).  \n\nWorkflow Logic  \n\nTrigger via Calendly event Booking:  \n   A new form event booking or cancellation from Calendly initiates the workflow  \n\nData Transformation:  \n   Processes raw Calendly event data to ensure compatibility with KlickTipp’s API.  \n\nAdd to KlickTipp Subscriber List:  \n   Adds invitees and guests to the designated KlickTipp list, including event-specific details.  \n\nBenefits  \n\nEfficient lead generation: Contacts from event bookings are automatically imported into KlickTipp and can be used immediately, saving time and increasing the conversion rate.  \nAutomated processes: Experts can start workflows directly, such as reminder emails or course admissions, reducing administrative effort.  \nError-free data management: The template ensures precise data mapping, avoids manual corrections and reinforces a professional appearance.  \n\nTesting and Deployment  \n\nTest the workflow by triggering a Calendly event and verifying data updates in KlickTipp.  \n\nNotes:  \n\nCustomization:  \nUpdate field mappings within the KlickTipp nodes to align with your account setup. This ensures accurate data syncing.  \n",
  "totalViews": 454,
  "source": "official",
  "user": {
    "id": 92256,
    "name": "KlickTipp",
    "username": "KlickTipp",
    "bio": "Reach more people. 100% GDPR compliant. Quickly create automated email campaigns, SMS and marketing automations. Market your knowledge independently of Google & Co., sell lucrative products and activate your customers.",
    "verified": true,
    "links": "[\"https://www.klicktipp.com/\"]",
    "avatar": "https://gravatar.com/avatar/38677fedcb7c47d414fa2b6ecabb1f51a1f0efaecd06f316971632d6c192e2ff?r=pg&d=retro&size=200"
  },
  "categories": [],
  "nodes": [],
  "nodeCount": 0,
  "createdAt": "2024-12-10T15:13:32.783Z",
  "path": "official/template_2620/workflow.json"
}