{
  "id": 3472,
  "name": "Automate WordPress Contact Form (CF7) Responses and Classification with Gemini",
  "description": "This workflow optimizes the management of inquiries received through a contact form (Contact Form 7 - CF7 Plugin) on a WordPress site, automating the process of classification, response drafting, and data storage.\n\nThis workflow is particularly useful for businesses that receive multiple daily inquiries and want to improve their efficiency in managing customer communications. \n\nBenefits:  \n✅ Automation & Speed – Reduces the time needed to handle inquiries manually.  \n✅ Better Email Management – Ensures every message receives a timely and accurate response.  \n✅ Customization – The generated draft can be edited before sending, maintaining a personal touch.  \n✅ Inquiry History – Storing data in Google Sheets allows for easy tracking of customer interactions.  \n✅ Easy Integration – Works seamlessly with Contact Form 7 without complex configurations. \n\nHow It Works  \nForm Submission Handling: The workflow starts with a WordPress form submission captured via a webhook. The form data (first name, last name, email, phone, and message) is extracted and structured using the \"Set Fields\" node.  \nMessage Classification: The submitted message is classified into predefined categories (e.g., \"Product Info,\" \"Order Info,\" or \"Other\") using the \"Message Classifier\" node, powered by Google Gemini.  \nAutomated Email Drafting: Based on the classification, the workflow generates a professional email draft using one of three \"Email Writer\" nodes (for Product, Order, or Other requests). Each node uses Google Gemini to craft a personalized response with a structured format (subject and body).  \nEmail Draft Creation: The drafted email is sent as a Gmail draft to the appropriate department, including the original form data for context.  \nData Logging: All submissions, along with their classifications and email drafts, are logged in a Google Sheets spreadsheet for record-keeping and further action.  \n\nSet Up Steps  \nInstall WordPress Plugin: Install the \"CF7 to Webhook\" plugin on WordPress and configure it to send form submissions to the n8n webhook URL.  \nConfigure Webhook in n8n: Set up the \"From Wordpress\" webhook node in n8n to receive POST requests from the WordPress form.  \nGoogle Gemini Integration: Ensure the Google Gemini nodes are properly authenticated with the correct API credentials.  \nGmail and Google Sheets Setup: Authenticate the Gmail and Google Sheets nodes with the appropriate OAuth2 credentials and specify the target spreadsheet and sheet name.  \nCustomize Classification Categories: Adjust the categories in the \"Message Classifier\" node to match your business needs.  \nTest the Workflow: Trigger a test form submission to verify the workflow processes data correctly, classifies the message, generates an email draft, and logs the data.  \n\nNeed help customizing?  \nContact me for consulting and support or add me on Linkedin. ",
  "totalViews": 1065,
  "source": "official",
  "user": {
    "id": 92207,
    "name": "Davide",
    "username": "n3witalia",
    "bio": "Full-stack Web Developer based in Italy specialising in Marketing & AI-powered automations. For business enquiries, send me an email at info@n3w.it or add me on Linkedin.com/in/davideboizza",
    "verified": true,
    "links": "[\"https://n3w.it\"]",
    "avatar": "https://gravatar.com/avatar/d41b8a0aa81139243509c58870f5b4be292824a507ab57d10ed066d8628ed8da?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Communication",
    "HITL",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "Gmail",
      "type": "n8n-nodes-base.gmail",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "Basic LLM Chain",
      "type": "@n8n/n8n-nodes-langchain.chainLlm",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Structured Output Parser",
      "type": "@n8n/n8n-nodes-langchain.outputParserStructured",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Output Parsers"
        ]
      }
    },
    {
      "name": "Google Gemini Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatGoogleGemini",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Text Classifier",
      "type": "@n8n/n8n-nodes-langchain.textClassifier",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 6,
  "createdAt": "2025-04-08T09:34:12.687Z",
  "path": "official/template_3472/workflow.json"
}