{
  "id": 3031,
  "name": "CallForge - 01 - Filter Gong Calls Synced to Salesforce by Opportunity Stage",
  "description": "\nWorkflow Description\n\nWho is this for?\nThis workflow is designed for sales and revenue teams using Gong and Salesforce to track and analyze sales calls. It helps automate the extraction, filtering, and preprocessing of Gong call data for further AI analysis.\n\nWhat problem is this solving?\nSales teams often generate large amounts of call data, but not all calls are relevant for deeper analysis. This workflow filters calls based on predefined criteria, extracts relevant metadata, and formats the data before passing it to an AI processing pipeline.\n\nWhat this workflow does\nTriggers on new Gong calls synced to Salesforce** every hour.\nFilters calls based on opportunity stage** (Discovery or Meeting Booked).\nRetrieves Gong call details** via API.\nFormats call data into a structured JSON object** for AI processing.\nPasses the structured data to a Gong Call Preprocessor workflow** for further insights.\n\nSetup\nEnsure that you have connected Salesforce and Gong APIs with valid credentials.\nModify the Salesforce query in Get all custom Salesforce Gong Objects to match your organization’s requirements.\nSet the schedule trigger interval in the Run Hourly node if needed.\nConnect this workflow to an AI processing workflow to analyze call transcripts.\n\nWorkflow Templates:\nCallForge - 01 - Filter Gong Calls Synced to Salesforce by Opportunity Stage\nCallForge - 02 - Prep Gong Calls with Sheets & Notion for AI Summarization\nCallForge - 03 - Gong Transcript Processor and Salesforce Enricher\nCallForge - 04 - AI Workflow for Gong.io Sales Calls\nCallForge - 05 - Gong.io Call Analysis with Azure AI & CRM Sync\nCallForge - 06 - Automate Sales Insights with Gong.io, Notion & AI\nCallForge - 07 - AI Marketing Data Processing with Gong & Notion\nCallForge - 08 - AI Product Insights from Sales Calls with Notion\n\nHow to customize\nChange filtering logic: Adjust the **opportunity stage filter (Check if Opportunity Stage is Meeting Booked or Discovery) to match your sales process.\nModify data formatting**: Add or remove fields in the Format call into correct JSON Object node to customize the output.\nAdjust trigger frequency**: Change the Run Hourly node to run at a different interval if required.\n",
  "totalViews": 892,
  "source": "official",
  "user": {
    "id": 16588,
    "name": "Angel Menendez",
    "username": "djangelic",
    "bio": "Angel Menendez is a Staff Developer Advocate at n8n.io, specializing in low-code tools for cybersecurity workflows. From Puerto Rico, Angel's tech journey began by helping his father translate technical books. He later started a web development business and transitioned from a career as a flight attendant to cybersecurity engineering. His workflows have saved companies significant time. Outside work, Angel enjoys time with his two sons, riding electric bikes, reading, and exploring new places.",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/fdbe38425d21378d8c9ba8916e1eb0b320add299f12cc23fcd4961d4e6e00bec?r=pg&d=retro&size=200"
  },
  "categories": [
    "Sales",
    "Communication",
    "Development",
    "Developer Tools"
  ],
  "nodes": [
    {
      "name": "Salesforce",
      "type": "n8n-nodes-base.salesforce",
      "categories": [
        "Sales",
        "Communication"
      ],
      "subcategories": {}
    },
    {
      "name": "Gong",
      "type": "n8n-nodes-base.gong",
      "categories": [
        "Development",
        "Developer Tools"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 2,
  "createdAt": "2025-02-28T06:21:55.097Z",
  "path": "official/template_3031/workflow.json"
}