{
  "id": 2441,
  "name": "create e-mail responses with fastmail and OpenAI",
  "description": "Workflow Description:\nThis n8n workflow automates the drafting of email replies for Fastmail using OpenAI's GPT-4 model. Here’s the overall process:\n\nEmail Monitoring: The workflow continuously monitors a specified IMAP inbox for new, unread emails.\nEmail Data Extraction: When a new email is detected, it extracts relevant details such as the sender, subject, email body, and metadata.\nAI Response Generation: The extracted email content is sent to OpenAI's GPT-4, which generates a personalized draft response.\nGet Fastmail Session and Mailbox IDs: Connects to the Fastmail API to retrieve necessary session details and mailbox IDs.\nDraft Identification: Identifies the \"Drafts\" folder in the mailbox.\nDraft Preparation: Compiles all the necessary information to create the draft, including the generated response, original email details, and specified recipient.\nDraft Uploading: Uploads the prepared draft email to the \"Drafts\" folder in the Fastmail mailbox.\n\nPrerequisites:\nIMAP Email Account: You need to configure an IMAP email account in n8n to monitor incoming emails.\nFastmail API Credentials: A Fastmail account with JMAP API enabled. You should set up HTTP Header authentication in n8n with your Fastmail API credentials.\nOpenAI API Key: An API key from OpenAI to access GPT-4. Make sure to configure the OpenAI credentials in n8n.\n\nConfiguration Steps:\nEmail Trigger (IMAP) Node:\n   Provide your email server settings and credentials to monitor emails.\n\nHTTP Request Nodes for Fastmail: \n   Set up HTTP Header authentication in n8n using your Fastmail API credentials.\n   Replace the httpHeaderAuth credential IDs with your configured credential IDs.\n\nOpenAI Node:\n   Configure the OpenAI API key in n8n.\n   Replace the openAiApi credential ID with your configured credential ID.\n\nBy following these steps and setting up the necessary credentials, you can seamlessly automate the creation of email drafts in response to new emails using AI-generated content. This workflow helps improve productivity and ensures timely, personalized communication.",
  "totalViews": 2679,
  "source": "official",
  "user": {
    "id": 92004,
    "name": "Vitali",
    "username": "vquie",
    "bio": "",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/9547a27c5842ef984e096548285dc3d902bdecaad51c800b6f100a068a2fc9f0?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "OpenAI",
      "type": "@n8n/n8n-nodes-langchain.openAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Miscellaneous",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-09-28T18:34:51.274Z",
  "path": "official/template_2441/workflow.json"
}