{
  "id": 980,
  "name": "Load data into spreadsheet or database",
  "description": "This workflow is a generic example of how to load data from your workflow into a destination that stores tabular data. For example, a Google Sheets or Airtable sheet, a .CSV file, or any relational database like MySQL. \n\nGenerally, you need to ensure that you send well-formatted data into the Spreadsheet or Database node. You can use the Set or Function node to transform data into the correct format for your destination.\n\nKey concepts\nSpreadsheets and databases have columns, like \"Name\" and \"Email\". The data you send into a Spreadsheet/ Database node needs to match these column names for each row of data that you want to insert. Data points need to be represented as key-value pairs. Specifically, each item of data needs to have a JSON key for each column in the sheet. For a spreadsheet with \"Name\" and \"Email\" columns, it would look like: {\"Name\" : \"Karla\", \"Email\" : \"karla@email.com\"}\n\nBefore appending or inserting data to a spreadsheet or database, you might need to transform it into the correct format. You can preprocess the data with a Set or Function node. The Set node allows you to perform simple transforms when the data you want to load into spreadsheet rows is already represented as items. Use the Function node when you need to map nested data (like arrays) inside a single item to their own top-level items (Example in community forums).\nSpreadsheet and database nodes in n8n perform their configured action (like Append, Create Row, Write to File) on each item of input data. \n\nWorkflow walkthrough\n\n\n",
  "totalViews": 2955,
  "source": "official",
  "user": {
    "id": 3420,
    "name": "Max Tkacz",
    "username": "maxt",
    "bio": "Design @ n8n",
    "verified": true,
    "links": "[\"https://n8n.io\"]",
    "avatar": "https://gravatar.com/avatar/4eca9c29591ed5132a4c192e7447d9a42f5ae70f6ca2dbf89c15113e195a810b?r=pg&d=retro&size=200"
  },
  "categories": [],
  "nodes": [],
  "nodeCount": 0,
  "createdAt": "2021-03-11T11:20:25.787Z",
  "path": "official/template_980/workflow.json"
}