{
  "id": 2141,
  "name": "Add product ideas to Google Sheets via a Slack",
  "description": "Use Case\nThis workflow is a slight variation of a workflow we're using at n8n. In most companies, employees have a lot of great ideas. That was the same for us at n8n. We wanted to make it as easy as possible to allow everyone to add their ideas to some formatted database - it should be somewhere where everyone is all the time and could add a new idea without much extra effort. Since we're using Slack, this seemed to be the perfect place to easily add ideas. In this example, we're adding the ideas to Google Sheets instead of Notion, like we do.\nWhat this workflow does\nThis workflow waits for a webhook call within Slack, that gets fired when users use the /idea command on a bot that you will create as part of this template. It then checks the command, adds the idea to Google Sheets and notifies the user about the newly added idea as you can see below:\n\nCreating your Slack bot\nVisit https://api.slack.com/apps, click on New App and choose a name and workspace.\nClick on OAuth & Permissions and scroll down to Scopes -&gt; Bot token Scopes\nAdd the chat:write scope\nHead over to Slash Commands and click on Create New Command\nUse /idea as the command\nCopy the test URL from the Webhook node into Request URL\nAdd whatever feels best to the description and usage hint\nGo to Install app and click install\nSetup\nCreate a Google Sheets document with the columns Name and Creator\nAdd your Google credentials\nFill the Set me up node. \nCreate your Slack app (see other sticky)\nClick Test workflow and use the /idea comment in Slack\nActivate the workflow and exchange the Request URL with the production URL from the webhook\nHow to adjust it to your needs\nYou can adjust the table in Google Sheets and for example, add different types of ideas or areas that they impact\nRename the Slack command as it works best for you\nHow to enhance this workflow\nAt n8n we use this workflow in combination with some others. E.g. we have the following things on top:\nWe additionally have a /bug Slack command that adds a new bug to Linear. Here we're using AI to classify the bugs and move it to the right team. (Bug command workflow and Ai Classifier workflow)\nWe also added other types, like /pain to be less solution-driven\nTo make it easier for everyone to give input, we added a Votes column that allows everyone to vote on ideas/pain points in the list\nWe're also running a workflow once a week that highlights the most popular new ideas and the most active voters",
  "totalViews": 1109,
  "source": "official",
  "user": {
    "id": 91250,
    "name": "Niklas Hatje",
    "username": "nik8n",
    "bio": "Product Manager at n8n - Responsible for the creator program",
    "verified": true,
    "links": "[\"https://www.linkedin.com/in/niklashatje/\"]",
    "avatar": "https://gravatar.com/avatar/e16a4426e166713c34626bdde856b1cd15bb6787481a7ead9b74318f19e6259d?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-02-28T15:38:22.223Z",
  "path": "official/template_2141/workflow.json"
}