{
  "id": 3680,
  "name": "Query PostgreSQL Database with Natural Language Using Groq AI Chatbot",
  "description": "This guide shows you how to deploy a chatbot that lets you query your PostgreSQL database using natural language. You will build a system that accepts chat messages, retains conversation history, constructs dynamic SQL queries, and returns responses generated by an AI model. By following these instructions, you will have a working solution that integrates n8n’s AI Agent capabilities with PostgreSQL.\n\nPrerequisites\n\nBefore you begin, ensure that you have the following:\n\nAn active n8n instance (self-hosted or cloud) running version 1.50.0 or later.\nValid PostgreSQL credentials configured in n8n.\nAPI credentials for the Groq Chat Model (or your preferred AI language model).\nBasic familiarity with SQL (specifically PostgreSQL syntax) and n8n node concepts such as chat triggers and memory buffers.\nAccess to the n8n Docs on AI Agents for further reference.\n\nWorkflow Setup\n\nChat Interface & Trigger\n    When Chat Message Received: This node listens for incoming chat messages via a webhook. When a message arrives, it triggers the workflow immediately.\n\nConversation Memory\n    Chat History: This memory buffer node stores the last 10 interactions. It supplies conversation context to the AI Agent, ensuring that responses consider previous messages.\n\nAI Agent Core\n    AI Agent (Tools Agent): The AI Agent node orchestrates the conversation by receiving the chat input and conversation history. It dynamically generates PostgreSQL-compatible SQL queries based on your requests and coordinates calls to external tools (such as PostgreSQL nodes).\n\nDatabase Interactions\n    PostgreSQL Node (Query Execution): This node executes the SQL query generated by the AI Agent against your PostgreSQL database. You reference the query using an expression (e.g., {{$node[\"AI Agent\"].json.sql_query}}), allowing the agent’s output to control data retrieval.\n    PostgreSQL Node (Schema Retrieval): This node (or a dedicated step using the PostgreSQL node) retrieves a list of relevant tables from your PostgreSQL database (e.g., from the public schema, excluding system schemas like pg_catalog or information_schema). The agent uses this information to understand the available tables. This typically involves executing a query like SELECT table_name FROM information_schema.tables WHERE table_schema = 'public';.\n    PostgreSQL Node (Table Definition Retrieval): This node (or another dedicated step using the PostgreSQL node) fetches detailed metadata (such as column names, data types, and potentially relationships using foreign keys) for a specific table. The table name (and schema if necessary) is supplied dynamically by the AI Agent. This often involves querying information_schema.columns, e.g., SELECT column_name, data_type FROM information_schema.columns WHERE table_name = '{{dynamic_table_name}}' AND table_schema = 'public';.\n\nLanguage Model Processing\n    Groq Chat Model: This node connects to the Groq Chat API to generate text completions. It processes the combined input (chat message, context, and data fetched from PostgreSQL) and produces the final response.\n\nGuidance & Customization\n    Sticky Notes: These nodes provide guidance on:\n        Switching the chat model if you wish to use another provider (e.g., OpenAI or Anthropic).\n        Adjusting the maximum token count per interaction.\n        Customizing the SQL queries (ensuring PostgreSQL compatibility) and the context window size.\n    They help you modify the workflow to suit your environment and requirements.\n\nWorkflow Connections\n\nThe Chat Trigger passes the incoming message to the AI Agent.\nThe Chat History node supplies conversation context to the AI Agent.\nThe AI Agent calls the PostgreSQL nodes as external tools, generating and sending dynamic SQL queries.\nThe Groq Chat Model processes the consolidated input from the agent and outputs the natural language response delivered to the user.\n\nTesting the Workflow\n\nSend a chat message using the chat interface.\nObserve how the AI Agent processes the input and generates a corresponding PostgreSQL SQL query.\nVerify that the PostgreSQL nodes execute the query correctly against your database and return data.\nConfirm that the Groq Chat Model produces a coherent natural language response based on the query results.\nRefer to the sticky notes for guidance if you need to fine-tune any node settings or SQL queries.\n\nNext Steps and References\n\nCustomize Your AI Model:** Replace the Groq Chat Model with another language model (such as the OpenAI Chat Model) by updating the node credentials and configuration.\nEnhance Memory Settings:** Adjust the Chat History node’s context window to retain more or fewer messages based on your needs.\nModify SQL Queries:* Update the SQL queries within the *PostgreSQL* nodes or refine the prompts for the AI Agent to ensure they match your specific database schema and desired data, adhering to *PostgreSQL** syntax.\nFurther Reading:** Consult the n8n Docs on AI Agents for additional details and examples to expand your workflow’s capabilities.\nSet Up a Website Chatbot:** Copy & Paste and replace the placeholders in the following code to embed the chatbot into your personal or company’s website: View in CodePen 🡥\n\nBy following these steps, you will deploy a robust AI chatbot workflow that integrates with your PostgreSQL database, allowing you to query data using natural language.",
  "totalViews": 249,
  "source": "official",
  "user": {
    "id": 92718,
    "name": "Gegenfeld",
    "username": "gegenfeld",
    "bio": "We at Gegenfeld are an EdTech platform dedicated to delivering high-quality on-demand courses and interactive training sessions for professional development at all skill levels. With our commitment to \"Accelerate your future,\" we empower professionals to enhance their expertise through engaging, industry-focused learning experiences. On n8n, we share some of the workflows used in our interactive training to provide deeper insights and practical applications.",
    "verified": true,
    "links": "[\"https://gegenfeld.com\"]",
    "avatar": "https://gravatar.com/avatar/c8a1c789de3e9122a421139cc2d7dc9ab404dfb76ac84a17fa487e8f607ae9ab?r=pg&d=retro&size=200"
  },
  "categories": [
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Simple Memory",
      "type": "@n8n/n8n-nodes-langchain.memoryBufferWindow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Memory"
        ],
        "Memory": [
          "For beginners"
        ]
      }
    },
    {
      "name": "Groq Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatGroq",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2025-04-23T23:07:27.296Z",
  "path": "official/template_3680/workflow.json"
}