{
  "id": 3020,
  "name": "AI Linux system administrator for managing Linux VPS instance",
  "description": "This n8n workflow template is designed for developers, system administrators, and IT professionals who manage Linux VPS environments. It leverages an AI chatbot powered by the OpenAI model to interpret and execute SSH commands on a Linux VPS directly from chat messages. The workflow triggers when a specific chat message is received, which is then processed by the AI SysAdmin ReAct Agent to execute predefined SSH commands securely.\n\nHow It Works\nChat Trigger: The workflow starts when a chat message is received via a supported platform (like Slack, Telegram, etc.).\nAI Processing: The message is passed to the AI SysAdmin ReAct Agent, which uses an embedded OpenAI model to interpret the command and map it to a corresponding SSH action.\nCommand Execution: The interpreted command is securely executed on the target Linux VPS using SSH, with login credentials managed through a secure method embedded within the workflow.\n\nSetup Instructions\nImport the Workflow: Download and import the workflow into your n8n instance.\nConfigure Chat Integration: Set up the chat trigger node by connecting it to your preferred chat platform and configuring the trigger conditions.\nSet SSH Credentials: Securely input your SSH credentials in the designated SSH login credentials node.\nDeploy and Test: Deploy the workflow and perform tests to ensure that commands are executed correctly and securely on your VPS.\n\nEmbrace the future of VPS management with our AI-driven SysAdmin for Linux VPS template. This innovative solution transforms how system administrators interact with and manage their servers, offering a streamlined, secure, and efficient method to handle routine tasks through simple chat commands. With the power of AI at your fingertips, enhance your operational efficiency, reduce response times, and manage your Linux environments more effectively. Get started today to experience a smarter way to manage your systems directly through your chat tool.\n",
  "totalViews": 6417,
  "source": "official",
  "user": {
    "id": 92764,
    "name": "Hostinger",
    "username": "hostinger",
    "bio": "Hostinger aims to make online presence accessible to everyone worldwide – from developers to aspiring bloggers and business owners. With our fast hosting technology, AI-powered Website Builder, and easy-to-operate hPanel you can succeed online faster and easier.",
    "verified": true,
    "links": "[\"https://www.hostinger.com/vps/n8n-hosting\"]",
    "avatar": "https://gravatar.com/avatar/be87ae832a10297a42d8d92ade9b7b680e2e0cdd81c519603277b10956e46c86?r=pg&d=retro&size=200"
  },
  "categories": [
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Call n8n Workflow Tool",
      "type": "@n8n/n8n-nodes-langchain.toolWorkflow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Tools"
        ],
        "Tools": [
          "Recommended Tools"
        ]
      }
    },
    {
      "name": "HTTP Request Tool",
      "type": "@n8n/n8n-nodes-langchain.toolHttpRequest",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Tools"
        ],
        "Tools": [
          "Recommended Tools"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-02-26T08:41:17.448Z",
  "path": "official/template_3020/workflow.json"
}