{
  "id": 1841,
  "name": "Update HubSpot contacts with Zendesk tickets",
  "description": "\nThis workflow automatically syncs your Zendesk tickets to your HubSpot contacts. Every 5 minutes, your Zendesk account collects all the new or updated tickets and syncs them accordingly, with your HubSpot contacts database. \n\nPrerequisites\nZendesk account and Zendesk credentials\nHubSpot account and HubSpot credentials\n\nHow it works\nCron node triggers the workflow every 5 minutes.\nFunction Item node checks all the tickets received after the last execution timestamp.\nZendesk node collects all tickets updated after last execution.\nZendesk node collects the user data of ticket requester.\nSet node collects the contact`s email, name and externalID.\nMerge by key node combines two inputs, ticket data and ticket requester data.\nIf node splits the workflow conditionally, based on data received.\nIf the data corresponds to a ticket that already exists, HubSpot node will update the ticket.\nIf the data does not correspond to a ticket, HubSpot node creates/updates the contact.\nZendesk node updates the external Id in Zendesk for the said contact.\nHubSpot node creates a new ticket.\nZendesk node updates the ticket with the external Id.\nThe Function Item node sets the new last execution timestamp.\n",
  "totalViews": 708,
  "source": "official",
  "user": {
    "id": 39668,
    "name": "n8n Team",
    "username": "n8n-team",
    "bio": "Meet the official n8n team. We specialize in building workflows that transform intricate tasks into seamless operations.",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/b3d1a47322f05a8be3d2e7bad6a80c29161bd58b91e4762cbb3ac25e5d0db5a8?r=pg&d=retro&size=200"
  },
  "categories": [
    "Sales",
    "Communication"
  ],
  "nodes": [
    {
      "name": "HubSpot",
      "type": "n8n-nodes-base.hubspot",
      "categories": [
        "Sales"
      ],
      "subcategories": {}
    },
    {
      "name": "Zendesk",
      "type": "n8n-nodes-base.zendesk",
      "categories": [
        "Communication"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 2,
  "createdAt": "2022-12-23T11:05:16.234Z",
  "path": "official/template_1841/workflow.json"
}