{
  "id": 2525,
  "name": "Create Content from Form Inputs and Save it to Google Drive using AI",
  "description": "AI Content Generator Workflow\n\nIntroduction\nThis workflow automates the process of creating high-quality articles using AI, organizing them in Google Drive, and tracking their progress in Google Sheets. It's perfect for marketers, bloggers, and businesses looking to streamline content creation. With minimal setup, you can have a fully operational system to generate, save, and manage your articles in one cohesive workflow.\n\nHow It Works\nCollect Inputs: Users fill out a form with details like article title, keywords, and instructions.\nGenerate Content: AI creates an outline and writes the article based on user inputs.\nOrganize Files: Saves the outline and final article in Google Drive for easy access.\nTrack Progress: Updates Google Sheets with links to the generated content for tracking.\n\nSet Up Steps\nTime Required**: Approximately 15–20 minutes to connect all integrations and test the workflow.\nSteps**:\n  Connect Google Drive and Google Sheets: Authorize access to store files and update the spreadsheet.\n  Set Up OpenAI Integration: Add your OpenAI API key for generating the outline and article content.\n  Customize the Form: Modify the form fields to match the details you want to collect for each article.\n  Test the Workflow: Run the workflow with sample inputs to ensure everything works smoothly.\n\nThis workflow not only simplifies the process of article creation but also sets a foundation for expanding into additional automations, like posting to social media platforms.\n",
  "totalViews": 6861,
  "source": "official",
  "user": {
    "id": 91538,
    "name": "Francis Njenga",
    "username": "gatura",
    "bio": "E | gaturanjenga@gmail.com\n",
    "verified": true,
    "links": "[\"https://www.linkedin.com/in/francisgaturanjenga\"]",
    "avatar": "https://gravatar.com/avatar/84d3b247c7c1f6195b932c2d17bd7f91bada5ab204629cd1e6d13c3f348b1ca3?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "OpenAI",
      "type": "@n8n/n8n-nodes-langchain.openAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Miscellaneous",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2024-11-04T20:00:09.023Z",
  "path": "official/template_2525/workflow.json"
}