{
  "id": 2154,
  "name": "Classify new bugs in Linear with OpenAI's GPT-4 and move them to the right team",
  "description": "Use case\nWhen working with multiple teams, bugs must get in front of the right team as quickly as possible to be resolved. Normally this includes a manual grooming of new bugs that have arrived in your ticketing system (in our case Linear). We found this way too time-consuming. That's why we built this workflow.\n\nWhat this workflow does\nThis workflow triggers every time a Linear issue is created or updated within a certain team. For us at n8n, we created one general team called Engineering where all bugs get added in the beginning. The workflow then checks if the issue meets the criteria to be auto-moved to a certain team. In our case, that means that the description is filled, that it has the bug label, and that it's in the Triage state. The workflow then classifies the bug using OpenAI's GPT-4 model before updating the team property of the Linear issue. If the AI fails to classify a team, the workflow sends an alert to Slack.\n\nSetup\nAdd your Linear and OpenAi credentials\nChange the team in the Linear Trigger to match your needs\nCustomize your teams and their areas of responsibility in the Set me up node. Please use the format Teamname. Also, make sure that the team names match the names in Linear exactly.\nChange the Slack channel in the Set me up node to your Slack channel of choice.\n\nHow to adjust it to your needs\nPlay around with the context that you're giving to OpenAI, to make sure the model has enough knowledge about your teams and their areas of responsibility\nAdjust the handling of AI failures to your needs\n\nHow to enhance this workflow\nAt n8n we use this workflow in combination with some others. E.g. we have the following things on top:\nWe're using an automation that enables everyone to add new bugs easily with the right data via a /bug command in Slack (check out this template if that's interesting to you)\n\nThis workflow was built using n8n version 1.30.0\n",
  "totalViews": 1448,
  "source": "official",
  "user": {
    "id": 91250,
    "name": "Niklas Hatje",
    "username": "nik8n",
    "bio": "Product Manager at n8n - Responsible for the creator program",
    "verified": true,
    "links": "[\"https://www.linkedin.com/in/niklashatje/\"]",
    "avatar": "https://gravatar.com/avatar/e16a4426e166713c34626bdde856b1cd15bb6787481a7ead9b74318f19e6259d?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Communication",
    "HITL",
    "Productivity",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Slack",
      "type": "n8n-nodes-base.slack",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "Linear",
      "type": "n8n-nodes-base.linear",
      "categories": [
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "OpenAI",
      "type": "@n8n/n8n-nodes-langchain.openAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Miscellaneous",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2024-02-29T18:27:31.406Z",
  "path": "official/template_2154/workflow.json"
}