{
  "id": 2740,
  "name": "Basic Automatic Gmail Email Labelling with OpenAI and Gmail API",
  "description": "Description\nThis workflow automates email categorization in Gmail using the Gmail API and OpenAI's language model. It periodically checks for new emails, reads their content, and categorizes them based on existing Gmail labels. If no matching label is found, the workflow creates a new label and assigns it to the email.\n\nKey Features\nPolling for Emails**: The workflow triggers every 5 minutes to check for new emails using the Gmail Trigger node.\nReading Labels**: Existing Gmail labels are fetched to determine the most relevant match for email categorization.\nDynamic Labeling**: If no existing label matches, a new label is created dynamically based on the email's content.\nOpenAI Integration**: The workflow uses OpenAI's Chat model to analyze email content and suggest or create appropriate labels.\nEmail Categorization**: Labels are applied to emails, ensuring they are organized in Gmail's structure. The workflow also removes less relevant emails (e.g., ads) from the inbox.\n\nNodes in Use\nGmail Trigger: Polls Gmail every 5 minutes for new emails.\nGmail - Read Labels: Fetches all existing Gmail labels.\nGmail - Get Message: Retrieves the full content of a specific email.\nGmail - Add Label to Message: Assigns a chosen label to the email.\nGmail - Create Label: Creates a new label if necessary.\nOpenAI Chat Model: Analyzes email content for categorization.\nMemory Buffer: Retains context for email analysis across multiple iterations.\nWait Node: Adds a buffer period to manage email processing.\n\nPrerequisites\nGmail API Setup**: Ensure Gmail OAuth2 credentials are configured in n8n.\nOpenAI API Key**: Configure OpenAI credentials for email analysis.\nLabeling Standards**: Maintain a consistent Gmail label structure for better organization.\n\nInstructions\nAdd your Gmail API credentials to the Gmail nodes.\nAdd your OpenAI API credentials to the OpenAI Chat Model node.\nActivate the workflow. It will start polling for new emails every 5 minutes.\nMonitor and refine the categorization logic if necessary to ensure alignment with Gmail's organizational needs.\n\nUse Case\nIdeal for individuals or teams handling high email volumes who want to maintain an organized inbox and automate repetitive categorization tasks.\n\nNote: You can improve the prompt to get better results from the agent by giving it more personal rules on how to categorize.",
  "totalViews": 10703,
  "source": "official",
  "user": {
    "id": 92465,
    "name": "Martijn Kerver",
    "username": "mkc",
    "bio": "",
    "verified": false,
    "links": "[]",
    "avatar": "https://gravatar.com/avatar/fe72c50f0c4d39bbfa48922c6996bdb1536d6dfefa73ec881562587bb49fae50?r=pg&d=retro&size=200"
  },
  "categories": [
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Simple Memory",
      "type": "@n8n/n8n-nodes-langchain.memoryBufferWindow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Memory"
        ],
        "Memory": [
          "For beginners"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2025-01-17T08:51:32.434Z",
  "path": "official/template_2740/workflow.json"
}