{
  "id": 3145,
  "name": "Replace Data in Google Docs from n8n Form",
  "description": "Who is this for?\nThis workflow is perfect for anyone looking to automate the process of replacing variables in Google Docs with data from form.\n\nWhat problem does this workflow solve?\nThis workflow automates the process of filling Google Docs templates with data coming from n8n forms or other variables. It’s especially useful for generating documents like contracts, invoices, or reports quickly and efficiently without manual intervention.\n\nWhat does this workflow do?\nThe workflow receives data from a form in n8n.\nIt uses the form data to replace the corresponding variables (e.g., {{example_variable}}) in a Google Docs template.\nThe document is then generated with the new values, ready for further use, such as sending or archiving.\n\nHow to set up this workflow?\nPrepare the template: Create a Google Docs template with variables in the {{variable}} format that you want to replace with form data.\nModify the variables in the n8n form: Make sure the form fields correspond to the variables you want to replace in the Google Docs template.\nConnect to Google Docs: Set up the connection to Google Docs in n8n using the appropriate authentication credentials.\nTest the workflow: Run the workflow to ensure that the form data correctly replaces the variables in the Google Docs template.\n\nHow to customize this workflow to your needs?\nChange the data source: You can modify the form or other data sources (e.g., API) from which the replacement values will be fetched.\nCustomize the Google Docs template: Adapt the template to include additional fields for replacement as needed.\nIntegrate with other applications: You can expand the workflow to include actions like sending the generated document via email, saving it to Google Drive, or passing it to other systems.\n\n",
  "totalViews": 4692,
  "source": "official",
  "user": {
    "id": 93182,
    "name": "Krzysztof Kuzara",
    "username": "kuzry",
    "bio": "I am a backend developer with over 10 years of experience, specializing in business process automation and system integrations. I use n8n to streamline workflows, build APIs, and automate operations in companies.",
    "verified": false,
    "links": "[\"https://www.linkedin.com/in/krzysztof-kuzara/\"]",
    "avatar": "https://gravatar.com/avatar/e4f9782c9d388546a55424e85901cf20088c355099afe27c36f40dc3a483413a?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Data & Storage"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2025-03-12T09:40:21.246Z",
  "path": "official/template_3145/workflow.json"
}