{
  "id": 3862,
  "name": "Automate Research-Based Newsletters with Perplexity, GPT-4, and Image Generation",
  "description": "This n8n workflow automates the process of creating and sending high-quality newsletters with images generated by a GPT image generator. It is triggered on a schedule.\n\nWhat is included?\n\n1 n8n workflow (json)\n1 Setup tutorial doc\n1 video guidance on how to connect n8n with all Google products\n1 video guidance on how to connect n8n with Google Cloud Storage\n\nWho is this for?\n\nThis template is ideal for:\n\nContent creators looking to automate their newsletter process.\nMarketers seeking to efficiently produce engaging newsletters with AI-generated content and imagery.\nAnyone wanting to create and send personalized newsletters on a schedule.\n\nWhat problem is this workflow solving?\n\nManually creating and sending newsletters can be time-consuming, especially when including relevant and engaging content and imagery. This workflow automates the content generation (using AI and web search), image creation, and sending process, freeing up time and ensuring consistent communication with clients.\n\nWhat this workflow does:\n\nThis workflow automates the following steps:\n\nScheduled Trigger: The workflow is triggered automatically on a predefined schedule.\n\nGet Newsletter Topic: Retrieves the first unpublished newsletter topic from a Google Sheet titled \"Newsletter Topics\". It then updates the status of this topic and records the publication date to avoid duplication in future runs.\n\nAI Newsletter & Image Generator: This is the core content creation step. It uses an AI agent (configured with OpenAI and Perplexity APIs) to generate an engaging newsletter and a detailed, ultra-realistic image prompt based on the selected topic and real-time web research.\n\nGPT Image Generation: Uses the OpenAI API to generate an image based on the detailed image prompt created in the previous step.\n\nGet Client List: Retrieves client names and email addresses from a Google Sheet titled \"Clients\".\n\nSend Newsletter: Sends the personalized newsletter via Gmail to each client on the list, including the AI-generated title, content, and the uploaded image. The email body HTML is customizable.\n\nSetup:\n\nConfigure the workflow's run frequency within the \"Schedule Trigger\" node.\n\nCreate a Google Sheet named \"Newsletter Topics\" and \"Clients\"  in your Google Drive.\n\nEnter your OpenAI and Perplexity  API key in the 'Input' node.\n\nConnect your Gmail account to the \"SendNewsletter\" node.\n\nHow to customize this workflow:\n\nAdjust the prompt for your newsletter style in the \"AI Agent\" node.\n\nAdjust the Email Body HTML for your newsletter style in the \"SendNewsletter\" node.\n\nOptionally, enable the \"Tavily WebSearch\" node and configure it if you prefer to use Tavily instead of Perplexity for web search.\n\nCategory:\n\nMarketing, Content Creation, Automation",
  "totalViews": 150,
  "source": "official",
  "user": {
    "id": 92701,
    "name": "Tianyi",
    "username": "muzi",
    "bio": "Ph.D. in Machine Learning from the University of Toulouse.\nExperienced automation consultant specializing in optimizing workflows for Content creation and Marketing teams. ",
    "verified": true,
    "links": "[\"www.linkedin.com/in/tianyi-li-v\"]",
    "avatar": "https://gravatar.com/avatar/43163225998120af2d88664551ec779ceb7518ef30b5a6c27f81649a0fb641d0?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes",
    "Communication",
    "HITL",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Gmail",
      "type": "n8n-nodes-base.gmail",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "Google Cloud Storage",
      "type": "n8n-nodes-base.googleCloudStorage",
      "categories": [
        "Development",
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Structured Output Parser",
      "type": "@n8n/n8n-nodes-langchain.outputParserStructured",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Output Parsers"
        ]
      }
    }
  ],
  "nodeCount": 7,
  "createdAt": "2025-05-04T15:35:27.620Z",
  "path": "official/template_3862/workflow.json"
}