{
  "id": 3047,
  "name": "Namesilo Bulk Domain Availability Checker",
  "description": "Introduction\nThe namesilo Bulk Domain Availability workflow is a powerful automation solution designed to check the registration status of multiple domains simultaneously using the Namesilo API. \n\nThis workflow efficiently processes large lists of domains by splitting them into manageable batches, adhering to API rate limits, and compiling the results into a convenient Excel spreadsheet. \n\nIt eliminates the tedious process of manually checking domains one by one, saving significant time for domain investors, web developers, and digital marketers. The workflow is particularly valuable during brainstorming sessions for new projects, when conducting domain portfolio audits, or when preparing domain acquisition strategies. \n\nBy automating the domain availability check process, users can quickly identify available domains for registration without the hassle of navigating through multiple web interfaces.\n\nWho is this for?\nThis workflow is ideal for:\nDomain investors and flippers who need to check multiple domains quickly\nWeb developers and agencies evaluating domain options for client projects\nDigital marketers researching domain availability for campaigns\nBusiness owners exploring domain options for new ventures\nIT professionals managing domain portfolios\n\nUsers should have basic familiarity with n8n workflow concepts and a Namesilo account to obtain an API key. No coding knowledge is required, though understanding of domain name systems would be beneficial.\n\nWhat problem is this workflow solving?\nChecking domain availability one-by-one is a time-consuming and tedious process, especially when dealing with dozens or hundreds of potential domains. This workflow solves several key challenges:\n\nManual Inefficiency: Eliminates the need to individually search for each domain through registrar websites.\nRate Limiting: Handles API rate limits automatically with built-in waiting periods.\nData Organization: Compiles availability results into a structured Excel file rather than scattered notes or multiple browser tabs.\nBulk Processing: Processes up to 200 domains per batch, with the ability to handle unlimited domains across multiple batches.\nTime Management: Frees up valuable time that would otherwise be spent on repetitive manual checks.\n\nWhat this workflow does\nOverview\nThe workflow takes a list of domains, processes them in batches of up to 200 domains per request (to comply with API limitations), checks their availability using the Namesilo API, and compiles the results into an Excel spreadsheet showing which domains are available for registration and which are already taken.\n\nProcess\nInput Setup: The workflow begins with a manual trigger and uses the \"Set Data\" node to collect the list of domains to check and your Namesilo API key.\nDomain Processing: The \"Convert & Split Domains\" node transforms the input list into batches of up to 200 domains to comply with API limitations.\nBatch Processing: The workflow loops through each batch of domains.\nAPI Integration: For each batch, the \"Namesilo Requests\" node sends a request to the Namesilo API to check domain availability.\nData Parsing: The \"Parse Data\" node processes the API response, extracting information about which domains are available and which are taken.\nRate Limit Management: A 5-minute wait period is enforced between batches to respect Namesilo's API rate limits.\nData Compilation: The \"Merge Results\" node combines all the availability data.\nOutput Generation: Finally, the \"Convert to Excel\" node creates an Excel file with two columns: Domain and Availability (showing \"Available\" or \"Unavailable\" for each domain).\n\nSetup\nImport the workflow: Download the workflow JSON file and import it into your n8n instance.\nGet Namesilo API key: Create a free account at Namesilo and obtain your API key from https://www.namesilo.com/account/api-manager\nConfigure the workflow:\n   Open the \"Set Data\" node\n   Enter your Namesilo API key in the \"Namesilo API Key\" field\n   Enter your list of domains (one per line) in the \"Domains\" field\nSave and activate: Save the workflow and run it using the manual trigger.\n\nHow to customize this workflow to your needs\nModify domain input format**: You can adjust the code in the \"Convert & Split Domains\" node if your domain list comes in a different format.\nChange batch size**: If needed, you can modify the batch size (currently set to 200) in the \"Convert & Split Domains\" node to accommodate different API limitations.\nAdjust wait time**: If you have a premium API account with different rate limits, you can modify the wait time in the \"Wait\" node.\nEnhance output format**: Customize the \"Convert to Excel\" node to add additional columns or formatting to the output file.\nAdd domain filtering**: You could add a node before the API request to filter domains based on specific criteria (length, keywords, TLDs).\nIntegrate with other services**: Connect this workflow to domain registrars to automatically register available domains that meet your criteria.",
  "totalViews": 427,
  "source": "official",
  "user": {
    "id": 92212,
    "name": "n8n custom workflows",
    "username": "n8ncustomworkflows",
    "bio": "This profile has been moved to https://n8n.io/creators/customworkflowsai",
    "verified": false,
    "links": "[\"https://customworkflows.ai\"]",
    "avatar": "https://gravatar.com/avatar/984585d8041207e3b283727d2c4cd956b8e1e844be6c0135dd4258d4a8f43773?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2025-02-28T19:54:11.721Z",
  "path": "official/template_3047/workflow.json"
}