{
  "id": 3041,
  "name": "WordPress Auto-Blogging Pro - with DEEP RESEARCH - Content Automation Machine",
  "description": "The best content automation template in the market is now even better—with “deep research” on time-sensitive topics\\! Unlike most n8n content automation templates that are mainly for “demo purposes,” this advanced n8n workflow is for the real PROs. It conducts in-depth research on the latest information about a topic, then automatically creates and publishes SEO-optimized blog posts to your WordPress website. In addition, it generates a unique image for each chapter and a featured image for the overall article, and it collects internal website links—seamlessly inserting links throughout each chapter and the entire article. Furthermore, it backs up all content and images to a designated folder in your Google Drive.\n\nThis integrated approach not only creates high-quality, comprehensive content for readers but also enhances on-page SEO, improves navigation, and streamlines your content creation process—saving you time while ensuring your work is securely stored.\n\nThis is a complimentary variation of the n8n WordPress Auto-Blogging Pro for SEO topics. That one specializes in auto-blogging content about established topics that do not need up-to-date information while this one takes it further by incorporating online research into the workflow. Both make up the perfect combo to run your blog on autopilot\\!\n\nHow It Works\n\nTrigger: It activates upon adding a new row to a Google Sheet. Users can control many customizable parameters, such as key topic, number of subtopics, target audience, length, and style.  \nInitial Research: The workflow initiates preliminary research on the topic to gather insights for the content planning phase.  \nStructure Planning: Based on the initial research, it plans a detailed structure for the entire article and breaks the article into subtopics strongly tied to the main topic.  \nIn-Depth Research & Writing: For each subtopic, it conducts further research to gather the most up-to-date, relevant information, then uses that research to write each chapter in depth.  \nImage Generation: It generates and adds images for each chapter, as well as a featured image for the article.  \nInternal Linking: The system gathers internal website links and strategically embeds them within each chapter and throughout the article, boosting SEO and enhancing user navigation.  \nFinal Assembly & Publishing: All texts, images, and links are combined into one comprehensive article, which is then published directly to your WordPress website. You can also choose to post it as a draft for final review.  \nAuto Backup to Drive: Get peace of mind knowing all content (blog post and images) is automatically saved to Google Drive, organized in a folder named after the blog post title.\n\nUnique Features\n\nDeep Research: The workflow leverages advanced, real-time research to gather the latest information about a topic. It breaks down the key topic into subtopics and conducts in-depth research on each one, ensuring the most comprehensive and current knowledge.  \nFull Automation: Designed to be 100% automated, the workflow runs without manual intervention once imported and configured.  \nSimple Activation: It is easily triggered through the Google Sheets interface—simply add a new row to a Google Sheet.  \nCustomization Options: Offers a wide array of options, including topic, category, target audience, word count, number of chapters, length of introduction and conclusion, and writing style. It also allows for the inclusion of calls-to-action (CTAs) and company/product introductions.  \nAdvanced Loop in Loop: Clever looping is used to write each chapter and generate images, ensuring optimal results. “Wait” nodes are added where appropriate to avoid API call rate limits.  \nAutomatic Content Saving: After the blog post is created, all content and images are automatically saved to Google Drive, preventing data loss. The folder is named after the blog post title.  \nSEO-Optimized Content: It is designed to create SEO-optimized content using seed keywords.  \nInternal Link Limit: The workflow limits the number of internal links to 20 by default.  \nError Catch: “If” nodes are strategically used to ensure that the output from AI nodes strictly meets the JSON schema, ensuring a smooth flow of data without interruption.\n\nAnd many more big and small improvements.\n\nRequirements\n\nPlease make sure you have these requirements ready to ensure smooth deployment of this n8n workflow template:\n\nOpenAI API or equivalent for text and image generation  \nPerplexityAI API or equivalent for online research  \nA WordPress website (other website platforms will not work\\!)  \nGoogle Sheets for triggering the workflow, or a trigger of your choice  \nGoogle Drive and Google Docs for auto backup\n\nSet Up Steps\n\nInstall the Workflow Template: Import the JSON files into your n8n instance. There are 2 files: one for the main workflow and one for the research tool (PerplexityAI).  \nConnect the Workflow with Your Accounts: Link your accounts for OpenAI API, PerplexityAI API, Google Drive, Google Sheets, Google Docs, and WordPress website.  \nConfigure the Google Sheet: Ensure your Google Sheet is set up to trigger the workflow upon adding a new row and that the input data is correctly formatted.  \nCustomize the Inputs: Adjust parameters like topic, target audience, and writing style to match your specific content needs. Optimize prompts for the best results.  \nTest the Workflow: Use low-cost AI models and image settings initially to ensure everything runs smoothly.  \nTailor Further as Needed:  Modify workflow elements to perfectly align with your needs and content strategy.\n\nTips for PROs\n\nImage Generation: The default AI model for image generation is OpenAI’s Dall-E. However, the outputs of this model are not impressive. Consider using FLUX.1 for better image quality.  \nResearch: PerplexityAI is the tool of choice for research. The default model used in this workflow is “sonar” due to its fast speed and low cost. Feel free to experiment with its other models, including the “sonar-deep-research” model, which is dedicated to deep research.  \nTriggering: Triggering with a new row on Google Sheets is limited and unreliable. Consider setting an auto trigger with a daily schedule at a specific time. You can even put the whole workflow in a loop to process multiple rows one-by-one from Google Sheets.  \nHuman in the Loop: It is possible to incorporate a human review process. For example, after the article is posted to WordPress as a draft, a human can review the draft. Only after approval will the post be published, and a final copy of the post will be saved to the shared Drive folder.",
  "totalViews": 3151,
  "source": "official",
  "user": {
    "id": 92741,
    "name": "Daniel Ng",
    "username": "danielng",
    "bio": "A Growth Hacker, Digital Marketer & AI Automation Builder with 10+ years of experience in Digital Marketing & Workflow Automation. Based in Helsinki, Finland. For questions about my templates and customization, contact me at: daniel@aiautomationpro.org",
    "verified": true,
    "links": "[\"https://aiautomationpro.org/\"]",
    "avatar": "https://gravatar.com/avatar/7e5e8e658b30fd9740edb159e9120a88edf324d14e7115e2229cf6876f2253a3?r=pg&d=retro&size=200"
  },
  "categories": [
    "Marketing",
    "Core Nodes",
    "Development",
    "Data & Storage",
    "Miscellaneous",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Edit Image",
      "type": "n8n-nodes-base.editImage",
      "categories": [
        "Marketing",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Files",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "Wordpress",
      "type": "n8n-nodes-base.wordpress",
      "categories": [
        "Marketing"
      ],
      "subcategories": {}
    },
    {
      "name": "Google Docs",
      "type": "n8n-nodes-base.googleDocs",
      "categories": [
        "Miscellaneous"
      ],
      "subcategories": {}
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "AI Agent",
      "type": "@n8n/n8n-nodes-langchain.agent",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Basic LLM Chain",
      "type": "@n8n/n8n-nodes-langchain.chainLlm",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Structured Output Parser",
      "type": "@n8n/n8n-nodes-langchain.outputParserStructured",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Output Parsers"
        ]
      }
    },
    {
      "name": "Call n8n Workflow Tool",
      "type": "@n8n/n8n-nodes-langchain.toolWorkflow",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Tools"
        ],
        "Tools": [
          "Recommended Tools"
        ]
      }
    },
    {
      "name": "OpenAI",
      "type": "@n8n/n8n-nodes-langchain.openAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Agents",
          "Miscellaneous",
          "Root Nodes"
        ]
      }
    }
  ],
  "nodeCount": 12,
  "createdAt": "2025-02-28T12:04:36.993Z",
  "path": "official/template_3041/workflow.json"
}