{
  "id": 3077,
  "name": "Create Daily YouTube Playlist, using Google Sheets, and get notified in Telegram",
  "description": "  Are you a cord-cutter? Do you find yourself looking through the many titles of videos uploaded to Youtube, just to find the ones you want to watch?  Even when you subscribe to the channels you like, do you find that you want to watch the news now and my tech/n8n videos later?  Well, now you can have n8n grab the last 8 videos, posted in the last 24 hours, and put them in a playlist for the day; and, each day the old playlist is deleted.\n\n   Are you tired of a channel filling your subscriptions with tons of videos a day; this workflow can be used for any channel, whether you are subscribed to the channel or not.  It's a YouTube playlist automation.\n\nHow it works:\n  Create your list of prefered Youtube Channels in a Google Sheet and it will create you a daily playlist; and, it will delete the playlist created yesterday.\n\nInstructions\nTo set this up, you need to create a Google Sheet with the following headings in line 1:\n\n   Channel User Name\n   Channel Name\n   Channel Link\n   Channel ID\n\nCopy the 'Create your Channel List' into it's own workflow and link the Sheets links to your new sheet.\n\nTo get the 'Create your Channel List' to work, you need to visit each channel's page that you want included in your playlist; you need to get the \"@\" name of the channel and add it to the 'Channel User Name' column of your Google Sheet.\n\n   For example: if you wanted to include this channel: Recruit Training Videos - Corporal Stock, you would search for the name, to add to the next available row of the 'Channel User Name' column: @CorporalStock\n\nOnce you add all Channel User Names, run the 'Create your Channel list workflow, and it will fill in the remaining details.\n\nNow the 'YT Playlist Creator' can be run. Note: The first time the workflow us run, disconnect the 'Delete Yesterday's Playlist' leg, or the workflow will error and stop (because there is no 'Yesterday's Playlist'.\n\nNote: this was made to create a playlist every day, delete yesterday's playlist, and only get the last 8 videos posted within the last 24 hours.  I choose to put the date (YYMMDD format) in front of the playlist, to ensure that it doesn't conflict with another playlist.\n\n   Also, I have it notifying me in Telegram, so I know that the new playlist is posted.\n",
  "totalViews": 1126,
  "source": "official",
  "user": {
    "id": 93053,
    "name": "Dustin",
    "username": "qrnan",
    "bio": "",
    "verified": false,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/99d8c1104197ff7c022102af604759839ca07cc538dea351e673f4c84c98e985?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes",
    "Communication",
    "HITL",
    "Marketing"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Telegram",
      "type": "n8n-nodes-base.telegram",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "YouTube",
      "type": "n8n-nodes-base.youTube",
      "categories": [
        "Marketing"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-03-04T13:41:34.407Z",
  "path": "official/template_3077/workflow.json"
}