{
  "id": 2524,
  "name": "Monitor if a page is alive and notify via Twilio SMS if not",
  "description": "Workflow Purpose\n\nThis workflow periodically checks a service's availability and sends an SMS notification if the service is down.\n\nHigh-Level Steps\n\nSchedule Trigger: The workflow is triggered at a specified interval, such as every minute.\nHTTP Request: An HTTP request is sent to the URL of the service being monitored.\nIf: The HTTP status code of the response is checked.\nIf the status code is 200 (OK), the workflow ends.\nIf the status code is not 200, indicating a potential issue, an SMS notification is sent using Twilio.\n\nSetup\nSetting up this workflow is relatively straightforward and should only take a few minutes:\n\nCreate a new n8n workflow.\nAdd the nodes: Schedule Trigger, HTTP Request, If, and Twilio.\nConfigure the nodes:\nSchedule Trigger: Specify the desired interval.\nHTTP Request: Enter the URL of the service to be monitored.\nIf: Set the condition to check for a status code other than 200.\nTwilio: Enter the Twilio account credentials and the phone numbers for sending and receiving the SMS notification.\nConnect the nodes: Connect the nodes as shown in the workflow diagram.\nActivate the workflow: Save the workflow and activate it.\n\nAdditional Notes\n\nThe workflow can be customized by changing the interval, the URL, the Twilio credentials, and the SMS message.\nThis workflow is a simple example, and more complex workflows can be created to meet specific needs.",
  "totalViews": 2432,
  "source": "official",
  "user": {
    "id": 92129,
    "name": "Rui Borges",
    "username": "rpb-dev",
    "bio": "",
    "verified": false,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/258a57aa3d07da2218c4702cf3d8c5bc6dac3c9adad6af696ee94f6849b86e7e?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Communication"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Twilio",
      "type": "n8n-nodes-base.twilio",
      "categories": [
        "Communication",
        "Development"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-11-04T14:33:26.382Z",
  "path": "official/template_2524/workflow.json"
}