{
  "id": 3868,
  "name": "Automate Support Ticket Triage and Resolution with JIRA and AI",
  "description": "This n8n template automates triaging of newly opened support tickets and issue resolution via JIRA.\n\nIf your organisation deals with a large number of support requests daily, automating triaging is a great use-case for introducing AI to your support teams. Extending the idea, we can also get AI to give a first attempt at resolving the issue intelligently.\n\nHow it works\nA scheduled trigger picks up newly opened JIRA support tickets from the queue and discards any seen before.\nAn AI agent analyses the open ticket to add labels, priority on the seriousness of the issue and simplifies the description for better readability and understanding for human support.\nNext, the agent attempts to address and resolve the issue by finding similar issues (by tags) which have been resolved.\nEach similar issue has its comments analysed and summarised to identify the actual resolution and facts.\nThese summarises are then used as context for the AI agent to suggest a fix to the open ticket.\n\nHow to use\nSimply connect your JIRA instance to the workflow and activate to start watching for open tickets. Depending on frequency, you may need to increase for decrease the intervals.\nDefine labels to use in the agent's system prompt.\nRestrict to certain projects or issue types to suit your organisation.\n\nRequirements\nJIRA for issue management and support portal\nOpenAI for LLM\n\nCustomising this workflow\nNot using JIRA? Try swapping out the nodes for Linear or your issue management system of choice.\nTry a different approach for issue resolution. You might want to try RAG approach where a knowledge base is used.\n",
  "totalViews": 549,
  "source": "official",
  "user": {
    "id": 91804,
    "name": "Jimleuk",
    "username": "jimleuk",
    "bio": "Freelance consultant based in the UK specialising in AI-powered automations. I work with select clients tackling their most challenging projects. For business enquiries, send me an email at hello@jimle.uk\n\nLinkedIn: https://www.linkedin.com/in/jimleuk/\nX/Twitter: https://x.com/jimle_uk",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/4ab99e51473df76838beeaac908747f7928c625f869794815cabe34016967d51?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Productivity",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "Jira Software",
      "type": "n8n-nodes-base.jira",
      "categories": [
        "Development",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "Basic LLM Chain",
      "type": "@n8n/n8n-nodes-langchain.chainLlm",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "OpenAI Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatOpenAi",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    },
    {
      "name": "Structured Output Parser",
      "type": "@n8n/n8n-nodes-langchain.outputParserStructured",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Output Parsers"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2025-05-05T10:29:45.614Z",
  "path": "official/template_3868/workflow.json"
}