{
  "id": 3559,
  "name": "Automated Workflow Backup System with Google Drive and Archiving",
  "description": "\nIf you have any question, or difficulty, feel free to come discuss about it on my Telegram (you might find something there 🎁)\n\n\n\nThis workflow provides a fully automated system for backing up your n8n workflows to Google Drive. It runs on a schedule (which you can customize) and saves each workflow as a .json file, named after the workflow itself. All active workflows are backed up by default and stored in a specified Google Drive folder of your choice.\n\nA special feature of this workflow is its ability to archive and clean up old workflows. If you tag a workflow with ARCHIVE (case-sensitive), the workflow will be backed up into a designated Archive subfolder inside your main Google Drive folder — and then automatically deleted from your n8n instance. This keeps your workspace clean and reduces clutter while ensuring everything is safely stored.\n\nRequirements\n\nA Google Drive account connected to n8n (via OAuth2 or preferred method)\nAn n8n instance with access to your workflows\nA folder in Google Drive for storing backups\n  Inside this folder, create a subfolder named Archive\nFolder IDs for both the main and archive folders* (Find it in folder's URL e.g. https://drive.google.com/drive/u/0/folders/1F7Exr2xkZQFvmHmjdFD43K0jfd*)\n\nSetup\n\nIn your Google Drive, create a main folder for storing backups.\nInside it, create a subfolder called Archive.\nRetrieve the folder IDs for both folders\nIn n8n, connect your Google Drive credentials.\nOpen the workflow and insert the folder IDs in the appropriate nodes.\nOptionally, edit the schedule trigger to set your preferred backup frequency.\n\nUsage\n\nOnce configured, the workflow will:\nRun automatically on the defined schedule\nBack up all existing workflows into your Drive\nFor workflows tagged with ARCHIVE:\n  Save them into the Archive subfolder\n  Delete them from your n8n instance\n\nThe workflow ensures your automation logic is safely versioned, with optional cleanup for outdated or unused flows.\n\nCustomization\n\nYou can modify the schedule to run daily, weekly, or at any custom interval using the built-in Cron node.\n\nYou can also change the folder structure or naming conventions in the Google Drive nodes to match your personal or team preferences.\n\nWorkflows are archived only if they are explicitly tagged with ARCHIVE — this tag is case-sensitive.",
  "totalViews": 225,
  "source": "official",
  "user": {
    "id": 93650,
    "name": "Niten Musa",
    "username": "nitenmusa",
    "bio": "Just like every business has its own processes, every business will have its own AI agents — I sell and teach that transition\n\nFrom France 🇫🇷 — Discipline, Humility, Benevolence",
    "verified": true,
    "links": "[\"https://www.bonzai.pro/niten-musa\"]",
    "avatar": "https://gravatar.com/avatar/7c12ff05ad25ca88cd977720280c51c995d53c91fe572a7a90a6b5a4b8660118?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage"
  ],
  "nodes": [
    {
      "name": "Google Drive",
      "type": "n8n-nodes-base.googleDrive",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 1,
  "createdAt": "2025-04-15T09:32:46.476Z",
  "path": "official/template_3559/workflow.json"
}