{
  "id": 2071,
  "name": "Upload Bulk Records from CSV - Airtable Interfaces",
  "description": "This workflow is a supporting automation to a common Airtable situation, that as of this writing, has no direct solution but has great demand.\n\nInterfaces are your secret weapon for managing a variety of tasks – from sales funnels and task tracking to creating dynamic dashboards. But here's a common situation: how do you efficiently bulk upload records (like contacts, leads, or clients) from an interface with just a click? Once set up, you'll be able to upload CSV files directly to your tables from the Interfaces with ease.\n\n\nWorkflow Key Points:\n\n1. Bulk Upload Functionality: Say goodbye to the limitations of standard Airtable interfaces. Now, you can upload multiple leads or contacts simultaneously, making your work swift and efficient.\n2. Customizable Fields: Tailor the base to meet your specific data needs. This ensures seamless integration with your existing systems and simplifies data management.\n​\nPerfect for teams in e-commerce, CRM, or any sector where managing a high volume of leads or contacts is key. Our Airtable Base is designed to eliminate the tediousness of importing contacts. It makes large-scale data management straightforward, saving you precious time and hassle.\n\n​\n\nGet ready to streamline your operations and boost your productivity! 🚀💡",
  "totalViews": 1544,
  "source": "official",
  "user": {
    "id": 91312,
    "name": "Sidetool",
    "username": "sidetool",
    "bio": "",
    "verified": false,
    "links": "[\"https://sidetool.co/\"]",
    "avatar": "https://gravatar.com/avatar/9bdaae888e401658cfd8d2aca7e66a876189588345b60a4a882992229d8a9eb7?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Airtable",
      "type": "n8n-nodes-base.airtable",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-01-29T21:33:25.829Z",
  "path": "official/template_2071/workflow.json"
}