{
  "id": 2663,
  "name": "YouTube Report Generator",
  "description": "YouTube Subtitles Report Generator\n\nOverview\n\nThis template enables users to generate analytical reports from YouTube video subtitles, providing insights into the thematic content of the video. Designed for efficiency and simplicity, it processes video subtitles without requiring an API key, making it an accessible solution for content analysis. The system assumes videos already have subtitles available, excluding live streams and videos without subtitle data.\n\nKey Features\n\nTrigger Webhook: Seamlessly receive video IDs through a webhook trigger.\nFetch Video HTML: Retrieves the video’s HTML content directly from YouTube.\nExtract Subtitles URLs: Processes the HTML content to find and decode subtitle URLs.\nFetch Subtitles Content: Downloads the subtitles from the decoded URLs in XML format.\nGenerate Analytical Report: Utilizes an AI model to summarize and analyze the thematic essence of video content.\n   The system supports models such as Google Gemini, OpenAI, and other compatible language models. \n   The quality of the results may vary depending on the model used, with better models providing faster and more accurate summaries.\n   The default prompt focuses on identifying and summarizing the main theme of the video while excluding content related to promotions, subscriptions, or sponsored content.\nReturn Analytical Report: Delivers concise analytical reports as the final response to the webhook, suitable for various use cases like research, content creation, or consumption as plain text.\n\nSetup Instructions\n\nStep 1: Webhook Configuration\nSet up the webhook URL in your external system (e.g., app, API) to send YouTube video IDs to this workflow.\n\nStep 2: API Access\nEnsure that your environment has access to YouTube’s public HTML content. An API key is not required since the workflow parses publicly available data.\n\nStep 3: AI Integration\nVerify the connection to the AI model used for report generation. Supported models include Google Gemini and OpenAI.\nNote that the system can be customized by modifying the provided prompt to suit specific analysis needs.\n\nStep 4: Testing\nRun a sample test with a YouTube video ID to ensure subtitles are correctly retrieved and the report is generated successfully.\n\nExpected Outcomes\n\nEffortless Content Analysis:** Generate thematic reports with minimal setup.\nNo API Key Dependency:** Simplified access by leveraging YouTube’s public HTML.\nActionable Insights:** Gain valuable information on video content for business, research, or personal projects.\nCost Considerations:** The execution cost depends primarily on the model used and the length of the video (affecting token usage). Leveraging the free tier of Google Gemini models is recommended to minimize costs.\nMain Theme Extraction:** The default prompt excludes irrelevant promotional content, providing clear and focused thematic summaries.\n\nEstimated setup time: 15–20 minutes with a ready environment.\n\nPrompt Description\n\nThe workflow includes a customizable prompt used to process subtitles in XML format and generate analytical reports. The generated report includes:\n\nTitle: A brief phrase capturing the essence of the main theme.\nBody: An analytical description of the main theme, structured into a maximum of three concise paragraphs. It focuses on summarizing key ideas, recurring themes, and connections without referencing the source explicitly (e.g., avoiding phrases like “this video”). The system also removes content related to sales, subscriptions, or promotions to maintain a clear thematic focus.\n\nExample Output\n\nTitle: The Ethical Challenges of Artificial Intelligence  \n\nReport:  \nArtificial intelligence presents significant challenges in areas such as privacy, fairness, and automated decision-making. Its implementation in critical sectors such as healthcare, justice, and security has sparked debates about inherent biases and lack of transparency. Additionally, there is growing concern over the ethical implications of automation, including its impact on employment and the global economy. Finally, the importance of establishing strong regulatory frameworks is highlighted to balance technological innovation with the protection of human rights.\n\n",
  "totalViews": 428,
  "source": "official",
  "user": {
    "id": 92294,
    "name": "Mauricio Perera",
    "username": "rckflr",
    "bio": "Automation consultant with over 10 years of experience specializing in AI, no-code, and workflow optimization. I’ve delivered tailored AI and NLP solutions across real estate, healthcare, and more, enhancing efficiency and customer experiences. Proficient in tools like Make, Airtable, and Zapier, I also integrate GPT models to create scalable, innovative automations. Contact me to discuss custom n8n workflows or advanced automations to streamline your processes.",
    "verified": true,
    "links": "[\"https://www.linkedin.com/in/mauricioperera/\"]",
    "avatar": "https://gravatar.com/avatar/a6414920fb4353a63c1bf6af3e78e0b1387fa77adcf7610f9a7ff6e6d39ee757?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "AI",
    "Langchain"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "Basic LLM Chain",
      "type": "@n8n/n8n-nodes-langchain.chainLlm",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Chains",
          "Root Nodes"
        ]
      }
    },
    {
      "name": "Google Gemini Chat Model",
      "type": "@n8n/n8n-nodes-langchain.lmChatGoogleGemini",
      "categories": [
        "AI",
        "Langchain"
      ],
      "subcategories": {
        "AI": [
          "Language Models",
          "Root Nodes"
        ],
        "Language Models": [
          "Chat Models (Recommended)"
        ]
      }
    }
  ],
  "nodeCount": 4,
  "createdAt": "2024-12-20T02:18:31.382Z",
  "path": "official/template_2663/workflow.json"
}