{
  "id": 3280,
  "name": "Sync Shopify customers to Google Sheets + Squarespace compatible csv",
  "description": "This workflow retrieves all Shopify Customers and saves them into a Google Sheets spreadsheet using the Shopify Admin REST API. It uses pagination to ensure all customers are collected efficiently.\n\nN8n does not have built-in actions for Customers, so I built the workflow using an HTTP Request node.\n\nHow It Works\nThis workflow uses the HTTP Request node to fetch paginated chunks manually.\n\nShopify uses cursor-based pagination (page_info) instead of traditional page numbers.\nPagination data is stored in the response headers, so we need to enable Include Response Headers and Status in the HTTP Request node.\nThe workflow processes customer data, saves it to Google Sheets, and formats a compatible CSV for Squarespace Contacts import.\nThis workflow can be run on demand or scheduled to keep your data up to date.\n\nParameters\nYou can adjust these parameters in the HTTP Request node:\n\nlimit** – The number of customers per request (default: 50, max: 250).\nfields** – Comma-separated list of fields to retrieve.\npage_info** – Used for pagination; only limit and fields are allowed when paginating.\n\n📌 Note: When you query paginated chunks with page_info, only the limit and fields parameters are allowed.\n\nCredentials\nShopify API Key** – Required for authentication.\nGoogle Sheets API credentials** – Needed to insert data into the spreadsheet.\n\nGoogle Sheets Template\nClone this spreadsheet:\n📎 Google Sheets Template\n\nAccording to Squarespace documentation, your spreadsheet can have up to three columns and must be arranged in this order (no header):\n\nEmail Address  \nFirst Name (optional)  \nLast Name (optional)  \nShopify Customer ID (this field will be ignored)  \n\nExporting a Compatible CSV for Squarespace Contacts\nThis workflow also generates a CSV file that can be imported into Squarespace Contacts.\n\nHow to Import the CSV to Squarespace:\nOpen the Lists & Segments panel and click on your mailing list.\nClick Add Subscribers, then select Upload a list.\nClick Add a CSV file and select the file to import.\nToggle These subscribers accept marketing to confirm permission.\nPreview your list, then click Import.\n\nWho Is This For?\nShopify store owners** who need to export all customers to Google Sheets.\nAnyone looking for a flexible and scalable** Shopify customers extraction solution.\nSquarespace website owners** who want to bulk-create their Contacts using CSV.\n\nExplore More Templates  \n👉 Check out my other n8n templates\n",
  "totalViews": 370,
  "source": "official",
  "user": {
    "id": 92981,
    "name": "bangank36",
    "username": "bangank36",
    "bio": "Automation specialist with 10+ years of experience helping SME website owners streamline their workflows—specializing in Squarespace, Shopify, and WordPress. Book an initial consultation for custom n8n automation using my link.",
    "verified": true,
    "links": "[\"https://beyondspace.studio\"]",
    "avatar": "https://gravatar.com/avatar/499b5f6868bff3f56c51a6650bf87b946b25b2e17d353e3c9bbf5b34d2bd5bf4?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Productivity",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Google Sheets",
      "type": "n8n-nodes-base.googleSheets",
      "categories": [
        "Data & Storage",
        "Productivity"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2025-03-21T16:22:09.245Z",
  "path": "official/template_3280/workflow.json"
}