{
  "id": 2140,
  "name": "Add product ideas to Notion via a Slack command",
  "description": "Use Case\nIn most companies, employees have a lot of great ideas. That was the same for us at n8n. We wanted to make it as easy as possible to allow everyone to add their ideas to some formatted database - it should be somewhere where everyone is all the time and could add a new idea without much extra effort. Since we're using Slack, this seemed to be the perfect place to easily add ideas and collect them in Notion.\nWhat this workflow does\nThis workflow waits for a webhook call within Slack, that gets fired when users use the /idea command on a bot that you will create as part of this template. It then checks the command, adds the idea to Notion, and notifies the user about the newly added idea as you can see below:\n\nCreating your Slack bot\nVisit https://api.slack.com/apps, click on New App and choose a name and workspace.\nClick on OAuth & Permissions and scroll down to Scopes -&gt; Bot token Scopes\nAdd the chat:write scope\nHead over to Slash Commands and click on Create New Command\nUse /idea as the command\nCopy the test URL from the Webhook node into Request URL\nAdd whatever feels best to the description and usage hint\nGo to Install app and click install\nSetup\nAdd a Database in Notion with the columns Name and Creator\nAdd your Notion credentials and add the integration to your Notion page.\nFill the setup node below\nCreate your Slack app (see other sticky)\nClick Test workflow and use the /idea comment in Slack\nActivate the workflow and exchange the Request URL with the production URL from the webhook\nHow to adjust it to your needs\nYou can adjust the table in Notion and for example, add different types of ideas or areas that they impact\nYou might wanna add different templates in Notion to make it easier for users to fill their ideas with details\nRename the Slack command as it works best for you\nHow to enhance this workflow\nAt n8n we use this workflow in combination with some others. E.g. we have the following things on top:\nWe additionally have a /bug Slack command that adds a new bug to Linear. Here we're using AI to classify the bugs and move it to the right team. (see this template and this template)\nWe also added other types, like /pain to be less solution-driven\nTo make it easier for everyone to give input, we added a Votes column that allows everyone to vote on ideas/pain points in the list\nWe're also running a workflow once a week that highlights the most popular new ideas and the most active voters (see here)",
  "totalViews": 1118,
  "source": "official",
  "user": {
    "id": 91250,
    "name": "Niklas Hatje",
    "username": "nik8n",
    "bio": "Product Manager at n8n - Responsible for the creator program",
    "verified": true,
    "links": "[\"https://www.linkedin.com/in/niklashatje/\"]",
    "avatar": "https://gravatar.com/avatar/e16a4426e166713c34626bdde856b1cd15bb6787481a7ead9b74318f19e6259d?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes",
    "Productivity"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Notion",
      "type": "n8n-nodes-base.notion",
      "categories": [
        "Productivity"
      ],
      "subcategories": {}
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-02-28T15:15:49.996Z",
  "path": "official/template_2140/workflow.json"
}