{
  "id": 2603,
  "name": "Generate n8n Forms from Airtable and BaseRow Tables ",
  "description": "This n8n template showcases a cool feature of n8n Forms where the form itself can be defined dynamically using the form fields schema.\n\nIt may be debateable how useful this template actually is since both Airtable and Baserow provide form interfaces already but still a great exercise and demonstration if ever the use-case comes around.\n\nHow it works\nA form trigger is used to dynamically select a database/table from which to build the n8n form from.\nthe table's schema is imported into the workflow and using the code node, is converted into the n8n form fields schema.\nThis let's us dynamically build the fields in our n8n form when we choose to define the form using the JSON option.\nOnce the n8n form submits, we convert the values back into our table's API schema so that we can create a new row.\nNote any files/attachments fields are removed as they need to be handled separately.\nFiles are processed separately as they may first need to be stored. Once complete, the reference is saved into the newly created row.\n\nCheck out the example Airtable here - https://airtable.com/appfP15Xd0aVZR9xV/shrGFgXLyQ4Jg58SU\n\nHow to use\nThe n8n form is autogenerated which means you only need provide access to the table. Using this approach, this template can be reused for any number of Airtable and/or Baserow tables.\n\nRequirements\nYou'll need either an Airtable account or a Baserow account to use this template.\nAccessible n8n instance to your users\n\nCustomising this workflow\nNot using either Airtable or Baserow? Theoretically any datastore which provides a fields schema can be used with this template.\nIf you're feeling creative, split the table into multiple forms for a better user experience.",
  "totalViews": 1605,
  "source": "official",
  "user": {
    "id": 91804,
    "name": "Jimleuk",
    "username": "jimleuk",
    "bio": "Freelance consultant based in the UK specialising in AI-powered automations. I work with select clients tackling their most challenging projects. For business enquiries, send me an email at hello@jimle.uk\n\nLinkedIn: https://www.linkedin.com/in/jimleuk/\nX/Twitter: https://x.com/jimle_uk",
    "verified": true,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/4ab99e51473df76838beeaac908747f7928c625f869794815cabe34016967d51?r=pg&d=retro&size=200"
  },
  "categories": [
    "Data & Storage",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Airtable",
      "type": "n8n-nodes-base.airtable",
      "categories": [
        "Data & Storage"
      ],
      "subcategories": {}
    },
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2024-12-03T14:34:43.509Z",
  "path": "official/template_2603/workflow.json"
}