{
  "id": 3075,
  "name": "Error handling: Send email via Gmail on execution or trigger-level errors",
  "description": "This error handling workflow emails detailed notifications on workflow execution and trigger errors.\n\nIt extends Send email via Gmail on workflow error template by covering trigger-level errors.\n\nFeatures\nGet notifications on both main workflow trigger and execution time errors.\nSubject line will have failed workflow id, name, error source (execution or trigger), error message.\nBody will contain links to both failed and error handling workflows as well as execution or trigger-level error details.\nBody will also contain a machine readable and enriched JSON from Error Trigger describing the error.\n\nUse this error handling workflow for as many workflows as you need.\n\nConfigiration\nCopy this workflow to your workspace and, optionally, move it under the project that contains your main workflow\nIn this error handling workflow settings, set This workflow can be called by as appropriate\nIn Config node, define your app url, notifications recipient email, and sender name (useful to build filters in your inbox)\nIn Gmail node, create and select credentials\nIn your main workflow settings, pick this error handling workflow in the Error Workflow field (How to...)\n\nRelated resources\nn8n Error Trigger documentation.\n\nAuthor\nReach out Olek on community.n8n.io\nOlek on n8n creators hub",
  "totalViews": 1048,
  "source": "official",
  "user": {
    "id": 93022,
    "name": "Olek",
    "username": "olek",
    "bio": "I am a **dataholic** (I trust, everything can be quantified and measured) and an **automation** enthusiast.\n\nQ of the day: Why spending 1 hour doing a routinal staff when you could spend 1 day automating it and having fun?\n\nPM me on [community.n8n.io](https://community.n8n.io/u/olek/summary) and let me know what do you think about this Q above.",
    "verified": false,
    "links": "[\"\"]",
    "avatar": "https://gravatar.com/avatar/5b8c3cf791c26e3e81edfcb5e01c3a5c02daa253c37970151f7c102aef58bbb5?r=pg&d=retro&size=200"
  },
  "categories": [
    "Communication",
    "HITL",
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "Gmail",
      "type": "n8n-nodes-base.gmail",
      "categories": [
        "Communication",
        "HITL"
      ],
      "subcategories": {
        "HITL": [
          "Human in the Loop"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    },
    {
      "name": "HTML",
      "type": "n8n-nodes-base.html",
      "categories": [
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 3,
  "createdAt": "2025-03-03T17:57:35.311Z",
  "path": "official/template_3075/workflow.json"
}