{
  "id": 2521,
  "name": "Transfer credentials to other n8n instances using a Multi-Form",
  "description": "Purpose\n\nThis workflow allows you to transfer credentials from one n8n instance to another.\n\nHow it works\n\nA multi-form setup guides you through the entire process\nYou get to choose one of your predefined (in the Settings node) remote instances first\nThen all credentials of the current instance are being retrieved using the Execute Command node\nOn the next form page you can select one of the credentials by their name and initiate the transfer\nFinally the credential is being created on the remote instance using the n8n API. A final form ending indicates if that action succeeded or not.\n\nSetup\n\nSelect your credentials in the nodes which require those\nConfigure your remote instance(s) in the Settings node\n    Every instance is defined as object with the keys name, apiKey and baseUrl. Those instances are then wrapped inside an array. You can find an example described within a note on the workflow canvas.\n\nHow to use\n\nGrab the (production) URL of the Form from the first node\nOpen the URL and follow the instructions given in the multi-form\n\nDisclaimer\n\nPlease note, that this workflow can only run on self-hosted n8n instances, since it requires the Execute Command Node.\nSecurity: Beware, that all credentials are being decrypted and processed within the workflow. Also the API keys to other n8n instances are stored within the workflow.\nThis solution is primarily meant for transferring data between testing environments. For production use consider the n8n enterprise edition which provides a reliable way to manage credentials across different environments.",
  "totalViews": 1766,
  "source": "official",
  "user": {
    "id": 91699,
    "name": "Mario",
    "username": "octionic",
    "bio": "Workflow Optimization Expert | Software Architect. Use my link to book an initial consultation for custom built workflows using n8n.",
    "verified": true,
    "links": "[\"https://octionic.com\"]",
    "avatar": "https://gravatar.com/avatar/48bf351cec848d87566d8cc78c9a783ec4807408366648de04cfe955d7a5ba21?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    },
    {
      "name": "Code",
      "type": "n8n-nodes-base.code",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers",
          "Data Transformation"
        ]
      }
    }
  ],
  "nodeCount": 2,
  "createdAt": "2024-11-03T20:13:25.521Z",
  "path": "official/template_2521/workflow.json"
}