{
  "id": 3858,
  "name": "OpenAI ImageGen1 via HTTP Request (Edit Image)",
  "description": "Edit an existing image with OpenAI ImageGen1 via API Request\n\nTransform your creative pipeline by letting n8n call OpenAI ImageGen1’s edit image endpoint, automatically replacing or augmenting parts of any image you supply and returning a brand-new version in seconds. Designers, marketers, and product teams can eliminate repetitive manual edits and test more variations, faster.\n\nWho is this for?\nContent creators who need quick, on-brand image tweaks  \nMarketers running A/B visual tests at scale  \nDevelopers exploring the new ImageGen1 API inside low-code automations  \n\nUse case / problem solved\nOpening design software to mask, fill, or swap objects is slow and error-prone. This workflow feeds an input image plus a prompt to OpenAI ImageGen1, receives the edited output, and passes it on to any service you like—perfect for bulk-editing product shots, social visuals, or UI mocks.\n\nWhat this workflow does\nRead or receive the source image (Webhook → Binary Data).  \nCall OpenAI ImageGen1 with an HTTP Request node, sending the image and edit prompt.  \nParse the JSON response to capture the returned image URL.  \nDownload & hand off the edited file (e.g., upload to S3, post to Slack, or store in Drive).\n\nSetup\nAdd your OpenAI API key in the API KEY node.  \nFollow the notes on the workflow for more information. \n(Optional) Point the final node to your preferred storage or chat tool.  \n\n&gt; 📝 A sticky note in the workflow summarizes these steps and links to the OpenAI documentation.\n\nHow to customize this workflow\nTrigger alternatives**: Replace the Chat with Google Drive, Airtable, etc.  \nChained edits**: Loop the output back for successive prompts.  \nConditional flows**: Add an If node to branch actions by image size or category.  \n\nWith renamed nodes, color-coded sticky notes, and a concise setup guide, you’ll be editing images via OpenAI ImageGen1 in under five minutes—no code, maximum creativity.\n",
  "totalViews": 301,
  "source": "official",
  "user": {
    "id": 94257,
    "name": "TechDennis",
    "username": "techdennis",
    "bio": "",
    "verified": false,
    "links": "[]",
    "avatar": "https://gravatar.com/avatar/1aebd5e5260b20726cb9fb009801fc5bb911d6d47487b9ae005fa9154ec81c96?r=pg&d=retro&size=200"
  },
  "categories": [
    "Development",
    "Core Nodes"
  ],
  "nodes": [
    {
      "name": "HTTP Request",
      "type": "n8n-nodes-base.httpRequest",
      "categories": [
        "Development",
        "Core Nodes"
      ],
      "subcategories": {
        "Core Nodes": [
          "Helpers"
        ]
      }
    }
  ],
  "nodeCount": 1,
  "createdAt": "2025-05-04T13:35:07.714Z",
  "path": "official/template_3858/workflow.json"
}